[{"text": "It is pretty crazy how much higher per capita carbon emissions are in the U.S. than anywhere else. Then again, we are a country built on conspicuous consumption. \n\nChart from @IEA", "timestamp": "07:43 - 22. März 2019", "retweet_count": "8", "favorite_count": "9", "author": "AlanaSemuels", "is_retweet": true}, {"text": "One battery expert told me he went to tech companies a decade ago and told them he could double the life of their devices, keeping stuff out of the landfill. \"No one really cared,\" he said. \"Extending product life wasn’t consistent with growth on the financial side.\"", "timestamp": "09:48 - 21. März 2019", "retweet_count": "31", "favorite_count": "62", "author": "AlanaSemuels", "is_retweet": true}, {"text": "Remember when Apple launched the iPhone in 2007? Skeptics marveled at the company's aplomb, not allowing consumers to swap out batteries on their own. Now, that's the norm.", "timestamp": "09:47 - 21. März 2019", "retweet_count": "11", "favorite_count": "22", "author": "AlanaSemuels", "is_retweet": true}, {"text": "Part of the problem is that lithium ion batteries degrade each time they're used. They're also volatile, which means companies make devices so that consumers can't swap them out easily.", "timestamp": "09:45 - 21. März 2019", "retweet_count": "5", "favorite_count": "19", "author": "AlanaSemuels", "is_retweet": true}, {"text": "AirPods' early adopters are finding their batteries no longer last very long. \n\nBut there's no financial incentive for companies to make products that last a long time, because they won't sell as many.\n\nMy piece about the short life of devices today:", "timestamp": "09:38 - 21. März 2019", "retweet_count": "126", "favorite_count": "228", "author": "AlanaSemuels", "is_retweet": true}, {"text": "hi ken, can you contact me? I'm a reporter. alana@theatlantic.com", "timestamp": "09:35 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "AlanaSemuels", "is_retweet": true}, {"text": "Some good points in these recycling letters from readers about my story from last week. \nCompanies have to invest in recycling plants and consumer awareness if they actually want it to work.", "timestamp": "11:52 - 20. März 2019", "retweet_count": "14", "favorite_count": "27", "author": "AlanaSemuels", "is_retweet": true}, {"text": "Does the (apparent) failure of June mean gig economy companies can't succeed if they pledge to treat workers well?", "timestamp": "10:09 - 19. März 2019", "retweet_count": "1", "favorite_count": "2", "author": "AlanaSemuels", "is_retweet": true}, {"text": "It's very on-brand that our WeWork currently has a message from a tenant asking dog owners if they wouldn't mind picking up dogs feces in the kitchen.\n\n(The most used perk at WeWork seems to be getting someone else to clean up after you/wash your dishes)", "timestamp": "16:06 - 15. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "AlanaSemuels", "is_retweet": true}, {"text": "Nope, seventh generation. I think I am just used to the soft luxury of tissues made from virgin trees.", "timestamp": "10:35 - 15. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "AlanaSemuels", "is_retweet": true}]