[{"text": "I got my start holding community meetings in Chicago, so it was fun to be home for one tonight. Michelle and I want the world to come together on the South Side at a place built with local ideas, values, and hopes. That’s the @ObamaFoundation and Presidential Center.", "timestamp": "6:58 pm - 27 Feb 2018", "retweet_count": "36212", "favorite_count": "235549", "author": "BarackObama", "is_retweet": true}, {"text": "Young people have helped lead all our great movements. How inspiring to see it again in so many smart, fearless students standing up for their right to be safe; marching and organizing to remake the world as it should be. We've been waiting for you. And we've got your backs.", "timestamp": "8:00 am - 22 Feb 2018", "retweet_count": "435035", "favorite_count": "1609108", "author": "BarackObama", "is_retweet": true}, {"text": "Billy Graham was a humble servant who prayed for so many - and who, with wisdom and grace, gave hope and guidance to generations of Americans.", "timestamp": "8:33 am - 21 Feb 2018", "retweet_count": "33644", "favorite_count": "252175", "author": "BarackObama", "is_retweet": true}, {"text": "We are grieving with Parkland. But we are not powerless. Caring for our kids is our first job. And until we can honestly say that we're doing enough to keep them safe from harm, including long overdue, common-sense gun safety laws that most Americans want, then we have to change.", "timestamp": "9:12 am - 15 Feb 2018", "retweet_count": "364743", "favorite_count": "1290362", "author": "BarackObama", "is_retweet": true}, {"text": "Happy Valentine’s Day, @MichelleObama. You make every day and every place better.", "timestamp": "8:25 am - 14 Feb 2018", "retweet_count": "233183", "favorite_count": "1488952", "author": "BarackObama", "is_retweet": true}, {"text": "Dr. King was 26 when the Montgomery bus boycott began. He started small, rallying others who believed their efforts mattered, pressing on through challenges and doubts to change our world for the better. A permanent inspiration for the rest of us to keep pushing towards justice.", "timestamp": "6:46 am - 15 Jan 2018", "retweet_count": "359986", "favorite_count": "1426690", "author": "BarackObama", "is_retweet": true}, {"text": "All across America people chose to get involved, get engaged and stand up. Each of us can make a difference, and all of us ought to try. So go keep changing the world in 2018.", "timestamp": "8:11 am - 29 Dec 2017", "retweet_count": "111503", "favorite_count": "492868", "author": "BarackObama", "is_retweet": true}, {"text": "Ten-year-old Jahkil Jackson is on a mission to help homeless people in Chicago. He created kits full of socks, toiletries, and food for those in need. Just this week, Jahkil reached his goal to give away 5,000 “blessing bags.” That’s a story from 2017.", "timestamp": "8:10 am - 29 Dec 2017", "retweet_count": "47578", "favorite_count": "301842", "author": "BarackObama", "is_retweet": true}, {"text": "Chris Long gave his paychecks from the first six games of the NFL season to fund scholarships in Charlottesville, VA. He wanted to do more, so he decided to give away an entire season’s salary. That’s a story from 2017.", "timestamp": "8:10 am - 29 Dec 2017", "retweet_count": "64892", "favorite_count": "264469", "author": "BarackObama", "is_retweet": true}, {"text": "Kat Creech, a wedding planner in Houston, turned a postponed wedding into a volunteer opportunity for Hurricane Harvey victims. Thirty wedding guests became an organization of hundreds of volunteers. That’s a story from 2017.", "timestamp": "8:09 am - 29 Dec 2017", "retweet_count": "23008", "favorite_count": "152837", "author": "BarackObama", "is_retweet": true}, {"text": "As we count down to the new year, we get to reflect and prepare for what’s ahead. For all the bad news that seemed to dominate our collective consciousness, there are countless stories from this year that remind us what's best about America.", "timestamp": "8:09 am - 29 Dec 2017", "retweet_count": "170453", "favorite_count": "766144", "author": "BarackObama", "is_retweet": true}, {"text": "On behalf of the Obama family, Merry Christmas! We wish you joy and peace this holiday season.", "timestamp": "8:05 am - 25 Dec 2017", "retweet_count": "242186", "favorite_count": "1438426", "author": "BarackObama", "is_retweet": true}, {"text": "There's no better time than the holiday season to reach out and give back to our communities. Great to hear from young people at the Boys & Girls Club in DC today.", "timestamp": "2:39 pm - 14 Dec 2017", "retweet_count": "57528", "favorite_count": "404897", "author": "BarackObama", "is_retweet": true}, {"text": "Happy Hanukkah, everybody, from the Obama family to yours. Chag Sameach!", "timestamp": "4:17 pm - 12 Dec 2017", "retweet_count": "81243", "favorite_count": "671288", "author": "BarackObama", "is_retweet": true}, {"text": "Just got off a call to thank folks who are working hard to help more Americans across the country sign up for health coverage. But it's up to all of us to help spread the word: Sign up through this Friday at http://HealthCare.gov .", "timestamp": "12:16 pm - 11 Dec 2017", "retweet_count": "84355", "favorite_count": "220696", "author": "BarackObama", "is_retweet": true}, {"text": "Michelle and I are delighted to congratulate Prince Harry and Meghan Markle on their engagement. We wish you a lifetime of joy and happiness together.", "timestamp": "1:13 pm - 27 Nov 2017", "retweet_count": "110197", "favorite_count": "1129835", "author": "BarackObama", "is_retweet": true}, {"text": "From the Obama family to yours, we wish you a Happy Thanksgiving full of joy and gratitude.", "timestamp": "6:44 am - 23 Nov 2017", "retweet_count": "205878", "favorite_count": "1349655", "author": "BarackObama", "is_retweet": true}, {"text": "ME:  Joe, about halfway through the speech, I’m gonna wish you a happy birth--\nBIDEN:  IT’S MY BIRTHDAY!\nME:  Joe.\n \nHappy birthday to @JoeBiden, my brother and the best vice president anybody could have.", "timestamp": "11:02 am - 20 Nov 2017", "retweet_count": "483161", "favorite_count": "1960197", "author": "BarackObama", "is_retweet": true}, {"text": "This is what happens when the people vote. Congrats @RalphNortham and @PhilMurphyNJ . And congratulations to all the victors in state legislative, county and mayors' races. Every office in a democracy counts!", "timestamp": "5:25 am - 8 Nov 2017", "retweet_count": "70416", "favorite_count": "419053", "author": "BarackObama", "is_retweet": true}, {"text": "Every election matters - those who show up determine our future. Go vote tomorrow!", "timestamp": "5:02 pm - 6 Nov 2017", "retweet_count": "56037", "favorite_count": "188373", "author": "BarackObama", "is_retweet": true}]