[{"text": "Israel, Cyprus’ new partner, assisted ISIS and Al-Qaeda in Syria - arming them, treating their wounded and providing logistical support to - and both groups carried out mass killings of members of the Eastern Orthodox Church in Syria, including children. #Syria #Cyprus", "timestamp": "02:33 - 23. März 2019", "retweet_count": "67", "favorite_count": "80", "author": "DrMarcusP", "is_retweet": true}, {"text": "Please don’t put Russia on the same level as Britain. I assume you know what the British caused in Cyprus from the 1950s onwards. M", "timestamp": "01:51 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "DrMarcusP", "is_retweet": true}, {"text": "The ‘partnership’ between Cyprus, the US and Israel will strengthen American and Israeli influence in the Eastern Mediterranean, North Africa and the Middle East, while in Cyprus it will be the Cypriot elite who benefit at the expense of the security of ordinary Cypriots. #Cyprus", "timestamp": "01:50 - 23. März 2019", "retweet_count": "16", "favorite_count": "22", "author": "DrMarcusP", "is_retweet": true}, {"text": "Whilst Erdogan and Netanyahu do not like each other, the Turkish and Israeli establishments retain close ties with one another, as demonstrated by their coordinated efforts in Syria. Ankara and Tel Aviv work closely together partly because of mutual foes: Syria and Iran. #Cyprus", "timestamp": "01:44 - 23. März 2019", "retweet_count": "7", "favorite_count": "13", "author": "DrMarcusP", "is_retweet": true}, {"text": "Not only is it laughable but it is also highly dangerous for #Cyprus to get into bed with America and Israel. The US gives Turkey a blank cheque to do as it pleases and consented to the Turkish invasion of Cyprus. And Israel and Turkey are partners, brought together by the US.", "timestamp": "01:39 - 23. März 2019", "retweet_count": "11", "favorite_count": "23", "author": "DrMarcusP", "is_retweet": true}, {"text": "In recent times, Cypriot officials, including diplomats, have started to discourage Greek Cypriots from discussing the ethnic cleansing that Turkey committed against the Greek population in Cyprus, in 1974. Alas, the American puppet master has made his move in #Cyprus.", "timestamp": "16:25 - 22. März 2019", "retweet_count": "8", "favorite_count": "7", "author": "DrMarcusP", "is_retweet": true}, {"text": "Cyprus and Greece are complicit in the aggression of, and crimes by, America and Israel in the Middle East. Nicosia and Athens have the blood of Syrians and Palestinians on their hands. How the Americans must laugh at their puppets in #Cyprus and #Greece.", "timestamp": "16:14 - 22. März 2019", "retweet_count": "24", "favorite_count": "32", "author": "DrMarcusP", "is_retweet": true}, {"text": "Despite America having given Turkey the go-ahead to invade and partition Cyprus in 1974, here we have the Cypriot President today entering his country into a partnership with the US. The American ability to find puppets to run their client states is startling. #Cyprus", "timestamp": "16:08 - 22. März 2019", "retweet_count": "12", "favorite_count": "30", "author": "DrMarcusP", "is_retweet": true}, {"text": "For America, Israel’s illegal occupation of the Golan Heights, Turkey’s illegal occupation of the north of Cyprus, Greater Albania’s occupation of Serbia’s Kosovo and Metohija, and Israel’s illegal occupation of Palestinian land all serve US power. For the US, might is right.", "timestamp": "02:15 - 22. März 2019", "retweet_count": "112", "favorite_count": "215", "author": "DrMarcusP", "is_retweet": true}, {"text": "The so-called Republic of Kosovo, or better known as the Republic of Heroin, is defiling not just the people of the Balkans but the rest of the population of Europe, too. Defiling with drug trafficking, people trafficking, gun trafficking and organ trafficking. #KosovojeSrbija", "timestamp": "04:01 - 21. März 2019", "retweet_count": "125", "favorite_count": "276", "author": "DrMarcusP", "is_retweet": true}, {"text": "“Iran prevented the cancerous tentacles of the Taliban from extending from Afghanistan into the Middle East hence Iran was an effective buffer against the Taliban.” My latest appearance on Press TV’s The Debate: https://www.youtube.com/watch?v=PpWds1rDKxk …", "timestamp": "16:20 - 19. März 2019", "retweet_count": "8", "favorite_count": "16", "author": "DrMarcusP", "is_retweet": true}, {"text": "“I am optimistic. If the Iranian economy was able to survive the 1980s and the 1990s, then it is going to survive today. Iran’s economy is more robust than what a lot of commentators realise.” My latest appearance on Kalima Horra, discussing #Iran: https://www.youtube.com/watch?v=XehGX_9KwdU …", "timestamp": "05:26 - 19. März 2019", "retweet_count": "6", "favorite_count": "14", "author": "DrMarcusP", "is_retweet": true}, {"text": "But I do. And I have been for many years now. M", "timestamp": "03:08 - 19. März 2019", "retweet_count": "0", "favorite_count": "6", "author": "DrMarcusP", "is_retweet": true}, {"text": "Absolutely not true. M", "timestamp": "02:35 - 18. März 2019", "retweet_count": "0", "favorite_count": "9", "author": "DrMarcusP", "is_retweet": true}, {"text": "Nothing would be achieved if Serbs were to only replace Vucic, including replacing him with someone from the so-called opposition. What Serbs need to do is overthrow the pro-Western system in Serbia and expel or jail the political elite, including the ‘opposition’. #Srbija", "timestamp": "01:45 - 18. März 2019", "retweet_count": "86", "favorite_count": "237", "author": "DrMarcusP", "is_retweet": true}, {"text": "“Anti-Muslim sentiments are widespread in British mainstream media, such as in The Sun, The Times and The Daily Telegraph. Those newspapers need to be held to account.” I discussed the terrorist attack in #Christchurch: https://www.youtube.com/watch?v=4R4DMY6ZLbw …", "timestamp": "11:33 - 17. März 2019", "retweet_count": "5", "favorite_count": "22", "author": "DrMarcusP", "is_retweet": true}, {"text": "", "timestamp": "11:24 - 17. März 2019", "retweet_count": "11", "favorite_count": "26", "author": "DrMarcusP", "is_retweet": true}, {"text": "Today, in Europe, there was a parade of Waffen SS veterans. That parade extolled the Waffen SS and the crimes it committed. To the ‘editors’ of The Times, The Daily Telegraph, The Sun and The Spectator: Will you cover the Waffen SS parade in NATO member #Latvia? #AntiSemitism", "timestamp": "09:04 - 17. März 2019", "retweet_count": "39", "favorite_count": "72", "author": "DrMarcusP", "is_retweet": true}, {"text": "Serbs fought against Islamism in Bosnia and Kosovo and Metohija at a time when most people in the world had never heard of Al-Qaeda and Osama bin Laden. But because today Serbia is a client state of America’s, Serbia has become an ally to Islamists. So, Serbia must free itself.", "timestamp": "07:34 - 17. März 2019", "retweet_count": "71", "favorite_count": "198", "author": "DrMarcusP", "is_retweet": true}, {"text": "America instructed the pro-Western Serbian elite to provide arms to Islamist terrorist groups fighting in Syria, including Al-Qaeda. Alas, the Americans have made Serbia an ally to Islamist terrorists, while Serbian arms have killed Syrians in their fight against Islamism.", "timestamp": "07:28 - 17. März 2019", "retweet_count": "21", "favorite_count": "48", "author": "DrMarcusP", "is_retweet": true}, {"text": "Kosovo is Serbia. Kosovo is Serbia. Kosovo and Metohija always has been sacred Serbian soil and always will be. Serbia’s Jerusalem will one day be cleansed of organ traffickers, drug traffickers, gun traffickers, extremists, NATO and all other criminal groups. #KosovojeSrbija", "timestamp": "06:51 - 17. März 2019", "retweet_count": "165", "favorite_count": "473", "author": "DrMarcusP", "is_retweet": true}, {"text": "The American embassy in Belgrade must be monitored closely by Serbs as American operatives could leave the building in order to instigate violence and then blame this on the protesters as a way of coming to Vucic’s aid. America is the mother of all enemies to Serbia and Serbs.", "timestamp": "06:21 - 17. März 2019", "retweet_count": "75", "favorite_count": "173", "author": "DrMarcusP", "is_retweet": true}, {"text": "Treacherous individuals have obtained positions of influence in Serbia, from politicians to journalists to business people to academics, from which they have sold the Serbian people to Washington and Brussels. My message to those traitors is clear: flee now to the US or the EU.", "timestamp": "05:44 - 17. März 2019", "retweet_count": "27", "favorite_count": "77", "author": "DrMarcusP", "is_retweet": true}, {"text": "Kosovo is Serbia. That fact has been disregarded by Vucic and the Serbian elite, including the ‘opposition’. Vucic has met with the organised crime leaders of Pristina and the NATO and EU chiefs to discuss how Serbia can detach itself from the cradle of Serbian civilisation.", "timestamp": "05:31 - 17. März 2019", "retweet_count": "100", "favorite_count": "290", "author": "DrMarcusP", "is_retweet": true}, {"text": "Vucic is one of the most awful of traitors and collaborators that Serbia has ever known in its history. He and the rest of the Serbian elite need to be given a one-way ticket to prison, while the pro-Western system in Serbia needs to be overthrown and destroyed. #Beograd #Srbija", "timestamp": "05:01 - 17. März 2019", "retweet_count": "132", "favorite_count": "357", "author": "DrMarcusP", "is_retweet": true}, {"text": "Since October 2000, Serbia has been a colony of the West, in which Serbian traitors have sold Serbia’s industries and resources to foreigners and have allowed the Serbian market to be flooded with foreign goods and the Serbian people to become cheap labour. #Beograd #Srbija", "timestamp": "04:56 - 17. März 2019", "retweet_count": "91", "favorite_count": "238", "author": "DrMarcusP", "is_retweet": true}, {"text": "Despite all of the attempts, over three decades now, by the West and their quislings to break and subdue the Serbian people, events tonight in Belgrade demonstrate that Serbs can never be broken and can never be turned into slaves. Samo sloga Srbina spasava! #Beograd #Srbija", "timestamp": "14:31 - 16. März 2019", "retweet_count": "78", "favorite_count": "237", "author": "DrMarcusP", "is_retweet": true}, {"text": "Even at times as tragic as these, there are some people who attempt to exploit the terrible loss of human life for political gain. Such people are devoid of morals and are, quite simply,  repugnant beings. #ChristChurch", "timestamp": "06:57 - 16. März 2019", "retweet_count": "40", "favorite_count": "140", "author": "DrMarcusP", "is_retweet": true}, {"text": "The attack on Serbian history continues by the quisling Vucic and the pro-Western system in #Serbia. The Aeronautical Museum is to be closed down and part of Kalamegdan has been demolished. All to destroy Serbian culture and turn Belgrade into something like soulless Dubai.", "timestamp": "03:56 - 16. März 2019", "retweet_count": "141", "favorite_count": "386", "author": "DrMarcusP", "is_retweet": true}]