[{"text": "The world has become engulfed in what @R_Thaler calls “sludge” - complex crap that effectively impoverishes us. Time to clean it up. \nhttps://www.thetimes.co.uk/article/let-s-clean-up-the-sludge-of-our-complex-lives-7gkhr8kwg?shareToken=50196929996b2dc0c26694c6f63529e7 …", "timestamp": "10:15 - 22. März 2019", "retweet_count": "3", "favorite_count": "7", "author": "EdConwaySky", "is_retweet": true}, {"text": "This fascinating article by @BenGoldsmith leaves one begging the question: why did we ever allow Beavers to go extinct in this country? And why haven't we introduced more of them back to the wild yet? Nature's way of protecting us from flooding & drought", "timestamp": "06:10 - 22. März 2019", "retweet_count": "1", "favorite_count": "10", "author": "EdConwaySky", "is_retweet": true}, {"text": "Fascinating! Will check it out...", "timestamp": "03:49 - 22. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "EdConwaySky", "is_retweet": true}, {"text": "What a gem. Thank you", "timestamp": "03:14 - 22. März 2019", "retweet_count": "1", "favorite_count": "0", "author": "EdConwaySky", "is_retweet": true}, {"text": "Well done @kprescott for crediting @MarkKleinmanSky for his Debenhams story on @BBCr4today this am. If only all BBC journalists would show similar bravery/generosity rather than (as all too frequently happens) ripping off other outlets’ stories & passing them off as their own...", "timestamp": "03:13 - 22. März 2019", "retweet_count": "13", "favorite_count": "38", "author": "EdConwaySky", "is_retweet": true}, {"text": "Yes precisely", "timestamp": "01:57 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "EdConwaySky", "is_retweet": true}, {"text": "It’s the most potent economic weapon of our age. Politicians, businesses & financiers use it as a tool to impoverish us. It increased inequality. But it also has the power to improve all our lives. My @thetimes column on the uses and abuses of complexity", "timestamp": "01:43 - 22. März 2019", "retweet_count": "10", "favorite_count": "26", "author": "EdConwaySky", "is_retweet": true}, {"text": "Frustratingly I believe not. I think there’s a CD though and maybe iTunes audiobook", "timestamp": "12:03 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "EdConwaySky", "is_retweet": true}, {"text": "I keep asking myself the same question! Got optioned but am not sure whether rights have expired...", "timestamp": "11:58 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "EdConwaySky", "is_retweet": true}, {"text": "Now I promise the above wasn't intended as an ad for my book abt Bretton Woods. But some of it does indeed come from The Summit which you can find here: https://www.amazon.co.uk/Summit-Biggest-Battle-Second-fought/dp/1408704927 …. Also check out this excellent @RichardToye paper on the Commons vote: https://ore.exeter.ac.uk/repository/bitstream/handle/10036/17792/Churchill%20%20US%20loan.pdf … ENDS", "timestamp": "09:03 - 21. März 2019", "retweet_count": "5", "favorite_count": "54", "author": "EdConwaySky", "is_retweet": true}, {"text": "Plus: unlike Attlee this govt has no majority. It's even more split. There's scant genuine cross-party dialogue. & the equation's even more complex because Parliament isn't the only protagonist: there's the other 27 EU states too. So the signs are not especially encouraging. 16/", "timestamp": "08:58 - 21. März 2019", "retweet_count": "2", "favorite_count": "20", "author": "EdConwaySky", "is_retweet": true}, {"text": "Might the same thing happen this time? Might the PM get her Brexit deal through the House thanks to opposition abstentions? Gotta say it looks unlikely right now. Corbyn a v different politician to Churchill, who said of the Attlee govt \"We must do all we can to help them\" 15/", "timestamp": "08:57 - 21. März 2019", "retweet_count": "6", "favorite_count": "24", "author": "EdConwaySky", "is_retweet": true}, {"text": "The deal eventually passed 345-98. How? Rather than opposing it, opposition whips urged their members to abstain instead. Was seen as a big humiliation for Churchill. Even so, 29 MPs from govt benches voted against. And that's how Bretton Woods & the post-war loan became law 14/", "timestamp": "08:56 - 21. März 2019", "retweet_count": "6", "favorite_count": "21", "author": "EdConwaySky", "is_retweet": true}, {"text": "The Commons debates over the loan and Bretton Woods were fraught and dramatic. There were protests outside Parliament. MPs were derided for advocating a dilution of Britain's sovereignty. There were plenty of similarities with today's Brexit saga. So how did it all end...?  13/", "timestamp": "08:52 - 21. März 2019", "retweet_count": "4", "favorite_count": "18", "author": "EdConwaySky", "is_retweet": true}, {"text": "Boothby was an interesting fellow. Not unlike certain Brexiteers now he was a charismatic Tory who refused to toe the party line & was frequently on radio & papers railing against the deal. Oh & he was having an affair with Harold Macmillan's wife (as hinted at in The Crown) 12/", "timestamp": "08:51 - 21. März 2019", "retweet_count": "6", "favorite_count": "19", "author": "EdConwaySky", "is_retweet": true}, {"text": "\"This is our economic Munich\" declared Bob Boothby in the Commons. \"There is one mandate which HM Govt never got from the people and that was to sell the British Empire for a packet of cigarettes\", whereupon he threw a pack of fags onto the floor of the House, causing uproar 11/", "timestamp": "08:50 - 21. März 2019", "retweet_count": "3", "favorite_count": "22", "author": "EdConwaySky", "is_retweet": true}, {"text": "The Tories (in opposition following Churchill's defeat in the 1945 election) were totally split. A splinter group, not unlike today's ERG, refused to sign up to anything diminishing the UK's sovereignty. 10/", "timestamp": "08:49 - 21. März 2019", "retweet_count": "4", "favorite_count": "17", "author": "EdConwaySky", "is_retweet": true}, {"text": "Anyway, the Attlee govt were desperate to try to rush this deal (loan plus Bretton Woods) through Parliament as quickly as possible, warning the UK would face bankruptcy if not. MP were horrified. Forced to make most important econ decisions in generations at barrel of a gun! 9/", "timestamp": "08:48 - 21. März 2019", "retweet_count": "3", "favorite_count": "18", "author": "EdConwaySky", "is_retweet": true}, {"text": "Footnote: Keynes was v unwell at this stage & his quack doctor prescribed him something called sodium amytal for heart disease. Turns out the drug is also a truth serum. At the v moment he most needed his poker face, Keynes was high on a drug that compels you tell the truth 8/", "timestamp": "08:47 - 21. März 2019", "retweet_count": "13", "favorite_count": "62", "author": "EdConwaySky", "is_retweet": true}, {"text": "Keynes boasted that he was so good at negotiating the US would prob gift the UK billions. But the Americans played hardball. UK ended up with a $3.75bn loan at 2% interest rates for decades. Plus a poisonous condition: it wld have to sign up to Bretton Woods earlier than exp 7/", "timestamp": "08:47 - 21. März 2019", "retweet_count": "6", "favorite_count": "22", "author": "EdConwaySky", "is_retweet": true}, {"text": "The UK was effectively bankrupt. The war had taken its toll & adding to the pain in 1945 the US cut off lend-lease, its wartime financial bailout. Some Tory MPs rubbed their hands in glee. Sovereignty! The Chancellor sent Keynes off to Washington to negotiate a new loan 6/", "timestamp": "08:46 - 21. März 2019", "retweet_count": "6", "favorite_count": "21", "author": "EdConwaySky", "is_retweet": true}, {"text": "There were some MPs in both Conservative and Labour party (particularly the Tories) who resented the infringement on UK sovereignty. They would rather the UK crashed out and reinforced economic links with the Empire. This, by the way, was not simply an academic matter... 5/", "timestamp": "08:45 - 21. März 2019", "retweet_count": "5", "favorite_count": "15", "author": "EdConwaySky", "is_retweet": true}, {"text": "This historic agreement locked the UK (& other countries) into a kind of economic union for decades. Britain (most notably JM Keynes) was one of the key designers of the system and its institutions, the IMF and World Bank. But it wasn't without controversy back home... 4/", "timestamp": "08:44 - 21. März 2019", "retweet_count": "5", "favorite_count": "17", "author": "EdConwaySky", "is_retweet": true}, {"text": "Towards end of WW2 Allied powers realised they'd have to rebuild the international monetary system that fell apart in the 1930s (contributing to the depression). They came up with the Bretton Woods system: everyone would peg their currencies to the US$ and it in turn to gold 3/", "timestamp": "08:44 - 21. März 2019", "retweet_count": "6", "favorite_count": "19", "author": "EdConwaySky", "is_retweet": true}, {"text": "Actually there is at least one historical analogy. A do-or-die moment with MPs struggling to choose between diluting their economic sovereignty and a \"financial Dunkirk\". So here is the story of what happened in Dec 1945. Let's see if there are any lessons for today... 2/", "timestamp": "08:43 - 21. März 2019", "retweet_count": "7", "favorite_count": "17", "author": "EdConwaySky", "is_retweet": true}, {"text": "THREAD: UK on brink of Parliamentary vote which will seal our economic fate for decades to come. Sovereignty at stake. Both govt & opposition desperately split. And the threat of an economic crunch if the Commons doesn't play ball. Unprecedented, right? Wrong... 1/", "timestamp": "08:42 - 21. März 2019", "retweet_count": "116", "favorite_count": "212", "author": "EdConwaySky", "is_retweet": true}, {"text": "Reading between lines, isn't what's happened in the past 24hrs simply a manifestation of TM realising she can't win the ERG over? Now, rather than threaten her deal vs extension to appeal to Brexiteers she's threatening her deal vs no deal to appeal to Labour. What am I missing?", "timestamp": "06:09 - 21. März 2019", "retweet_count": "6", "favorite_count": "15", "author": "EdConwaySky", "is_retweet": true}, {"text": "Bank of England: 80% of firms say they are ready for a no-deal no-transition Brexit", "timestamp": "05:06 - 21. März 2019", "retweet_count": "8", "favorite_count": "9", "author": "EdConwaySky", "is_retweet": true}, {"text": "No surprises", "timestamp": "05:00 - 21. März 2019", "retweet_count": "1", "favorite_count": "5", "author": "EdConwaySky", "is_retweet": true}, {"text": "This seems to be the main thing going on: UK firms selling overseas securities. Actually, investment in UK assets rose sharply. So not a sign of capital flight: maybe even the opposite", "timestamp": "03:49 - 21. März 2019", "retweet_count": "12", "favorite_count": "10", "author": "EdConwaySky", "is_retweet": true}, {"text": "This doesn't look good. Net investment by UK financial institutions plunges to lowest level since records began in the 1980s https://www.ons.gov.uk/economy/investmentspensionsandtrusts/bulletins/mq5investmentbyinsurancecompaniespensionfundsandtrusts/octobertodecember2018 …", "timestamp": "03:37 - 21. März 2019", "retweet_count": "79", "favorite_count": "58", "author": "EdConwaySky", "is_retweet": true}, {"text": "Two pieces of strong economic news today: punchy growth in retail sales in Feb and another fall in the deficit thanks partly high income tax revenues. Turns out the UK economy isn't doing all that badly at the moment...", "timestamp": "03:04 - 21. März 2019", "retweet_count": "117", "favorite_count": "194", "author": "EdConwaySky", "is_retweet": true}, {"text": "It's where people work, so it is distorted by commuting. But further down on my original thread is GDHI which is I think based on where people live", "timestamp": "10:53 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "EdConwaySky", "is_retweet": true}, {"text": "This is pretty important", "timestamp": "06:37 - 20. März 2019", "retweet_count": "11", "favorite_count": "18", "author": "EdConwaySky", "is_retweet": true}, {"text": "We would much rather a cat or a criminal was mown down by a self-driving car than a dog, apparently < https://www.nature.com/articles/s41586-018-0637-6.epdf …", "timestamp": "05:25 - 20. März 2019", "retweet_count": "1", "favorite_count": "4", "author": "EdConwaySky", "is_retweet": true}, {"text": "There are subtle differences but they are used pretty interchangably these days. eg I believe monthly GDP estimates are based on GVA. And yes it's production based - though again the production measure of GDP should, in theory at least, sum to the same thing as the income measure", "timestamp": "05:11 - 20. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "EdConwaySky", "is_retweet": true}, {"text": "True. Tower Hamlets figs massively distorted by Canary Wharf", "timestamp": "01:39 - 20. März 2019", "retweet_count": "1", "favorite_count": "1", "author": "EdConwaySky", "is_retweet": true}, {"text": "Nonsense. It may not accord with your anecdotal impressions but this is what the GVA figs tell us. As you can see from further down my thread the broad picture is not dissimilar in terms of gross household disposable income too.", "timestamp": "01:38 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "EdConwaySky", "is_retweet": true}, {"text": "Another perspective: gross disposable household income per head. Less distorted by commuting but the story is much the same. Every UK region save for five in London has GDHI lower than £30k. Disposable income in Perth is higher than in Barking. Edinburgh higher than Croydon.", "timestamp": "07:49 - 19. März 2019", "retweet_count": "18", "favorite_count": "31", "author": "EdConwaySky", "is_retweet": true}, {"text": "I fear this is overly pedantic. True: adjust for commuting & the peaks diminish considerably. But still: the concentration of income is largely in a few select London boroughs, with a surprisingly long tail. Remove those boroughs & regional income distribution is pretty even", "timestamp": "07:42 - 19. März 2019", "retweet_count": "0", "favorite_count": "5", "author": "EdConwaySky", "is_retweet": true}, {"text": "Thanks. Does anyone do it down to NUTS3?", "timestamp": "07:15 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "EdConwaySky", "is_retweet": true}, {"text": "Hi Tom. When I said income I really meant national income (eg GDP or GVA) rather than earnings. But I take your point re commuting. And nice map in yr thread. is that ASHE data?", "timestamp": "07:04 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "EdConwaySky", "is_retweet": true}, {"text": "Oops. Yes good point. Done slightly in haste between lives but will try to add the rest later. Thank you.", "timestamp": "06:28 - 19. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "EdConwaySky", "is_retweet": true}, {"text": "Quite. I have your book queued up and ready to read soon btw. Looking forward to it...", "timestamp": "06:10 - 19. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "EdConwaySky", "is_retweet": true}, {"text": "Milton Keynes has a higher GDP per head than Islington/Haringey. Belfast has higher GDP per head than Richmond upon Thames/Hounslow. The UK's regional inequality is far more complex than being all about London vs everyone else", "timestamp": "06:04 - 19. März 2019", "retweet_count": "24", "favorite_count": "46", "author": "EdConwaySky", "is_retweet": true}, {"text": "Here is every UK NUTS3 region's GDP per head and I've highlighted the London boroughs in red. Yes they are predominately towards the top. But not all. Redbridge & Waltham Forest has lower GDP per head than Cornwall/Scilly Isles", "timestamp": "06:02 - 19. März 2019", "retweet_count": "22", "favorite_count": "41", "author": "EdConwaySky", "is_retweet": true}, {"text": "Perhaps - though one surely couldn't say that about Westminster, which is not far off (£260k) but has a large and quite socially diverse population...?", "timestamp": "05:54 - 19. März 2019", "retweet_count": "1", "favorite_count": "2", "author": "EdConwaySky", "is_retweet": true}, {"text": "The REAL story of the UK income divide isn't abt London vs the rest. It's abt four parts of London: the City, Canary Wharf (in Tower Hamlets), K&C and Westminster vs the rest. EVERY OTHER UK region (inc parts of London) has GDP/head below £50k. In City of London/Camden it's £342k", "timestamp": "05:51 - 19. März 2019", "retweet_count": "195", "favorite_count": "239", "author": "EdConwaySky", "is_retweet": true}, {"text": "For most of recent history non-UK born workers' employment growth has far exceeded UK-born employment growth. Following the EU referendum that relationship has reversed", "timestamp": "05:03 - 19. März 2019", "retweet_count": "11", "favorite_count": "14", "author": "EdConwaySky", "is_retweet": true}, {"text": "Employment in the UK public sector rose by 1.2% in the past year, the fastest increase in a decade", "timestamp": "03:25 - 19. März 2019", "retweet_count": "8", "favorite_count": "11", "author": "EdConwaySky", "is_retweet": true}, {"text": "Oops", "timestamp": "02:36 - 19. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "EdConwaySky", "is_retweet": true}, {"text": "Thanks @adamboultonSKY. Though for what it's worth I went to neither Eton nor Erin", "timestamp": "10:46 - 18. März 2019", "retweet_count": "0", "favorite_count": "8", "author": "EdConwaySky", "is_retweet": true}, {"text": "Pound dips after speaker effectively rules out another #Brexit meaningful vote if it's substantially the same as the last one. Sterling had been weakening most of today amid growing realisation this week may not bring breakthrough. Still higher than early last week... Here vs US$", "timestamp": "08:58 - 18. März 2019", "retweet_count": "4", "favorite_count": "7", "author": "EdConwaySky", "is_retweet": true}, {"text": "How sad. Former economic adviser to the White House and a fine economist.", "timestamp": "07:23 - 18. März 2019", "retweet_count": "1", "favorite_count": "4", "author": "EdConwaySky", "is_retweet": true}, {"text": "Around 3.3% of total global trade is fake or counterfeit goods. Shoes, clothes, electronics, perfumes etc. And here's where they mostly come from. From a new report from the @OECD", "timestamp": "04:38 - 18. März 2019", "retweet_count": "6", "favorite_count": "9", "author": "EdConwaySky", "is_retweet": true}]