[{"text": "\"But if you’re interested in asserting control over college campuses, or in pushing your ideological line rather than defending free speech across the board, then what Ingraham did made total sense.\"", "timestamp": "10:33 - 22. März 2019", "retweet_count": "58", "favorite_count": "214", "author": "ezraklein", "is_retweet": true}, {"text": "This, to me, is the key. The economy is priced into Trump's polling now and his numbers are upside down and he's running behind all Democrats in head-to-head match-ups. \n\nAnd worse for Trump, economic growth appears to be slowing.", "timestamp": "09:32 - 22. März 2019", "retweet_count": "101", "favorite_count": "384", "author": "ezraklein", "is_retweet": true}, {"text": "\"Fiber is the closest thing we have to a true superfood.\"", "timestamp": "14:55 - 21. März 2019", "retweet_count": "73", "favorite_count": "289", "author": "ezraklein", "is_retweet": true}, {"text": "Chuck Schumer on the filibuster: \"Let me just say this. Get the majority. Beat Trump. We’ll leave discussion of rules to next year.\"", "timestamp": "11:27 - 21. März 2019", "retweet_count": "36", "favorite_count": "129", "author": "ezraklein", "is_retweet": true}, {"text": "It took one mass shooting for New Zealand to ban assault weapons:", "timestamp": "11:24 - 21. März 2019", "retweet_count": "137", "favorite_count": "495", "author": "ezraklein", "is_retweet": true}, {"text": "Seriously, this is dark. https://www.scoutsongs.com/lyrics/baby-shark.html …", "timestamp": "10:12 - 21. März 2019", "retweet_count": "59", "favorite_count": "267", "author": "ezraklein", "is_retweet": true}, {"text": "TIL the Baby Shark song is a decades-old old summer camp song that's been repackaged by YouTube hitmakers and some of the older variants end with people being eaten and bleeding out in the water.", "timestamp": "10:12 - 21. März 2019", "retweet_count": "47", "favorite_count": "183", "author": "ezraklein", "is_retweet": true}, {"text": "Also a Medicaid bill in there, plus a bill that inexplicably calls the new insurance program it's creating by an entirely new name rather than calling it Medicare like everyone else is doing", "timestamp": "11:51 - 20. März 2019", "retweet_count": "8", "favorite_count": "60", "author": "ezraklein", "is_retweet": true}, {"text": "Medicare for all vs. Medicare for most vs. Medicare for more", "timestamp": "11:47 - 20. März 2019", "retweet_count": "58", "favorite_count": "144", "author": "ezraklein", "is_retweet": true}, {"text": "This is right. An early VP pick in a field this crowded guarantees you won't get your choice of VP candidates, and you won't be able to use the VP pick to heal rifts from the primary or buttress weaknesses that only come clear during the campaign.", "timestamp": "11:44 - 20. März 2019", "retweet_count": "59", "favorite_count": "281", "author": "ezraklein", "is_retweet": true}, {"text": "\"These negative health risks don’t necessarily stem from racist individuals. The health risks rise when the politics of racial resentment shapes the health care policies, the health policies, in your state or community.\"", "timestamp": "10:48 - 19. März 2019", "retweet_count": "72", "favorite_count": "160", "author": "ezraklein", "is_retweet": true}, {"text": "This is an important piece on how a new generation of economists have built a powerful empirical case for higher taxes on the rich, and how a new generation of Democratic leaders are taking that research and running with it:", "timestamp": "09:08 - 19. März 2019", "retweet_count": "379", "favorite_count": "946", "author": "ezraklein", "is_retweet": true}, {"text": "The Overton window, it moves!", "timestamp": "12:59 - 18. März 2019", "retweet_count": "41", "favorite_count": "292", "author": "ezraklein", "is_retweet": true}, {"text": "Are there erased stories about marginalized communities in the US or abroad that you think we should we cover? Is there a particular historical conflict that happened in your town that you think the world needs to know about? \n\nTell us about it here:", "timestamp": "12:04 - 18. März 2019", "retweet_count": "54", "favorite_count": "107", "author": "ezraklein", "is_retweet": true}, {"text": "We're looking for untold or underreported histories to make more videos like this one, on the 1921 Tulsa race massacre:", "timestamp": "12:04 - 18. März 2019", "retweet_count": "41", "favorite_count": "125", "author": "ezraklein", "is_retweet": true}, {"text": "Gutting to hear that Alan Krueger has passed away. Not just one of the greatest labor economists of his generation, but someone who worked tirelessly to translate economic research into policy that would help people. And beyond all that, a gentle, generous guy.", "timestamp": "10:10 - 18. März 2019", "retweet_count": "161", "favorite_count": "1426", "author": "ezraklein", "is_retweet": true}, {"text": "\"When I was filming with some of the white supremacists, I would hear them complimenting jihadis...What they would say is that, you know, what we really need is we need our men to be as committed as they are.\"", "timestamp": "14:26 - 14. März 2019", "retweet_count": "108", "favorite_count": "199", "author": "ezraklein", "is_retweet": true}, {"text": "\"Brokenness is something that cannot be underestimated.\"\n\n@Deeyah_Khan spent months with jihadists and white supremacists. What she learned, both about the appeal of these movements and about humans in general, is important and maybe even hopeful. https://open.spotify.com/episode/4yZkjd7Y8dSm0OJTMapgky …", "timestamp": "09:51 - 14. März 2019", "retweet_count": "63", "favorite_count": "134", "author": "ezraklein", "is_retweet": true}, {"text": "Thoughtful, comprehensive look at the debate — and the evidence — on Cory Booker's overhaul of Newark's schools.", "timestamp": "12:38 - 13. März 2019", "retweet_count": "17", "favorite_count": "77", "author": "ezraklein", "is_retweet": true}, {"text": "I don't know how to summarize this history of man caves at tweet length, but there's so much interesting stuff here, particularly on how ideas of masculinity are intertwined with economics:", "timestamp": "12:46 - 4. März 2019", "retweet_count": "27", "favorite_count": "128", "author": "ezraklein", "is_retweet": true}, {"text": "Really interesting @dylanlscott/@MattBruenig convo on handling supply, financing, and rural access issues in single-payer:", "timestamp": "11:19 - 4. März 2019", "retweet_count": "61", "favorite_count": "127", "author": "ezraklein", "is_retweet": true}, {"text": "“We brought ourselves to the threshold of true climate catastrophe in the timespan of a single generation. We now have the timespan of about a single generation to avoid unimaginable suffering, and we are the ones writing that story.” — @dwallacewells", "timestamp": "10:38 - 4. März 2019", "retweet_count": "135", "favorite_count": "251", "author": "ezraklein", "is_retweet": true}, {"text": " @drvox interviews @dwallacewells about climate change!", "timestamp": "07:36 - 4. März 2019", "retweet_count": "31", "favorite_count": "75", "author": "ezraklein", "is_retweet": true}, {"text": "If the insight here — and it's a true one — is the right isn't a governing partner and hasn't been for some time, then Democrats need to make it possible for themselves to win governing majorities. In a 60-vote Senate, given the composition of states, that's not possible.", "timestamp": "07:24 - 4. März 2019", "retweet_count": "65", "favorite_count": "354", "author": "ezraklein", "is_retweet": true}, {"text": "This is a very sensible argument from @delong that seems to me to resolve down almost entirely to ending the filibuster and statehood for DC and Puerto Rico. If not, then without votes from Republicans, they (usually) can't pass anything big.", "timestamp": "07:24 - 4. März 2019", "retweet_count": "108", "favorite_count": "359", "author": "ezraklein", "is_retweet": true}, {"text": "This is a good rationale for a candidacy: \"Ultimately, I believe there is one central, defining, existential-with-a-capital-E threat to the future of the nation: climate change...On my last day, I want to be able to say I did everything I could.\"", "timestamp": "10:30 - 1. März 2019", "retweet_count": "143", "favorite_count": "570", "author": "ezraklein", "is_retweet": true}, {"text": "Jay Inslee: \"I believe the filibuster is an artifact of history that no longer fits American democracy.\" https://www.vox.com/energy-and-environment/2019/3/1/18244206/jay-inslee-2020-campaign-president-climate-change-interview …", "timestamp": "10:16 - 1. März 2019", "retweet_count": "43", "favorite_count": "271", "author": "ezraklein", "is_retweet": true}, {"text": "\"In the US, taxpayers spend $140 billion every year supporting research they can’t easily access.\"\n\nGood on the UC system for taking a stand here. The academic publishing racket, particularly around taxpayer-supported research, is appalling.", "timestamp": "09:58 - 1. März 2019", "retweet_count": "157", "favorite_count": "403", "author": "ezraklein", "is_retweet": true}, {"text": "At the very least, it paints him as an unbelievably incompetent executive who can't be trusted to exercise one of the core responsibilities of the presidency, which is choosing people to fill key government positions.", "timestamp": "16:47 - 27. Feb. 2019", "retweet_count": "419", "favorite_count": "2869", "author": "ezraklein", "is_retweet": true}, {"text": "So the GOP line is that it sure is an unfortunate coincidence that Trump hired mendacious criminals to manage both his personal affairs and his presidential campaign.\n\nThe president isn't a criminal, he's just surrounds himself with criminals, is not a comforting defense.", "timestamp": "16:47 - 27. Feb. 2019", "retweet_count": "1168", "favorite_count": "5531", "author": "ezraklein", "is_retweet": true}, {"text": "The Republican Party needs to step back and do some thinking on how they ended up arguing that the president's personal lawyer and fixer is such a criminal and a liar that his testimony that he was always a criminal and a liar can't be believed.", "timestamp": "13:11 - 27. Feb. 2019", "retweet_count": "1332", "favorite_count": "6026", "author": "ezraklein", "is_retweet": true}, {"text": "Watching Michael Cohen play John Dean's part in this drama really underscores how right John Oliver was when he termed all this Stupid Watergate back in May 2017.", "timestamp": "13:04 - 27. Feb. 2019", "retweet_count": "396", "favorite_count": "2778", "author": "ezraklein", "is_retweet": true}, {"text": "But we tend to judge politics more on language and messaging than on policy, so the media, in particular, gets this wrong constantly.", "timestamp": "13:54 - 26. Feb. 2019", "retweet_count": "22", "favorite_count": "106", "author": "ezraklein", "is_retweet": true}, {"text": "That's Emily Oster, I think.", "timestamp": "13:53 - 26. Feb. 2019", "retweet_count": "0", "favorite_count": "14", "author": "ezraklein", "is_retweet": true}, {"text": "The diversity of the Democratic coalition requires language that recognizes individual group experiences and policy that stretches across group experiences. The Republican coalition encourages the reverse.", "timestamp": "13:53 - 26. Feb. 2019", "retweet_count": "30", "favorite_count": "143", "author": "ezraklein", "is_retweet": true}, {"text": "Democrats have to keep an almost unimaginably large group of stakeholders happy. Republicans are managing a tension between white identity politics, which they feed through social policy and cultural fights, and corporations/donors, who drive their economic and regulatory policy.", "timestamp": "13:53 - 26. Feb. 2019", "retweet_count": "36", "favorite_count": "71", "author": "ezraklein", "is_retweet": true}, {"text": "What are the policies on the left with the most energy? Medicare-for-All. Green New Deal. Huge EITC expansions. All of them are universal. On the right? The wall and other immigration restrictions are driving GOP politics.", "timestamp": "13:53 - 26. Feb. 2019", "retweet_count": "19", "favorite_count": "46", "author": "ezraklein", "is_retweet": true}, {"text": "The Democratic Party is a coalition of lots of different groups which means, to unify, it needs big policies that matter to all its groups simultaneously. The Republican Party is much more homogenous, and that’s reflected in its policy demands, too.", "timestamp": "13:53 - 26. Feb. 2019", "retweet_count": "15", "favorite_count": "39", "author": "ezraklein", "is_retweet": true}, {"text": "This thing where Democrats brand universal programs “reparations” seems like bad politics, but illustrates something interesting and underappreciated about the Democratic coalition.", "timestamp": "13:53 - 26. Feb. 2019", "retweet_count": "36", "favorite_count": "138", "author": "ezraklein", "is_retweet": true}, {"text": "Anyway, I really recommend this @zackbeauchamp piece. It's one of the clearest analyses of where Western politics is, and where it's going, that I've read.", "timestamp": "10:29 - 26. Feb. 2019", "retweet_count": "31", "favorite_count": "131", "author": "ezraklein", "is_retweet": true}, {"text": "I think there are more examples of this being done successfully than people tend to admit. California, for instance, is imperfect, but it's a functioning, proud, multiethnic liberal democracy.", "timestamp": "10:26 - 26. Feb. 2019", "retweet_count": "54", "favorite_count": "466", "author": "ezraklein", "is_retweet": true}, {"text": "The hard question for politics in our age is how to calm the reaction rather than appeasing it by demanding the concessions be made by people who've already made so many.", "timestamp": "10:26 - 26. Feb. 2019", "retweet_count": "37", "favorite_count": "251", "author": "ezraklein", "is_retweet": true}, {"text": "There's no identity politics as dangerous as the identity politics of dominant groups who feel their power and status is being threatened.", "timestamp": "10:21 - 26. Feb. 2019", "retweet_count": "315", "favorite_count": "1099", "author": "ezraklein", "is_retweet": true}, {"text": "Show my baby...to Twitter? What has he done to deserve that?", "timestamp": "15:34 - 25. Feb. 2019", "retweet_count": "18", "favorite_count": "1584", "author": "ezraklein", "is_retweet": true}, {"text": "And this Weeds episode on the Mueller endgame increased my understanding of how all the Russia pieces fit together by 300%, @awprokop is an exceptional guide to all this:", "timestamp": "14:43 - 25. Feb. 2019", "retweet_count": "42", "favorite_count": "168", "author": "ezraklein", "is_retweet": true}, {"text": "Being a new parent is beautiful and overwhelming and scary and also you miss your colleagues so it's nice to get to listen to them on podcasts. \n\nDon't miss @cjane87's guest episode of the EK Show, talking to @NoahCRothman about identity politics:", "timestamp": "14:43 - 25. Feb. 2019", "retweet_count": "48", "favorite_count": "791", "author": "ezraklein", "is_retweet": true}, {"text": "Come for the Howard Schultz analysis, stay for the @Malki Batman comic: https://www.vox.com/policy-and-politics/2019/2/12/18219607/howard-schultz-presidential-campaign-cnn-independent-third-party-2020-starbucks …", "timestamp": "07:01 - 13. Feb. 2019", "retweet_count": "96", "favorite_count": "301", "author": "ezraklein", "is_retweet": true}, {"text": "Howard Schultz, for all his stated concern about political representation, isn’t talking about the way money distorts representative democracy.\n\nWhat he is doing is embodying the way money distorts representative democracy.", "timestamp": "06:54 - 13. Feb. 2019", "retweet_count": "339", "favorite_count": "1140", "author": "ezraklein", "is_retweet": true}, {"text": "Howard Schultz's agenda is basically Chuck Schumer's agenda, plus an overriding belief that Howard Schultz should be president. \n\nFrom both his policy speech and town hall, he doesn't disagree with the median House Democrat on much aside from his own ambitions.", "timestamp": "20:47 - 12. Feb. 2019", "retweet_count": "168", "favorite_count": "1221", "author": "ezraklein", "is_retweet": true}, {"text": "\"How can you a spoil a system that is already broken\" is a sentence that makes sense until you think about it for literally two seconds, and then it doesn't.\n\nIf Schultz wanted to \"fix\" the two-party system, he'd be funding ballot initiatives to pass proportional representation.", "timestamp": "20:33 - 12. Feb. 2019", "retweet_count": "990", "favorite_count": "4997", "author": "ezraklein", "is_retweet": true}, {"text": "Schultz frames the villain as political parties, but political parties are far more responsive to voters than the problem that Schultz embodies, but doesn’t discuss: money. https://www.vox.com/policy-and-politics/2019/2/12/18219607/howard-schultz-presidential-campaign-cnn-independent-third-party-2020-starbucks …", "timestamp": "20:30 - 12. Feb. 2019", "retweet_count": "197", "favorite_count": "764", "author": "ezraklein", "is_retweet": true}, {"text": "Anyway, as the kids say, read the whole thing. https://www.vox.com/policy-and-politics/2019/2/12/18219607/howard-schultz-presidential-campaign-cnn-independent-third-party-2020-starbucks …", "timestamp": "17:58 - 12. Feb. 2019", "retweet_count": "16", "favorite_count": "132", "author": "ezraklein", "is_retweet": true}, {"text": "But if Schultz believes *his own* diagnosis of America’s problems, he’s flirting with a strategy that has a good chance of making everything worse.", "timestamp": "17:58 - 12. Feb. 2019", "retweet_count": "25", "favorite_count": "145", "author": "ezraklein", "is_retweet": true}, {"text": "There's a lot a public-spirited billionaire could do to improve politics, and address the specific problems Schultz is worried about. He could fund efforts to pass proportional representation across the country, for instance.", "timestamp": "17:58 - 12. Feb. 2019", "retweet_count": "15", "favorite_count": "107", "author": "ezraklein", "is_retweet": true}, {"text": "And taking the billionaire’s express lane into presidential politics, just a few years after Donald Trump did the same thing, would be further proof to Americans that they live in an unrepresentative oligarchy.", "timestamp": "17:58 - 12. Feb. 2019", "retweet_count": "20", "favorite_count": "126", "author": "ezraklein", "is_retweet": true}, {"text": "Governing as a “centrist independent” free of party would generate gridlock and conflict in a system that is organized around political parties. Schultz has no theory of Congress or legislating that makes sense. He just has a theory of himself.", "timestamp": "17:58 - 12. Feb. 2019", "retweet_count": "13", "favorite_count": "111", "author": "ezraklein", "is_retweet": true}, {"text": "Running as a third-party candidate in a first-past-the-post election system is likelier to reinforce the two-party duopoly, and the dangers of third parties, then to open America to multiparty democracy.", "timestamp": "17:58 - 12. Feb. 2019", "retweet_count": "11", "favorite_count": "74", "author": "ezraklein", "is_retweet": true}, {"text": "Howard Schultz's presidential campaign is based on three ideas, and they're all wrong. https://www.vox.com/policy-and-politics/2019/2/12/18219607/howard-schultz-presidential-campaign-cnn-independent-third-party-2020-starbucks …", "timestamp": "17:58 - 12. Feb. 2019", "retweet_count": "187", "favorite_count": "548", "author": "ezraklein", "is_retweet": true}, {"text": "Tonight, CNN will host a live town hall with Howard Schultz. \n\nWhy is Schultz, a political newcomer who \"had the worst numbers of any potential candidate tested\" in CNN’s own poll, getting such red-carpet treatment?\n\nThe answer, of course, is money. https://www.vox.com/policy-and-politics/2019/2/12/18219607/howard-schultz-presidential-campaign-cnn-independent-third-party-2020-starbucks?utm_campaign=ezraklein&utm_content=chorus&utm_medium=social&utm_source=twitter …", "timestamp": "17:33 - 12. Feb. 2019", "retweet_count": "1920", "favorite_count": "7144", "author": "ezraklein", "is_retweet": true}, {"text": "If you're not following #KaraJack, you should be.", "timestamp": "14:52 - 12. Feb. 2019", "retweet_count": "11", "favorite_count": "86", "author": "ezraklein", "is_retweet": true}, {"text": "Create your own wealth tax!", "timestamp": "09:55 - 12. Feb. 2019", "retweet_count": "37", "favorite_count": "122", "author": "ezraklein", "is_retweet": true}, {"text": "\"Capping all prison sentences at no more than 20 years. It may sound like an extreme, even dangerous, proposal, but there’s good reason to believe it would help reduce the prison population without making America any less safe.\"", "timestamp": "09:10 - 12. Feb. 2019", "retweet_count": "79", "favorite_count": "282", "author": "ezraklein", "is_retweet": true}, {"text": "It's easy to imagine lots of Democrats saying mean things about Wall Street on the campaign trail then getting into office and mostly ignoring them to focus on health care and pre-k.\n\nI doubt that will happen with Warren. And Wall Street doubts that will happen with Warren.", "timestamp": "09:02 - 12. Feb. 2019", "retweet_count": "58", "favorite_count": "362", "author": "ezraklein", "is_retweet": true}, {"text": "And you know what? They may be right to. A lot of Democrats are critical of Wall Street, but they don't really care about it. \n\nWarren does. Her politics are built atop a critique of Wall Street, and the over-financialization of the economy.", "timestamp": "09:02 - 12. Feb. 2019", "retweet_count": "27", "favorite_count": "239", "author": "ezraklein", "is_retweet": true}, {"text": "“I would vote for Trump and hold my nose, and he’s worse than anything I feared.\"\n\nWall Street really, really hates Elizabeth Warren.", "timestamp": "09:02 - 12. Feb. 2019", "retweet_count": "75", "favorite_count": "233", "author": "ezraklein", "is_retweet": true}, {"text": "If this is what a moderate plan looks like in the 2020 Democratic primary, I am very much looking forward to the coming healthcare debate.", "timestamp": "17:06 - 11. Feb. 2019", "retweet_count": "10", "favorite_count": "150", "author": "ezraklein", "is_retweet": true}, {"text": "That he is able to try and sell a plan this ambitious using conservative rhetoric — he frames himself as the moderate incrementalist, cautious of too much change, too fast — shows how much space Sanders has opened on health care.", "timestamp": "17:06 - 11. Feb. 2019", "retweet_count": "6", "favorite_count": "75", "author": "ezraklein", "is_retweet": true}, {"text": "That said, Delaney's plan is very ambitious — it looks like the French system — even though Delaney sets himself up as an opponent of Medicare-for-All in this interview.", "timestamp": "17:06 - 11. Feb. 2019", "retweet_count": "2", "favorite_count": "14", "author": "ezraklein", "is_retweet": true}, {"text": "My beef with this debate over single-payer and innovation is I'd like to see people propose plans built to maximize innovation, not just use innovation as a way to defend the pricing status quo, which even conservatives agree leaves America footing the world's innovation bill.", "timestamp": "17:06 - 11. Feb. 2019", "retweet_count": "4", "favorite_count": "26", "author": "ezraklein", "is_retweet": true}, {"text": "In general, the idea of \"cost\" in health care is less fixed than people give it credit for. \"Cost\" isn't a constant concept. It depends on what the market will bear, how much providers expect to make, etc.", "timestamp": "17:06 - 11. Feb. 2019", "retweet_count": "2", "favorite_count": "20", "author": "ezraklein", "is_retweet": true}, {"text": "You could imagine a government health system setting prices so low it discourages some innovation. It's hard for me to imagine that happening here given how America's political system works. I think it's likelier we do too little to negotiate down prices than too much.", "timestamp": "17:06 - 11. Feb. 2019", "retweet_count": "3", "favorite_count": "39", "author": "ezraklein", "is_retweet": true}, {"text": "Delaney says: \"If you have the government as the only payer in health care, all the evidence suggests the government will not pay cost. Therefore, no one will invest in health care anymore.\"\n\nThere's no evidence for this — consider the defense industry as a counterexample.", "timestamp": "17:06 - 11. Feb. 2019", "retweet_count": "8", "favorite_count": "51", "author": "ezraklein", "is_retweet": true}, {"text": ".@JohnkDelaney's health plan, summarized. There's a lot of interesting stuff in @dylanlscott's interview with him, which you should read in full, but a few quick notes. https://www.vox.com/2019/2/11/18220118/2020-presidential-campaign-medicare-for-all-john-delaney …", "timestamp": "17:06 - 11. Feb. 2019", "retweet_count": "43", "favorite_count": "119", "author": "ezraklein", "is_retweet": true}, {"text": "\"We know what happens when ecosystems lose insects: They lose other species as well.\"", "timestamp": "16:47 - 11. Feb. 2019", "retweet_count": "180", "favorite_count": "328", "author": "ezraklein", "is_retweet": true}, {"text": "This is really excellent on the history and symbolism of blackface:", "timestamp": "11:04 - 11. Feb. 2019", "retweet_count": "61", "favorite_count": "167", "author": "ezraklein", "is_retweet": true}, {"text": "It's a bit about the benjamins, but it's about a lot of things, including Twitter and Republicans strategically exploiting tensions in the Democratic coalition", "timestamp": "10:13 - 11. Feb. 2019", "retweet_count": "918", "favorite_count": "2860", "author": "ezraklein", "is_retweet": true}, {"text": "“She said that’s fine,” Samuel said of his call to his mother with the news he was suing her, “but don’t expect me to go easy on you. I will destroy you in court.”", "timestamp": "12:06 - 8. Feb. 2019", "retweet_count": "24", "favorite_count": "77", "author": "ezraklein", "is_retweet": true}, {"text": "This is advice I've gotten, it's advice we give every writer at Vox, and it's good advice in life: be overgenerous with credit, with links, with pointers. Build the ecosystem. Readers won't think less of you for it, they'll think more of you.", "timestamp": "11:44 - 8. Feb. 2019", "retweet_count": "192", "favorite_count": "1145", "author": "ezraklein", "is_retweet": true}, {"text": "I think even if Abramson had cited to the standards she's setting out, the citations would've been ungenerous given how much she was relying on others work. It shouldn't be endnotes, but text. \"As a terrific article by so-and-so revealed...\"", "timestamp": "11:44 - 8. Feb. 2019", "retweet_count": "22", "favorite_count": "180", "author": "ezraklein", "is_retweet": true}, {"text": "Blogging norms have been integrated much more into traditional media (in part because bloggers have been integrated into traditional media), and while it's still imperfect, and big publications are sometimes ungenerous with smaller publications, it's better than it was.", "timestamp": "11:44 - 8. Feb. 2019", "retweet_count": "11", "favorite_count": "78", "author": "ezraklein", "is_retweet": true}, {"text": "Blogging changed that. Links were given generously, happily. It was a cooperative ecosystem, not a competitive ecosystem. The work of others made your work possible. Linking to their work made your work more useful to the reader. It was all good.", "timestamp": "11:44 - 8. Feb. 2019", "retweet_count": "19", "favorite_count": "139", "author": "ezraklein", "is_retweet": true}, {"text": "To frame this more in the big issues her book is about, this is a way in which new media improved the media. \n\nThere was a culture in journalism — and the NYT in particular — where you wanted everything to look like your own, and credit was given begrudgingly, if at all.", "timestamp": "11:44 - 8. Feb. 2019", "retweet_count": "16", "favorite_count": "100", "author": "ezraklein", "is_retweet": true}, {"text": "I've long admired Jill Abramson, but the definition of plagiarism she gives here is a...looser one than has been true at the publications I've worked at, and I think it shows less generosity in citation than is appropriate.", "timestamp": "11:44 - 8. Feb. 2019", "retweet_count": "83", "favorite_count": "319", "author": "ezraklein", "is_retweet": true}, {"text": "\"These moderate politicians have positioned themselves against broad public preference. What then makes a moderate, if not policies that appeal to the middle?\"\n\nGreat @jbouie column:", "timestamp": "11:18 - 8. Feb. 2019", "retweet_count": "64", "favorite_count": "196", "author": "ezraklein", "is_retweet": true}, {"text": "Really enjoyed this conversation with @ebruenig about the differences between leftists and liberals, the limits of persuasion, the uses and misuses of civility, what Medicare-for-all means, Howard Schultz, and so much more.", "timestamp": "10:16 - 8. Feb. 2019", "retweet_count": "42", "favorite_count": "362", "author": "ezraklein", "is_retweet": true}, {"text": "I wouldn't make this request if it wasn't a matter of some urgency. \n\nThere's an online comic where Bruce Wayne tells Alfred he wants to help Gotham, Alfred suggests invest in public services, and Wayne says no, he's going to dress up and fight crime.\n\nCan anyone help me find it?", "timestamp": "21:54 - 7. Feb. 2019", "retweet_count": "134", "favorite_count": "1088", "author": "ezraklein", "is_retweet": true}, {"text": "The social, physical, and educational infrastructure that's made California the cradle to Silicon Valley wasn't and isn't cheap. Making millions from it and then skipping the bill is a really shitty way to behave.", "timestamp": "18:12 - 6. Feb. 2019", "retweet_count": "279", "favorite_count": "1706", "author": "ezraklein", "is_retweet": true}, {"text": "This quote nails it:\n\n“Trying to avoid taxes on your IPO is kind of like saying ‘California is awesome as long as someone else pays for it.’\"", "timestamp": "18:12 - 6. Feb. 2019", "retweet_count": "232", "favorite_count": "891", "author": "ezraklein", "is_retweet": true}, {"text": "When people ask Elizabeth Warren why she's proposing a national wealth tax she should just hand them this article https://www.recode.net/2019/2/6/18211362/uber-airbnb-tax-avoidance-california-ipo-wealth …", "timestamp": "14:15 - 6. Feb. 2019", "retweet_count": "144", "favorite_count": "427", "author": "ezraklein", "is_retweet": true}, {"text": "I don't usually like profiles of presidential candidates' early years, which tend to spin too much out of too little, but this one is excellent.", "timestamp": "12:18 - 6. Feb. 2019", "retweet_count": "67", "favorite_count": "277", "author": "ezraklein", "is_retweet": true}, {"text": "Excited to give the Peltason lecture tomorrow at UCI. \n\nThe talk will be about trying to better define and understand \"identity politics,\" so it will make no one angry and everyone will agree with everything I have to say. If you're in the area, come by! http://evite.me/JYxQy7UmKU ", "timestamp": "11:02 - 6. Feb. 2019", "retweet_count": "12", "favorite_count": "77", "author": "ezraklein", "is_retweet": true}, {"text": "There were parts of Trump's speech that I liked. But then I remembered the president he's actually been.", "timestamp": "10:29 - 6. Feb. 2019", "retweet_count": "112", "favorite_count": "490", "author": "ezraklein", "is_retweet": true}, {"text": "I liked when Trump told Congress that an infrastructure bill was “not an option” but “a necessity.” \n\nBut then I remembered that Trump has been president for years now, that he controlled Congress for most of that time, and that he has never tried to pass an infrastructure bill.", "timestamp": "10:29 - 6. Feb. 2019", "retweet_count": "207", "favorite_count": "905", "author": "ezraklein", "is_retweet": true}, {"text": "I liked when Trump said the nation’s priority should be to “lower the cost of health care and prescription drugs, and to protect patients with preexisting conditions.” \n\nBut then I remembered 7 million more people are uninsured because of his policies.", "timestamp": "10:29 - 6. Feb. 2019", "retweet_count": "153", "favorite_count": "493", "author": "ezraklein", "is_retweet": true}, {"text": "I liked when Trump said that he had “launched an unprecedented economic boom.” \n\nBut then I remembered that job growth was exactly as fast before he took office, and he was calling those numbers “phony” and “false.\"", "timestamp": "10:29 - 6. Feb. 2019", "retweet_count": "65", "favorite_count": "217", "author": "ezraklein", "is_retweet": true}, {"text": "I liked when Trump said, “I want people to come into our country in the largest numbers ever, but they have to come in legally.” \n\nBut then I remembered Trump killed a series of immigration deals because they didn’t cut legal immigration to the country.", "timestamp": "10:29 - 6. Feb. 2019", "retweet_count": "70", "favorite_count": "219", "author": "ezraklein", "is_retweet": true}, {"text": "In the State of the Union, I liked when Trump described his tax plan as “a massive tax cut for working families.” \n\nBut then I remembered that more than 80 percent of its benefits went to the top 1 percent. https://www.taxpolicycenter.org/sites/default/files/publication/155349/2018.06.08_tcja_summary_paper_final_0.pdf …", "timestamp": "10:29 - 6. Feb. 2019", "retweet_count": "430", "favorite_count": "1271", "author": "ezraklein", "is_retweet": true}, {"text": "\"The tension between Trump’s State of the Union message and his actual record reveals the core of his administration’s thinking: Not populism, but ethno-nationalism.\"", "timestamp": "09:02 - 6. Feb. 2019", "retweet_count": "100", "favorite_count": "256", "author": "ezraklein", "is_retweet": true}, {"text": "The president you get when you just let Trump talk and the presidency Trump keeps getting talked into are very different beasts.", "timestamp": "20:32 - 5. Feb. 2019", "retweet_count": "96", "favorite_count": "679", "author": "ezraklein", "is_retweet": true}, {"text": "The moment tonight that really encapsulates Trump's presidency is Trump ad-libbing that he wants to let in more legal immigrants than any president in history when the reason we don't have an immigration deal is his insistence on cutting legal immigration. https://www.vox.com/policy-and-politics/2019/2/5/18213031/donald-trump-state-of-the-union-2019-fact-check …", "timestamp": "20:32 - 5. Feb. 2019", "retweet_count": "881", "favorite_count": "2816", "author": "ezraklein", "is_retweet": true}, {"text": "\"That’s all he’s left with — a vague hope that the economy holds up and nobody catches him with his hand in the cookie jar.\"", "timestamp": "20:26 - 5. Feb. 2019", "retweet_count": "235", "favorite_count": "822", "author": "ezraklein", "is_retweet": true}, {"text": "Trump's presidency carries its direct costs, and it carries its opportunity costs. In some of the lies he told tonight, Trump accidentally highlighted the good things that could have happened if only he wasn't the president.", "timestamp": "20:18 - 5. Feb. 2019", "retweet_count": "128", "favorite_count": "301", "author": "ezraklein", "is_retweet": true}, {"text": "If you're hungry for Stacey Abrams content tonight (and why wouldn't you be?), the essay she recently wrote on identity politics is one of the more impressive things published by a politician in recent memory.", "timestamp": "20:11 - 5. Feb. 2019", "retweet_count": "2628", "favorite_count": "7823", "author": "ezraklein", "is_retweet": true}, {"text": "I’ll be honest. I liked parts of Trump’s State of the Union. \n\nThen I remembered the realities of his presidency. https://www.vox.com/policy-and-politics/2019/2/5/18213031/donald-trump-state-of-the-union-2019-fact-check?utm_campaign=ezraklein&utm_content=chorus&utm_medium=social&utm_source=twitter …", "timestamp": "20:11 - 5. Feb. 2019", "retweet_count": "83", "favorite_count": "408", "author": "ezraklein", "is_retweet": true}, {"text": "Usually the State of the Union feels lively and the response feels stiff. Tonight it's the opposite.", "timestamp": "19:48 - 5. Feb. 2019", "retweet_count": "678", "favorite_count": "4012", "author": "ezraklein", "is_retweet": true}, {"text": "Says a lot about the politics of the shutdown that Trump demanded it but only the Democrats are talking about it.", "timestamp": "19:43 - 5. Feb. 2019", "retweet_count": "124", "favorite_count": "717", "author": "ezraklein", "is_retweet": true}, {"text": "The distance between Trump's speech and presidency is telling. The guy who shut down the government lauds \"the boundless potential of cooperation, compromise, and the common good.\"\n\nTrump's staff knows Trump's strategy is failing. This speech is the script they wish he'd follow.", "timestamp": "18:25 - 5. Feb. 2019", "retweet_count": "525", "favorite_count": "2015", "author": "ezraklein", "is_retweet": true}, {"text": "\"The agenda I will lay out this evening is not a Republican Agenda or a Democrat Agenda. It is the agenda of the American People.\"\n\n\"Democrat\" agenda. Always good when your calls for unity are phrased to annoy the people you need to convince to work with you.", "timestamp": "18:11 - 5. Feb. 2019", "retweet_count": "327", "favorite_count": "2194", "author": "ezraklein", "is_retweet": true}, {"text": "Excited for the State of the Union, as well as the live commentary, which will be delivered by Nancy Pelosi's facial expressions", "timestamp": "18:07 - 5. Feb. 2019", "retweet_count": "163", "favorite_count": "1269", "author": "ezraklein", "is_retweet": true}, {"text": "Medicare-for-All doesn’t mean what it sounds like it means, and what it does mean is becoming a defining debate in the 2020 primary.\n\nA deep dive into the Dems’ Medicare-for-All fight:", "timestamp": "05:13 - 5. Feb. 2019", "retweet_count": "135", "favorite_count": "328", "author": "ezraklein", "is_retweet": true}, {"text": "15 years in, has Facebook been good for the world?\n\nImagine how much sunnier these answers would've been even three years ago.", "timestamp": "10:00 - 4. Feb. 2019", "retweet_count": "38", "favorite_count": "150", "author": "ezraklein", "is_retweet": true}, {"text": "\"Higher marginal tax rates are favored by 45 percent of the public over 32 percent who say it’s a bad idea, while the wealth tax scores a crushing 60-21 victory that includes majority support from Republicans.\"", "timestamp": "09:14 - 4. Feb. 2019", "retweet_count": "283", "favorite_count": "880", "author": "ezraklein", "is_retweet": true}, {"text": "And yes, Donald Trump has violated social standards of decency again and again, and if the Republican party were a more decent party, it would have done what the Democrats are doing with Northram and united to force his resignation.", "timestamp": "13:48 - 2. Feb. 2019", "retweet_count": "639", "favorite_count": "3221", "author": "ezraklein", "is_retweet": true}, {"text": "It’s not that people can’t grow and change and be forgiven. They can. They should! But positions like governorships are public positions, not one person’s hero’s journey. The question here is about our standards for high public office, and the message those standards send.", "timestamp": "13:48 - 2. Feb. 2019", "retweet_count": "1176", "favorite_count": "5772", "author": "ezraklein", "is_retweet": true}, {"text": "In 2000, CBO forecast the 2010 debt-to-GDP ratio at 6%. In 2018, the 10-year forecast put it at 105%.\n\nOrthodox views of debt would predict the rise in debt would send interest rates skyrocketing. But the rate on 10-year treasuries fell from 4.3% to 0.8%.", "timestamp": "09:14 - 1. Feb. 2019", "retweet_count": "76", "favorite_count": "126", "author": "ezraklein", "is_retweet": true}, {"text": "It might just be me, but I find candidates with ambitious anti-poverty plans more personally likable than candidates without them.", "timestamp": "10:22 - 30. Jan. 2019", "retweet_count": "143", "favorite_count": "926", "author": "ezraklein", "is_retweet": true}, {"text": "I say writing a tweet rather than writing an article for the publication that actually employs me.", "timestamp": "09:19 - 30. Jan. 2019", "retweet_count": "4", "favorite_count": "175", "author": "ezraklein", "is_retweet": true}, {"text": "Dan Nixon had a good piece speculating about this a few years back. I'm a believer in the theory that the reason technology isn't adding more to productivity is because the gains are outweighed by the distractions. https://bankunderground.co.uk/2017/11/24/is-the-economy-suffering-from-the-crisis-of-attention/ …", "timestamp": "09:18 - 30. Jan. 2019", "retweet_count": "27", "favorite_count": "129", "author": "ezraklein", "is_retweet": true}, {"text": "So Facebook took advantage of an Apple program that lets companies release unreviewed apps for their own employees to release an app paying teens to turn over their mobile data, and Apple is pissed.", "timestamp": "09:15 - 30. Jan. 2019", "retweet_count": "185", "favorite_count": "357", "author": "ezraklein", "is_retweet": true}, {"text": "Forget the horse race — here’s how 2020 Democrats want to fight poverty: https://www.vox.com/future-perfect/2019/1/30/18183769/democrat-poverty-plans-2020-presidential-kamala-harris-booker-gillibrand …", "timestamp": "09:01 - 30. Jan. 2019", "retweet_count": "43", "favorite_count": "87", "author": "ezraklein", "is_retweet": true}, {"text": "Really proud of the little Wonkblog that could. When we started, the idea that you'd base political coverage on policy, and people would read it, was silly. \n\nNow it's banal, and there's way more excellent policy coverage everywhere.", "timestamp": "17:03 - 29. Jan. 2019", "retweet_count": "23", "favorite_count": "291", "author": "ezraklein", "is_retweet": true}, {"text": "You often hear that eating animals is natural. And it is. But not the way we do it.", "timestamp": "16:24 - 29. Jan. 2019", "retweet_count": "90", "favorite_count": "343", "author": "ezraklein", "is_retweet": true}, {"text": "The GOP took a small portion of the federal government hostage, and quickly found its poll numbers plummeting and even Trump realized he had to fold.\n\nSo the next idea is to take the entire global economy hostage?", "timestamp": "15:45 - 29. Jan. 2019", "retweet_count": "450", "favorite_count": "1166", "author": "ezraklein", "is_retweet": true}, {"text": "I've seen contrasting analyses on whether Beto overperformed. If anyone's seen a definitive analysis, would be interested.", "timestamp": "11:59 - 29. Jan. 2019", "retweet_count": "0", "favorite_count": "2", "author": "ezraklein", "is_retweet": true}, {"text": "Yeah, though that's probably often true for candidates who win tough races, right? \n\nBut I do think this may be part of the answer, and it reflects polarization: in the past, party wanted to elevate faces who appealed to swing voters. Now it wants faces that mobilize the base.", "timestamp": "11:57 - 29. Jan. 2019", "retweet_count": "1", "favorite_count": "7", "author": "ezraklein", "is_retweet": true}, {"text": "What's made it different this year? Is it just where the political talent happened to fall in the election? Or something about how the party and media have changed?", "timestamp": "11:50 - 29. Jan. 2019", "retweet_count": "11", "favorite_count": "142", "author": "ezraklein", "is_retweet": true}, {"text": "Normally, the biggest stars out of a midterm Democrats won would be Dems who beat Republicans in tough races — say, Sinema in Arizona, or Spanberger in VA-7, or underwood in IL-14. \n\nYou saw that in 2007, when Jim Webb eked out a victory in VA then gave the SOTU response.", "timestamp": "11:50 - 29. Jan. 2019", "retweet_count": "13", "favorite_count": "122", "author": "ezraklein", "is_retweet": true}, {"text": "This is a smart pick, and also speaks to something unusual out of 2018. \n\nThe biggest Dem superstars to emerge either lost to Republicans (Abrams, Gillum, Beto) or beat Democrats (AOC, Pressley).", "timestamp": "11:50 - 29. Jan. 2019", "retweet_count": "100", "favorite_count": "551", "author": "ezraklein", "is_retweet": true}, {"text": "This same line of thinking says you also can't talk about fossil fuels because X and Y community depends on coal mines.\n\nThe politics of all this is hard. But I think reducing animal suffering is important no matter how it polls, and luckily, I'm not running for anything!", "timestamp": "11:16 - 29. Jan. 2019", "retweet_count": "0", "favorite_count": "1", "author": "ezraklein", "is_retweet": true}, {"text": "Be interested to hear others weigh in on this. I don't have a strong view on the evidence base around regenerative agriculture's environmental impact. \n\nThat said, I think a world where regenerative animal ag is the default is unlikely for cost and even culture reasons.", "timestamp": "10:40 - 29. Jan. 2019", "retweet_count": "7", "favorite_count": "42", "author": "ezraklein", "is_retweet": true}, {"text": "Is Lindsey Graham trying to burn the Republican Party (and, as a byproduct, the American economy) to the ground?", "timestamp": "09:19 - 29. Jan. 2019", "retweet_count": "141", "favorite_count": "549", "author": "ezraklein", "is_retweet": true}, {"text": "Trump's inability to believe bad news about himself is one of his key weaknesses. \n\nIf you can't believe bad news, you can't adjust in response. And if you can't adjust in response, and you're already behind in the polls...", "timestamp": "09:12 - 29. Jan. 2019", "retweet_count": "133", "favorite_count": "517", "author": "ezraklein", "is_retweet": true}, {"text": "Technology has made animal cruelty possible on an industrial scale never before seen in human history. \n\nTechnology also may be about to make that cruelty unnecessary. https://www.vox.com/future-perfect/2019/1/29/18197907/clean-meat-cell-plant-impossible-beyond-animal-cruelty …", "timestamp": "09:08 - 29. Jan. 2019", "retweet_count": "55", "favorite_count": "151", "author": "ezraklein", "is_retweet": true}, {"text": "Nothing changes a society’s values as quickly as innovations that make a new moral system easy and cheap to adopt. \n\nI don’t mean that cynically. I mean that hopefully.  https://www.vox.com/future-perfect/2019/1/29/18197907/clean-meat-cell-plant-impossible-beyond-animal-cruelty?utm_campaign=ezraklein&utm_content=chorus&utm_medium=social&utm_source=twitter …", "timestamp": "06:33 - 29. Jan. 2019", "retweet_count": "97", "favorite_count": "375", "author": "ezraklein", "is_retweet": true}, {"text": "More opioid marketing, more opioid deaths.", "timestamp": "16:36 - 28. Jan. 2019", "retweet_count": "108", "favorite_count": "188", "author": "ezraklein", "is_retweet": true}, {"text": "\"One way to think about Warren’s political evolution over time is that in the 15 years since her book was written, her policy ambitions have steadily risen to match the scale of her longstanding diagnosis.\"", "timestamp": "16:31 - 28. Jan. 2019", "retweet_count": "88", "favorite_count": "329", "author": "ezraklein", "is_retweet": true}, {"text": "Though I'd add my normal caveat that process questions — with big ones being the filibuster and financing — will shape these plans as much as any health policy details.", "timestamp": "16:04 - 28. Jan. 2019", "retweet_count": "11", "favorite_count": "49", "author": "ezraklein", "is_retweet": true}, {"text": "The debate in the Democratic Party is going to be between Medicare for All (Sanders, say), Medicare for Most, and Medicare for Some (the poor and those who want to buy into it).\n\nThis is a thoughtful version of a Medicare for Most plan:", "timestamp": "16:04 - 28. Jan. 2019", "retweet_count": "44", "favorite_count": "91", "author": "ezraklein", "is_retweet": true}, {"text": "\"15 years ago, there were a lot of people saying we have the best health care in the world and you didn’t want to screw that up by getting government too involved.\"\n\nYou don't hear that so often today. Great interview with Jacob Hacker.  https://www.vox.com/policy-and-politics/2019/1/28/18192674/medicare-for-all-cost-jacob-hacker …", "timestamp": "12:27 - 28. Jan. 2019", "retweet_count": "92", "favorite_count": "285", "author": "ezraklein", "is_retweet": true}, {"text": "I guess it's really look at this map and map it onto state political power (ie, that WI/PA/MI axis) but you know what I mean", "timestamp": "08:37 - 28. Jan. 2019", "retweet_count": "8", "favorite_count": "44", "author": "ezraklein", "is_retweet": true}, {"text": "Look at this chart and map it onto state political power and you have one more reason American politics and society is going to be very volatile in the coming years. https://www.recode.net/2019/1/28/18185061/robot-automation-jobs-employment-revolution-worse-men-brookings …", "timestamp": "08:34 - 28. Jan. 2019", "retweet_count": "134", "favorite_count": "215", "author": "ezraklein", "is_retweet": true}, {"text": "Eating animals may be natural, but the way we eat them today, at least in the industrial agriculture system, sure as hell isn't.", "timestamp": "08:30 - 28. Jan. 2019", "retweet_count": "165", "favorite_count": "801", "author": "ezraklein", "is_retweet": true}, {"text": "\"Broiler chickens now grow almost seven times as quickly as they would naturally. [Poultry scientists] said if a human baby grew as quickly as a broiler chicken, by the time she was one year old, she would weigh more than 650 pounds.\"", "timestamp": "08:30 - 28. Jan. 2019", "retweet_count": "374", "favorite_count": "806", "author": "ezraklein", "is_retweet": true}, {"text": "Digital detox diet are the new, well, detox diets. \n\nCovering your phone in cayenne, maple and lemon juice would also probably work.", "timestamp": "08:08 - 28. Jan. 2019", "retweet_count": "20", "favorite_count": "83", "author": "ezraklein", "is_retweet": true}, {"text": "Ideally, the way it would work is the president says things that are true. \n\nThe way it's actually working is the president says things and then his administration scrambles to see if they're true.", "timestamp": "12:10 - 27. Jan. 2019", "retweet_count": "415", "favorite_count": "1091", "author": "ezraklein", "is_retweet": true}, {"text": "I talked with neuroscientist Robert Sapolsky about the doom loop connecting poverty and stress, and it's one of the most important conversations I've had in a long time. Social policy would look so different if we took brain science seriously.", "timestamp": "09:43 - 27. Jan. 2019", "retweet_count": "405", "favorite_count": "1071", "author": "ezraklein", "is_retweet": true}, {"text": "Pelosi has proved what many didn’t believe about Trump: that he is subject to the normal laws of political gravity, and that for all his bluster, he is no more capable of sustaining an unsustainable position than any other politician.", "timestamp": "14:20 - 25. Jan. 2019", "retweet_count": "2673", "favorite_count": "11891", "author": "ezraklein", "is_retweet": true}, {"text": "Pelosi politically humiliating Trump in a way no other public figure has. Trump helped, of course, but she also read him exactly correctly.  https://www.vox.com/policy-and-politics/2019/1/25/18197685/nancy-pelosi-trump-shutdown-over?utm_campaign=ezraklein&utm_content=chorus&utm_medium=social&utm_source=twitter …", "timestamp": "13:53 - 25. Jan. 2019", "retweet_count": "983", "favorite_count": "4741", "author": "ezraklein", "is_retweet": true}, {"text": "Yes, let's definitely teach the self-learning AI to destroy human beings in war strategy simulations.", "timestamp": "16:43 - 24. Jan. 2019", "retweet_count": "119", "favorite_count": "472", "author": "ezraklein", "is_retweet": true}, {"text": "Why bipartisanship is irrational, presidential leadership backfires, and close elections lead to all-out partisan combat:", "timestamp": "10:49 - 24. Jan. 2019", "retweet_count": "28", "favorite_count": "109", "author": "ezraklein", "is_retweet": true}, {"text": "\"The way we eat and produce food has become so destructive to the environment and our health that it now threatens the long-term survival of the human species, an international commission of 37 scientists write in a sprawling new Lancet report.\"", "timestamp": "10:47 - 24. Jan. 2019", "retweet_count": "602", "favorite_count": "1308", "author": "ezraklein", "is_retweet": true}, {"text": "Trump's series of recent miscalculations have shown he really doesn't understand the dynamics of divided party governance. Perhaps conflict is all he wants, but if it's not, he needs to study up. https://www.vox.com/policy-and-politics/2019/1/24/18193523/donald-trump-wall-shutdown-congress-polarization-frances-lee …", "timestamp": "07:17 - 24. Jan. 2019", "retweet_count": "28", "favorite_count": "146", "author": "ezraklein", "is_retweet": true}, {"text": "The basic bind of American governance is cooperation is often necessary for the system to work, but irrational for the minority party to engage in.\n\nThe way we often try to solve that bind is more aggressive applications of presidential leadership, which makes it worse.", "timestamp": "07:17 - 24. Jan. 2019", "retweet_count": "23", "favorite_count": "119", "author": "ezraklein", "is_retweet": true}, {"text": "This chart, which combines share of the national two-party presidential vote, share of House seats, and share of Senate seats, is striking. Our hyper-competitive era is an aberration, and it changing political behavior and exposing cracks in the system.'s", "timestamp": "07:17 - 24. Jan. 2019", "retweet_count": "14", "favorite_count": "48", "author": "ezraklein", "is_retweet": true}, {"text": "If you want to understand our current political moment, and why crises like the shutdown have become so much more common and so much more intractable, Frances Lee's work is a great place to start: https://www.vox.com/policy-and-politics/2019/1/24/18193523/donald-trump-wall-shutdown-congress-polarization-frances-lee …", "timestamp": "07:17 - 24. Jan. 2019", "retweet_count": "100", "favorite_count": "295", "author": "ezraklein", "is_retweet": true}, {"text": "Saying the President should read some political science shouldn’t feel like such a trolly headline, but here we are. https://www.vox.com/policy-and-politics/2019/1/24/18193523/donald-trump-wall-shutdown-congress-polarization-frances-lee?utm_campaign=ezraklein&utm_content=chorus&utm_medium=social&utm_source=twitter …", "timestamp": "05:03 - 24. Jan. 2019", "retweet_count": "85", "favorite_count": "461", "author": "ezraklein", "is_retweet": true}, {"text": "Kellyanne Conway's famous for coining \"alternative facts,\" but that's not her typical strategy. It's just alternative words. \n\nWhat she understands, similar to Trump, is that you don't have to say something that makes sense, you just have to say something, and never admit error.", "timestamp": "13:53 - 23. Jan. 2019", "retweet_count": "794", "favorite_count": "3628", "author": "ezraklein", "is_retweet": true}, {"text": "Great @mattyglesias look at Elizabeth Warren's 2002 book \"The Two-Income Trap,\" which remains interesting, both for what it says about Warren and what it argued about the middle class, even today:", "timestamp": "07:46 - 23. Jan. 2019", "retweet_count": "63", "favorite_count": "219", "author": "ezraklein", "is_retweet": true}, {"text": "When lying is second nature", "timestamp": "06:21 - 15. Jan. 2019", "retweet_count": "177", "favorite_count": "616", "author": "ezraklein", "is_retweet": true}, {"text": "Who can forget that chapter in \"Art of the Deal\" where Trump reveals that the way to break a stalemate in negotiations is to send out increasingly bitter tweets composed, alone, while watching Fox News?", "timestamp": "09:56 - 14. Jan. 2019", "retweet_count": "615", "favorite_count": "2878", "author": "ezraklein", "is_retweet": true}, {"text": "Great look at the many plans for bringing down prescription drug prices now floating around Congress:", "timestamp": "08:45 - 14. Jan. 2019", "retweet_count": "39", "favorite_count": "109", "author": "ezraklein", "is_retweet": true}, {"text": "\"I never believed I would remain friends with any of these white supremacists, that some of them would walk away from their movement after we interacted. But that’s what happened, and I still can’t quite believe it.\"", "timestamp": "08:38 - 14. Jan. 2019", "retweet_count": "148", "favorite_count": "454", "author": "ezraklein", "is_retweet": true}, {"text": "Even if it turns out Trump has just been doing Russia's bidding because he wants Putin to like him, or because he independently decided Russia is great, the end result — that's still not the ideal description of an American president.", "timestamp": "09:18 - 13. Jan. 2019", "retweet_count": "127", "favorite_count": "950", "author": "ezraklein", "is_retweet": true}, {"text": "It'd be better if America's president wasn't acting so much like a Russian agent that the FBI had to open an investigation into whether he literally is a Russian agent.", "timestamp": "09:15 - 13. Jan. 2019", "retweet_count": "373", "favorite_count": "1536", "author": "ezraklein", "is_retweet": true}, {"text": "There are many ways Trump is bad at being president, but the fact that he's not trustworthy enough to make deals with is one of the most consequential.", "timestamp": "10:48 - 11. Jan. 2019", "retweet_count": "578", "favorite_count": "1939", "author": "ezraklein", "is_retweet": true}, {"text": "But as @KelseyTuoc writes, \"Ag-gag laws aren’t the real problem — they’re a symptom of it. The problem is that what goes on on our farms is so horrifying, and so unconscionable to the typical American consumer, that agribusinesses have turned to trying to hide it.\"", "timestamp": "07:54 - 11. Jan. 2019", "retweet_count": "119", "favorite_count": "358", "author": "ezraklein", "is_retweet": true}, {"text": "The Southern District of Iowa overturned the state's ag-gag law as an unconstitutional violation of free speech. Good.", "timestamp": "07:54 - 11. Jan. 2019", "retweet_count": "154", "favorite_count": "481", "author": "ezraklein", "is_retweet": true}, {"text": "Of all the hollow products and promises to bear Trump’s name, none has been as much of a scam as his reputation as a master dealmaker. https://www.vox.com/policy-and-politics/2019/1/11/18176363/trump-border-wall-immigration-shutdown-deal?utm_campaign=ezraklein&utm_content=chorus&utm_medium=social&utm_source=twitter …", "timestamp": "06:03 - 11. Jan. 2019", "retweet_count": "600", "favorite_count": "2153", "author": "ezraklein", "is_retweet": true}, {"text": "Hot new podcast action. \n\n@EricHolder's plan to make America more democratic, and more Democratic:", "timestamp": "13:23 - 10. Jan. 2019", "retweet_count": "17", "favorite_count": "85", "author": "ezraklein", "is_retweet": true}, {"text": "Biden has real political strengths, but as @MattYglesias writes here, he's got even realer political weaknesses. \n\nI think he should run, because I think basically everyone should run, but this is a lot of record to match to today's politics:", "timestamp": "12:57 - 10. Jan. 2019", "retweet_count": "38", "favorite_count": "183", "author": "ezraklein", "is_retweet": true}, {"text": "Mental health issues are an epidemic, and few of our current treatments work well.\n\n20 years from now, I think it's going to seem crazy and cruel that we had tools as powerful as psychedelics and we did so little to explore their therapeutic potential.", "timestamp": "12:50 - 10. Jan. 2019", "retweet_count": "112", "favorite_count": "395", "author": "ezraklein", "is_retweet": true}, {"text": "The more Trump talks about his wall, the less likely he is to get it.", "timestamp": "12:42 - 10. Jan. 2019", "retweet_count": "62", "favorite_count": "271", "author": "ezraklein", "is_retweet": true}, {"text": "This is the simple truth:\n\nThe shutdown will end when Senate Republicans decide to end it. They're largely hiding from the cameras, but Trump's position would be untenable without them.", "timestamp": "09:25 - 10. Jan. 2019", "retweet_count": "3662", "favorite_count": "9050", "author": "ezraklein", "is_retweet": true}, {"text": "A simple way to see the political dynamics here. Imagine Trump keeps the shutdown going till November 2020. \n\nWould Republicans be optimistic about that election? No, they'd be horrified.\n\nWould Democrats be optimistic about that election? \n\nThat's where the leverage is.", "timestamp": "16:28 - 9. Jan. 2019", "retweet_count": "600", "favorite_count": "2997", "author": "ezraklein", "is_retweet": true}, {"text": "This is the dynamic I was describing last night. Trump doesn’t care about the wall. Trump wants to look tough in tweets. Making the concessions that would get him his policy goals would make him feel weak, and that's what he actually cares about.  https://www.vox.com/policy-and-politics/2019/1/8/18174776/trump-speech-border-wall-immigration-democrats-reaction …", "timestamp": "15:42 - 9. Jan. 2019", "retweet_count": "826", "favorite_count": "3050", "author": "ezraklein", "is_retweet": true}, {"text": "\"Trump only has the one note, and he has played it literally every time he’s been called on to talk like a president.\"\n\nThat note? Immigrants are coming over the border to kill you.", "timestamp": "12:07 - 9. Jan. 2019", "retweet_count": "399", "favorite_count": "1301", "author": "ezraklein", "is_retweet": true}, {"text": "We're hiring a deputy Washington editor at Vox. You'll be working with an awesome group of reporters focusing on congress, campaigns, and Trump investigations. Interested? Listing here:", "timestamp": "11:50 - 9. Jan. 2019", "retweet_count": "36", "favorite_count": "74", "author": "ezraklein", "is_retweet": true}, {"text": "An underwhelming speech by a president without a plan. https://www.vox.com/policy-and-politics/2019/1/8/18174776/trump-speech-border-wall-immigration-democrats-reaction?utm_campaign=ezraklein&utm_content=chorus&utm_medium=social&utm_source=twitter …", "timestamp": "19:13 - 8. Jan. 2019", "retweet_count": "853", "favorite_count": "4329", "author": "ezraklein", "is_retweet": true}, {"text": "I can't stop thinking about Jared Kushner personally calling House Republicans today telling them that public opinion was going to sweep in the Wall's direction after Trump's speech.", "timestamp": "18:30 - 8. Jan. 2019", "retweet_count": "1007", "favorite_count": "3357", "author": "ezraklein", "is_retweet": true}, {"text": "Schumer's doing a nice job painting Trump into the shutdown corner here. Democrats are happy to reopen the government and keep negotiating on the border. Trump isn't. That's the winning position.", "timestamp": "18:19 - 8. Jan. 2019", "retweet_count": "2073", "favorite_count": "10127", "author": "ezraklein", "is_retweet": true}, {"text": "Well that is an awkward podium setup.", "timestamp": "18:15 - 8. Jan. 2019", "retweet_count": "60", "favorite_count": "1405", "author": "ezraklein", "is_retweet": true}, {"text": "Trump needs House Democratic votes to build this wall. Was a speech aimed at them? At their voters? What is he offering them?\n\nI'll keep saying it: Trump doesn't want the wall. He wants has base to see him fighting for the wall. That's it.", "timestamp": "18:12 - 8. Jan. 2019", "retweet_count": "3367", "favorite_count": "14683", "author": "ezraklein", "is_retweet": true}, {"text": "A president actually concerned about drug deaths in America would be relentlessly focusing on opioid addiction. Trump, by contrast, lost interest in the subject.", "timestamp": "18:08 - 8. Jan. 2019", "retweet_count": "227", "favorite_count": "611", "author": "ezraklein", "is_retweet": true}, {"text": "Trying to stop crime and drug addiction in America by building a border wall is like trying to lose weight by pulling the fire alarm in a supermarket.", "timestamp": "18:06 - 8. Jan. 2019", "retweet_count": "1186", "favorite_count": "4472", "author": "ezraklein", "is_retweet": true}, {"text": "Tonight's drinking game: just drinking.", "timestamp": "18:02 - 8. Jan. 2019", "retweet_count": "915", "favorite_count": "7678", "author": "ezraklein", "is_retweet": true}, {"text": "If you'd like some truth before tonight's lies, I can't recommend this piece highly enough.:", "timestamp": "17:49 - 8. Jan. 2019", "retweet_count": "181", "favorite_count": "337", "author": "ezraklein", "is_retweet": true}, {"text": "As @dlind says, if the border was the kind of security crisis Trump describes, wouldn't there be more political support for Trumpism on the border itself?", "timestamp": "17:45 - 8. Jan. 2019", "retweet_count": "30", "favorite_count": "152", "author": "ezraklein", "is_retweet": true}, {"text": "\"In the current Congress, the only Republican representing a district along the border is Texas Rep. Will Hurd, an outspoken moderate on immigration who says his opposition to a border wall is the reason he won reelection.\"", "timestamp": "17:45 - 8. Jan. 2019", "retweet_count": "59", "favorite_count": "219", "author": "ezraklein", "is_retweet": true}, {"text": "\"The 2018 midterm elections — when Trump, ignoring the advice of other Republicans, hammered relentlessly on border security in the last weeks of the campaign — resulted in Republicans losing two seats along the US-Mexico border.\" https://www.vox.com/2019/1/8/18173721/trump-border-facts-truth-speech-lying …", "timestamp": "17:44 - 8. Jan. 2019", "retweet_count": "71", "favorite_count": "180", "author": "ezraklein", "is_retweet": true}, {"text": "This is the crucial thread to read before Trump's speech.", "timestamp": "15:49 - 8. Jan. 2019", "retweet_count": "180", "favorite_count": "432", "author": "ezraklein", "is_retweet": true}, {"text": "What’s actually happening at the border, explained: https://www.vox.com/2019/1/8/18173721/trump-border-facts-truth-speech-lying …", "timestamp": "15:37 - 8. Jan. 2019", "retweet_count": "61", "favorite_count": "122", "author": "ezraklein", "is_retweet": true}, {"text": "It looks like it'll be Schumer and Pelosi doing the deed, but if they were going to pick someone to give the Democratic response tonight, who should it be?", "timestamp": "10:02 - 8. Jan. 2019", "retweet_count": "146", "favorite_count": "1175", "author": "ezraklein", "is_retweet": true}, {"text": "I'm prepping for a podcast with Cal Newport on digital minimalism and I keep getting distracted by Slack and Twitter and it's all so very meta.", "timestamp": "09:47 - 8. Jan. 2019", "retweet_count": "3", "favorite_count": "182", "author": "ezraklein", "is_retweet": true}, {"text": "A million great points from @AnilDash in this conversation on the hidden biases within the technologies we use all day, every day.\n\nTechnology isn't neutral. How can it be? It's made by humans. The problem is that we so often think it's neutral.", "timestamp": "09:35 - 8. Jan. 2019", "retweet_count": "32", "favorite_count": "105", "author": "ezraklein", "is_retweet": true}, {"text": "This shutdown came because Trump couldn't bear the symbolism of signing a spending bill without the wall. Tonight's speech is a symbol of how hard he's fighting for it. \n\nThis isn't a gamechanger, it's the game.", "timestamp": "09:03 - 8. Jan. 2019", "retweet_count": "772", "favorite_count": "3929", "author": "ezraklein", "is_retweet": true}, {"text": "People looking for persuasion from Trump are always disappointed. Trump practices polarization, not persuasion. His speeches are about firing up his side. They're about raising the stakes. \n\nProblem is, his side is getting smaller, and they no longer control the House.", "timestamp": "09:03 - 8. Jan. 2019", "retweet_count": "562", "favorite_count": "3122", "author": "ezraklein", "is_retweet": true}, {"text": "If Donald Trump wanted the wall, he'd have negotiated away something of value to get it. Or at least tried to do so. \n\nHe doesn't want the wall. He wants the fight over the wall. He wants to be seen going to war over the wall. That's what tonight is about.", "timestamp": "09:03 - 8. Jan. 2019", "retweet_count": "7777", "favorite_count": "28099", "author": "ezraklein", "is_retweet": true}, {"text": "Could Trump declare a national emergency and use his powers to fund his wall? The answer is...maybe. Here's the deal:", "timestamp": "08:53 - 8. Jan. 2019", "retweet_count": "18", "favorite_count": "47", "author": "ezraklein", "is_retweet": true}, {"text": "This is a way that the media can create incentives for Trump to lie less: if his habit of constant dishonesty leads to less airtime rather than more, that matters to him.", "timestamp": "12:51 - 7. Jan. 2019", "retweet_count": "153", "favorite_count": "833", "author": "ezraklein", "is_retweet": true}, {"text": "1. Trump lied to the public about past presidents saying they wished they'd built a border wall.\n\n2. Trump is asking for public airtime to make a nationally televised address on the border wall.\n\nTrump shouldn't be given free airtime simply to lie to the public.", "timestamp": "12:51 - 7. Jan. 2019", "retweet_count": "436", "favorite_count": "1406", "author": "ezraklein", "is_retweet": true}, {"text": "\"We need cultural criticism not just to tell us which movies to go see and which ones to avoid, but to tell us things we already knew but didn’t know how to express. If reporting can explain the world to us, cultural criticism can explain us to us.\"", "timestamp": "12:23 - 7. Jan. 2019", "retweet_count": "43", "favorite_count": "199", "author": "ezraklein", "is_retweet": true}, {"text": "It is very depressing that the place where this cartoon is most needed is the halls of Congress itself.", "timestamp": "11:55 - 7. Jan. 2019", "retweet_count": "302", "favorite_count": "695", "author": "ezraklein", "is_retweet": true}, {"text": "A more skilled workforce is a good thing on its own terms, but the \"skills gap\" wasn't the cause of high unemployment:", "timestamp": "11:00 - 7. Jan. 2019", "retweet_count": "54", "favorite_count": "135", "author": "ezraklein", "is_retweet": true}, {"text": "Read @DrVox's thoughtful, comprehensive look at the #GreenNewDeal:", "timestamp": "10:35 - 7. Jan. 2019", "retweet_count": "32", "favorite_count": "66", "author": "ezraklein", "is_retweet": true}, {"text": "So you get in a bike accident, or have a stroke, and get rushed to their ER, and even though you have health insurance, maybe even excellent health insurance, you wake up with medical bills that can bankrupt you.\n\nGreatest health care system in the world, folks.", "timestamp": "09:55 - 7. Jan. 2019", "retweet_count": "310", "favorite_count": "1232", "author": "ezraklein", "is_retweet": true}, {"text": "Zuckerberg Hospital is the largest public hospital in SF and it doesn't accept network rates from *any* private insurance.", "timestamp": "09:55 - 7. Jan. 2019", "retweet_count": "261", "favorite_count": "442", "author": "ezraklein", "is_retweet": true}, {"text": "In Trump's shutdown (non)strategy, you see the culmination of a life lived doing crazy things and having everything end up working out because of money, power, and connections. \n\nTrump doesn't have an endgame because his life has taught him he doesn't need them.", "timestamp": "08:27 - 7. Jan. 2019", "retweet_count": "1469", "favorite_count": "6291", "author": "ezraklein", "is_retweet": true}, {"text": "What's the difference between liberal reformers of capitalism, like Elizabeth Warren, and actual democratic socialists, like Bernie Sanders?\n\nThis excellent debate between Steve Pearlstein and Bhaskar Sunkara makes it all a lot clearer:", "timestamp": "08:21 - 7. Jan. 2019", "retweet_count": "60", "favorite_count": "185", "author": "ezraklein", "is_retweet": true}, {"text": "So a capitalist and a socialist walk into a bar… https://www.vox.com/the-big-idea/2019/1/7/18167691/what-is-socialism-capitalism-sanders-warren?utm_campaign=ezraklein&utm_content=chorus&utm_medium=social&utm_source=twitter …", "timestamp": "05:03 - 7. Jan. 2019", "retweet_count": "21", "favorite_count": "93", "author": "ezraklein", "is_retweet": true}, {"text": "This is a helluva story.\n\nThe scientist who tried to be as selfless as possible, until it killed him:", "timestamp": "13:53 - 6. Jan. 2019", "retweet_count": "63", "favorite_count": "207", "author": "ezraklein", "is_retweet": true}, {"text": "Jill Lepore is the history professor everyone wishes they'd had.", "timestamp": "16:33 - 5. Jan. 2019", "retweet_count": "26", "favorite_count": "149", "author": "ezraklein", "is_retweet": true}, {"text": "High praise coming from you!", "timestamp": "16:30 - 5. Jan. 2019", "retweet_count": "0", "favorite_count": "5", "author": "ezraklein", "is_retweet": true}, {"text": "But it's notable that House Dem leadership is exempting Medicare-for-All from PAYGO. As I wrote here, whether Dems decide to do what they did with Obamacare, and fully offset Medicare-for-All, will shape the ultimate policy:", "timestamp": "13:56 - 4. Jan. 2019", "retweet_count": "30", "favorite_count": "78", "author": "ezraklein", "is_retweet": true}, {"text": "If you're not up to speed on the House Dems' PAYGO fight, @taragolshan's explainer is an excellent place to start:", "timestamp": "13:44 - 4. Jan. 2019", "retweet_count": "44", "favorite_count": "117", "author": "ezraklein", "is_retweet": true}, {"text": "Statement continues: \"Taking it out of the rules package does not address the real problem which is that it is a statutory requirement. That’s why today I am introducing legislation to repeal PAYGO and hold hearings immediately on why PAYGO is bad policy.\"", "timestamp": "13:44 - 4. Jan. 2019", "retweet_count": "16", "favorite_count": "88", "author": "ezraklein", "is_retweet": true}, {"text": "\"Earlier this week I received a commitment from Rules Committee Chairman Jim McGovern to waive PAYGO for Medicare for All and other key progressive priorities,\" says @RepJayapal in a statement.", "timestamp": "13:44 - 4. Jan. 2019", "retweet_count": "39", "favorite_count": "126", "author": "ezraklein", "is_retweet": true}, {"text": "The economy added more than 300,000 jobs last month. Trump could be taking a victory lap. Instead he's doing...this.", "timestamp": "12:06 - 4. Jan. 2019", "retweet_count": "123", "favorite_count": "1072", "author": "ezraklein", "is_retweet": true}, {"text": "Donald Trump lost the popular vote in 2016, lost the House in 2018, and his big idea now is to double down on an unpopular policy by forcing an extended government shutdown. \n\nThere's this belief out there that Trump's political instincts are gold. They're not.", "timestamp": "12:06 - 4. Jan. 2019", "retweet_count": "1871", "favorite_count": "8880", "author": "ezraklein", "is_retweet": true}, {"text": "Democrats are putting democracy first:", "timestamp": "09:55 - 4. Jan. 2019", "retweet_count": "188", "favorite_count": "568", "author": "ezraklein", "is_retweet": true}, {"text": "People want meat, they want affordability, but they don't want cruelty. The equilibrium right now is producers hide the cruelty. Better laws and more exposure could push us to an equilibrium of finding ways to produce affordable meat that isn't so cruel.", "timestamp": "16:39 - 3. Jan. 2019", "retweet_count": "182", "favorite_count": "1039", "author": "ezraklein", "is_retweet": true}, {"text": "To note good news, when you give voters a direct voice, they vote for reforms improving the treatment of animals raised for food. Ag-gag laws are about depriving the public of the information that might lead them to demand change. It's anti-democratic.", "timestamp": "16:28 - 3. Jan. 2019", "retweet_count": "202", "favorite_count": "1009", "author": "ezraklein", "is_retweet": true}, {"text": "We should be allowed to see how our food is made. We should be able to bear seeing how our food is made. \n\nIf the conditions in which we raise animals for slaughter are so awful they can't be seen, then they should be reformed, not hidden by the force of the state.", "timestamp": "16:28 - 3. Jan. 2019", "retweet_count": "648", "favorite_count": "2526", "author": "ezraklein", "is_retweet": true}, {"text": "I don't think there's anything as damning in our food system as ag-gag laws. Industrial farms torture animals so completely that they need to pass laws criminalizing exposure, and then the government does their bidding, prosecuting activists.", "timestamp": "16:28 - 3. Jan. 2019", "retweet_count": "1180", "favorite_count": "3104", "author": "ezraklein", "is_retweet": true}, {"text": "This is the weird logic of trade wars in a globalized age: you end up having to celebrate causing damaging your own economy because you're trying to cause even more damage to someone else's economy.", "timestamp": "11:50 - 3. Jan. 2019", "retweet_count": "133", "favorite_count": "311", "author": "ezraklein", "is_retweet": true}, {"text": "Jill Lepore on America's two revolutions. This conversation was a blast:", "timestamp": "08:52 - 3. Jan. 2019", "retweet_count": "12", "favorite_count": "66", "author": "ezraklein", "is_retweet": true}, {"text": "This PayGo fight that’s splitting House Democrats is important. People can talk all they want about Medicare-for-All, free college, jacked-up EITC, etc. But if congressional Dems impose PayGo rules on themselves, none of that is likely to happen.", "timestamp": "08:37 - 3. Jan. 2019", "retweet_count": "238", "favorite_count": "470", "author": "ezraklein", "is_retweet": true}, {"text": "Strange, cool, and hypnotic. (via @TheBrowser)", "timestamp": "15:59 - 2. Jan. 2019", "retweet_count": "11", "favorite_count": "69", "author": "ezraklein", "is_retweet": true}, {"text": "Anyway, I wouldn't predict too much off one op-ed. But I wouldn't dismiss it either. Romney knew he'd be opening himself to a lot of backlash by writing this. That suggests commitment from a prominent senator who, unlike Flake or Corker, hasn't wrecked his leverage by retiring.", "timestamp": "08:40 - 2. Jan. 2019", "retweet_count": "105", "favorite_count": "1003", "author": "ezraklein", "is_retweet": true}, {"text": "The other thing is: don't underestimate how difficult coordination problems in Congress are. What Romney's doing is making clear that anti-Trump R Senators can coordinate through him at moments of crisis, and that could prove important.", "timestamp": "08:40 - 2. Jan. 2019", "retweet_count": "94", "favorite_count": "874", "author": "ezraklein", "is_retweet": true}, {"text": "If, say, the Mueller findings are going to lead to congressional action, Senate Republicans willing have to join with Democrats to act. I’ve never thought that particularly likely, but if Romney follows through on the signals he’s sending here…", "timestamp": "08:40 - 2. Jan. 2019", "retweet_count": "63", "favorite_count": "528", "author": "ezraklein", "is_retweet": true}, {"text": "Actions ultimately speak louder than words. But Romney’s op-ed is meaningful, and a real risk from a usually risk-averse politician. He’s signaling to others in the Republican Party that he’s willing to lead internal opposition to Trump.", "timestamp": "08:40 - 2. Jan. 2019", "retweet_count": "861", "favorite_count": "6510", "author": "ezraklein", "is_retweet": true}, {"text": "This family's next reunion is going to be awkward.", "timestamp": "08:22 - 2. Jan. 2019", "retweet_count": "104", "favorite_count": "685", "author": "ezraklein", "is_retweet": true}, {"text": "Let's start 2019 off right. Here's the case for \"conditional optimism\" on climate change:", "timestamp": "07:55 - 2. Jan. 2019", "retweet_count": "30", "favorite_count": "86", "author": "ezraklein", "is_retweet": true}, {"text": "This whole look at 2018 is powerful and lyrical, but the end, oof. All the feels.", "timestamp": "17:06 - 31. Dez. 2018", "retweet_count": "225", "favorite_count": "573", "author": "ezraklein", "is_retweet": true}, {"text": "“They view [the Trump presidency] literally as a crisis,” Christine Matthews, a Republican pollster, said. “It is making women physically sick. That is the word they use all the time — the word is ‘nauseous.’”", "timestamp": "16:46 - 31. Dez. 2018", "retweet_count": "397", "favorite_count": "1067", "author": "ezraklein", "is_retweet": true}, {"text": "The 9 podcast interviews I learned the most from in 2018", "timestamp": "06:33 - 31. Dez. 2018", "retweet_count": "145", "favorite_count": "622", "author": "ezraklein", "is_retweet": true}, {"text": "Rick Perry was right. The Supreme Court needs term limits.", "timestamp": "05:33 - 26. Dez. 2018", "retweet_count": "312", "favorite_count": "1720", "author": "ezraklein", "is_retweet": true}, {"text": "This is a helluva own goal from Steve Mnuchin.", "timestamp": "09:32 - 24. Dez. 2018", "retweet_count": "136", "favorite_count": "469", "author": "ezraklein", "is_retweet": true}, {"text": "\"But your mention of Nixon’s vampire movie overtones made me realize something: While watching Vice, I kept thinking about it as a zombie movie.\" \n\nHaven't seen Vice, but I enjoyed this debate over it:", "timestamp": "11:40 - 23. Dez. 2018", "retweet_count": "20", "favorite_count": "104", "author": "ezraklein", "is_retweet": true}, {"text": "What are the best independent blogs you read these days? I'm talking old-school, someone (or some group) just putting smart thoughts up on the internet.", "timestamp": "09:38 - 23. Dez. 2018", "retweet_count": "193", "favorite_count": "1454", "author": "ezraklein", "is_retweet": true}, {"text": "Great news for @theprospect, which gave me and so many others a start in journalism, and continues to be an essential voice. @ddayen is an inspired choice.", "timestamp": "10:15 - 21. Dez. 2018", "retweet_count": "11", "favorite_count": "84", "author": "ezraklein", "is_retweet": true}, {"text": "Thursday wasn't just Trump's \"day of chaos.\" It was the Republican Congress's day of enabling him, as every day is. \n\nThe ongoing disaster roiling American governance is the Republican Congress’s fault, and they need to be held accountable for it.", "timestamp": "09:00 - 21. Dez. 2018", "retweet_count": "2175", "favorite_count": "6329", "author": "ezraklein", "is_retweet": true}, {"text": "Mattis says Trump deserves a Secretary of Defense who agrees that the US should wreck our alliances, disrespect our friends, and turn a blind eye to authoritarians.\n\nTrump's highest-profile appointee is torching him on the way out. I've never seen anything like it.", "timestamp": "15:26 - 20. Dez. 2018", "retweet_count": "1003", "favorite_count": "3084", "author": "ezraklein", "is_retweet": true}, {"text": "Mattis's resignation statement reads more like a break-up letter. “Because you have the right to have a Secretary of Defense whose views are better aligned with yours on these and other subjects...\"\n\nTranslation: It's not me. It's really, really you.", "timestamp": "15:22 - 20. Dez. 2018", "retweet_count": "569", "favorite_count": "2188", "author": "ezraklein", "is_retweet": true}, {"text": "On the food stamps story, if you missed it:", "timestamp": "15:06 - 20. Dez. 2018", "retweet_count": "695", "favorite_count": "792", "author": "ezraklein", "is_retweet": true}, {"text": "Just today:\n\n1. Trump's pushing a government shutdown over his wall\n2. Defense Secretary Jim Mattis wrote a resignation letter indicting Trump's foreign policy\n3. The Trump admin is trying to cut 775,000 people off food stamps\n\nConfrontation, incompetence, and cruelty.", "timestamp": "15:06 - 20. Dez. 2018", "retweet_count": "3809", "favorite_count": "10020", "author": "ezraklein", "is_retweet": true}, {"text": "As I understand it, Republicans unanimously think Mattis an excellent defense secretary and wise on foreign policy.\n\nMattis's resignation letter makes clear he thinks Trump a terrible president who's dead wrong on foreign policy.\n\nSo...", "timestamp": "15:00 - 20. Dez. 2018", "retweet_count": "6544", "favorite_count": "31852", "author": "ezraklein", "is_retweet": true}, {"text": "Ooh, favorite Earworms? That's hard, but this one blew my mind.", "timestamp": "14:36 - 20. Dez. 2018", "retweet_count": "6", "favorite_count": "48", "author": "ezraklein", "is_retweet": true}]