[{"text": "You know what's a good read? This collection of Wilson Carey McWilliams's writings--some thoughtful essays on liberty and community, a nice reflection on Strauss and American politics, etc. https://www.amazon.com/Democratic-Soul-Wilson-McWilliams-Reader/dp/0813130131 …", "timestamp": "10:15 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "While everyone is speculating about a report they haven't read, maybe take a minute to read this @jaynordlinger reflection on the late Jeffrey Hart, scholar and polemicist.", "timestamp": "09:46 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "\"It's Mueller Time,\" I guess...", "timestamp": "14:18 - 22. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "fredbauerblog", "is_retweet": true}, {"text": "Interesting piece. Worth adding: Many major press outlets have spent considerable effort over past few years to undermine faith in core constitutional institutions and to pit Americans against each other.", "timestamp": "05:53 - 22. März 2019", "retweet_count": "2", "favorite_count": "2", "author": "fredbauerblog", "is_retweet": true}, {"text": "Regarding generational hegemony: It's amazing to think that, over a period of nearly 30 years, the US has had 3 presidents born on the same year (1946, the dawn of the Boomer births).", "timestamp": "17:53 - 21. März 2019", "retweet_count": "1", "favorite_count": "3", "author": "fredbauerblog", "is_retweet": true}, {"text": "If that's true, a way to counter political radicalism would be to support policies that would deliver a robust growth across the economic spectrum. And this would probably require reversing some neoliberal policies (on immigration, etc.) that drive down the cost of labor.", "timestamp": "17:49 - 21. März 2019", "retweet_count": "5", "favorite_count": "7", "author": "fredbauerblog", "is_retweet": true}, {"text": "And it seems quite plausible that this extended slowdown has helped fuel an appetite for political radicalism. (Though I don't believe it's only about economics...)", "timestamp": "17:47 - 21. März 2019", "retweet_count": "1", "favorite_count": "2", "author": "fredbauerblog", "is_retweet": true}, {"text": "I don't necessarily agree with the phrasing here, but, according to GDP numbers, Americans under 35 have spent their working lives in an economy that has had mediocre growth compared to historical rates. (Annual growth post-2000 has been about half the post-WWII average.)", "timestamp": "17:46 - 21. März 2019", "retweet_count": "1", "favorite_count": "3", "author": "fredbauerblog", "is_retweet": true}, {"text": "Not sure how \"respectful\" that veil really is, to be honest. I can't speak to this authoritatively, but it seems that, 20 years ago, mainstream Democrats would not have used the KoC as an attack line. Bill Clinton praised the organization when he was president!", "timestamp": "10:32 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "Worth also keeping in mind that, recently, two prominent Democratic senators claimed that there was something suspect about judicial nominees being members of Knights of Columbus. And many major press outlets didn't really raise much of a fuss about that.", "timestamp": "10:23 - 21. März 2019", "retweet_count": "1", "favorite_count": "4", "author": "fredbauerblog", "is_retweet": true}, {"text": "This isn't to say that there aren't some disruptive elements in that manifesto (and a granular application of its principles might reveal starker divisions)--just that there are some continuities, too.", "timestamp": "09:03 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "Another oddness: In recent months, some have argued that the Senate is inherently biased against Democrats--when, from 2011-5, Democrats held a majority in the Senate while being a minority in the House!", "timestamp": "09:01 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "The way in which liberty depends upon magnanimity reveals the irony of the fact that some in the Trump era have unleashed great personal viciousness in order to defend the \"liberal order\": Two-minutes-of-hate psychology is inherently in tension with liberal self-governance.", "timestamp": "08:54 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "A useful element of the @firstthingsmag manifesto is the defense of the term \"liberality.\" As @HelenaRosenblat's \"Lost History of Liberalism\" shows, many of the defenders of liberty have believed in liberty's dependence upon a certain kind of public and personal generosity.", "timestamp": "08:51 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "And the economic policies of Clay, Lincoln, Coolidge, etc. were about how to promote certain economic interests (such as industry and the middle/working classes).", "timestamp": "08:47 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "Read Thomas G. West's \"The Political Theory of the American Founding\" for copious evidence of the ways that Americans in the founding era believed that an important part of public policy was sustaining certain cultural arrangements (such as a morally informed public).", "timestamp": "08:45 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "More broadly, though, the arc of the tradition that we might think of as \"conservatism\" in an American context has long stressed the importance of communal textures for sustaining individual liberty--and held that government policy has a role in nurturing those textures.", "timestamp": "08:42 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "Now, we've forgotten some of those facts, and the idea that conservatism is simply balanced-budget neoliberalism or Nozickian libertarianism did gain increased purchase as a public narrative in the 1990s and 2000s.", "timestamp": "08:40 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "And, in some respects, conservative efforts were successful in reducing cultural corrosion. For instance, drug use among young people plummeted during the \"Just Say No\" era.", "timestamp": "08:36 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "After all, despite the post-1989 mythologization of Reagan as some radical \"free trader,\" he actually believed that the ideology of \"free trade\" had sometimes to be subordinated to political/public interest (as Japanese import quotas demonstrate).", "timestamp": "08:35 - 21. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "fredbauerblog", "is_retweet": true}, {"text": "I'll confess my conciliating sympathies and admit that this \"manifesto\" does position itself against \"consensus conservatism,\" but I might also note that there are certain continuities between its approach to conservatism and what came before.", "timestamp": "08:32 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "Some of the #GentryRadicalization seen in recent years can be attributed to that frustration.", "timestamp": "07:29 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "Hypothesis: The end of the Electoral College could lead to end of states creating their own ballot rules for federal elections.", "timestamp": "07:27 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "Also, tend to think that Democrats will be better prepared to block an EC-only play in 2020 (compared to hapless Clinton campaign).", "timestamp": "15:40 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "Yes, a president who won 2 terms only because of EC would radically escalate public disillusionment with it as an institution. (That's why, on a normative level, it was important for GWB to win popular vote as well as EC in 2004.)", "timestamp": "15:26 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "(FWIW, one might see the technocratic turn among some postnationalists as exemplifying this trend, too: the shift to postnational governance means the evisceration of democratic restraint.)", "timestamp": "15:02 - 20. März 2019", "retweet_count": "1", "favorite_count": "4", "author": "fredbauerblog", "is_retweet": true}, {"text": "See this thread--and, as Tocqueville warned, a regime that seeks to eliminate all localism in the name of \"democracy\" is one that is likely to become not democratic but despotic.", "timestamp": "15:01 - 20. März 2019", "retweet_count": "3", "favorite_count": "6", "author": "fredbauerblog", "is_retweet": true}, {"text": "Congressman Moulton also said he would oppose Nancy Pelosi as Speaker--before turning around and voting for her.  Is he really the moderate that some in the media portray him to be?", "timestamp": "18:09 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "During the secession crisis, Abraham Lincoln called upon an inclusive sense of civic culture and national history in order to try to lessen factional conflict. Maybe something to remember these days? #MysticChordsOfMemory https://www.nationalreview.com/corner/american-idea-yoni-appelbaum-nationalism-culture-civic-identity/ …", "timestamp": "09:48 - 19. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "fredbauerblog", "is_retweet": true}, {"text": "In 1937, Democrats controlled 70+ seats in the Senate.", "timestamp": "09:32 - 19. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "fredbauerblog", "is_retweet": true}, {"text": "In the 1930s, FDR tried to pack the court because he felt that the judiciary was frustrating his overwhelming popular mandate. Today, some Democrats are thinking about packing the court because they fear they *can't* get an overwhelming popular mandate for their policies.", "timestamp": "09:31 - 19. März 2019", "retweet_count": "3", "favorite_count": "5", "author": "fredbauerblog", "is_retweet": true}, {"text": "cc @GrayConnolly", "timestamp": "12:27 - 17. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "If, as seems plausible, constant exposure to social media affects the psyches of some American adolescents, it wouldn't be too surprising if a Twitter-driven discourse ended up affecting the nervous systems of many media institutions.", "timestamp": "18:31 - 16. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "\"Vote straight-ticket Democratic to save democratic norms\" seems less and less persuasive.", "timestamp": "07:04 - 16. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "fredbauerblog", "is_retweet": true}, {"text": "John Gray on post-Brexit turmoil: \"Instead of trying to understand and implement its result, [the political class has] treated it as an eruption of unreason that must be resisted at any cost.\" That might be true of 2016 in general...", "timestamp": "13:50 - 15. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "But offering that kind of infrastructure deal might have undercut Schumer's position (esp. with the number of Senate Democrats up for reelection in 2018). But WH never tried that deal.", "timestamp": "13:10 - 15. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "fredbauerblog", "is_retweet": true}, {"text": "For instance, the White House could have used repatriation to pay for a big-ticket infrastructure bill and made some funding for \"the wall\" a small portion of that bigger bill. Instead, that repatriation $$ was spent on the tax bill.", "timestamp": "12:55 - 15. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "fredbauerblog", "is_retweet": true}]