[{"text": "That was a bad toss for RCB to lose but their team selection suggested they didn't read the pitch very well - they should've picked an additional spinner - and it took them too long to adapt to conditions. Saini's performance with the ball was encouraging though. #IPL #CSKvRCB", "timestamp": "10:39 - 23. März 2019", "retweet_count": "18", "favorite_count": "131", "author": "fwildecricket", "is_retweet": true}, {"text": "That was a clinical win from CSK. They read the conditions perfectly, picked the right team and exploited the turning pitch really well. That was a great start for the defending champions who will be formidable at home if the pitches continue to play like that. #IPL #CSKvRCB", "timestamp": "10:35 - 23. März 2019", "retweet_count": "37", "favorite_count": "198", "author": "fwildecricket", "is_retweet": true}, {"text": "The pitch took big turn but CSK's spinners were very good. Tahir, Harbhajan and Jadeja hardly gave the stumps away, maintained a tight line and a good length and let the pitch do the rest. #IPL #CSKvRCB", "timestamp": "09:05 - 23. März 2019", "retweet_count": "8", "favorite_count": "48", "author": "fwildecricket", "is_retweet": true}, {"text": "This Chepauk pitch is a huge turner and suits CSK's team & squad. This season they have five frontline spinners: Karn, Bhaji, Tahir, Santner and Jadeja. The great CSK team of 2010-2012 built their success with spin-heavy teams on slow, low home pitches. #IPL #CSKvRCB", "timestamp": "08:15 - 23. März 2019", "retweet_count": "25", "favorite_count": "136", "author": "fwildecricket", "is_retweet": true}, {"text": "RCB's selection is surprising. To go with both Moeen and de Grandhomme, and not pick Southee, leaves the bowling looking light. Death bowling - again - could be a problem later tonight with Siraj joined by one of Umesh or Saini. It's a shame to see no Sundar either. #IPL #CSKvRCB", "timestamp": "07:26 - 23. März 2019", "retweet_count": "22", "favorite_count": "153", "author": "fwildecricket", "is_retweet": true}, {"text": "Very interesting selection from CSK - opting for just three overseas players. It's also a surprise to see no Mohit Sharma in the team after they spent a lot on him at the auction. It's good to see Harbhajan playing on a surface that should suit him. #IPL #CSKvRCB", "timestamp": "07:16 - 23. März 2019", "retweet_count": "3", "favorite_count": "31", "author": "fwildecricket", "is_retweet": true}, {"text": "MI have shown a preference for picking two overseas quicks - something which they could do again this year with strong Indian batting. But they only have one (McClenaghan) available for the start of the season with Malinga absent, Milne injured & Behrendorff in the UAE. #IPL #MI", "timestamp": "12:35 - 22. März 2019", "retweet_count": "10", "favorite_count": "82", "author": "fwildecricket", "is_retweet": true}, {"text": "cricinfo are reporting that Milne has also been ruled out of the IPL with a swollen heel. This is a huge blow to MI who are now without an overseas right-arm quick and will need to bring in a replacement. #IPL #MI", "timestamp": "12:06 - 22. März 2019", "retweet_count": "19", "favorite_count": "53", "author": "fwildecricket", "is_retweet": true}, {"text": "Stoinis being absent for the start of the IPL may give Moeen a chance to establish himself in RCB's team. He'd certainly be a good pick tomorrow at Chepauk where the turning pitch should suit his batting & bowling. Moeen is the best of RCB's three overseas all rounders. #IPL #RCB", "timestamp": "10:24 - 22. März 2019", "retweet_count": "9", "favorite_count": "114", "author": "fwildecricket", "is_retweet": true}, {"text": "Here are my IPL predictions for this season\n\nWinner: MI\nTop four: KKR, SRH, DC\nBottom: RR\nOrange Cap: Shane Watson\nPurple Cap: Sid Kaul\nMVP: Krunal Pandya\nEmerging Player: Ishan Kishan \n\nExplanation for my picks: https://bit.ly/2ul7V0B . \n\n#IPL", "timestamp": "09:49 - 22. März 2019", "retweet_count": "94", "favorite_count": "392", "author": "fwildecricket", "is_retweet": true}, {"text": "Malinga missing six matches is a blow to MI but it should give Milne a chance to establish himself in the team. Milne is one of the most underrated players on the T20 circuit at the moment. He's the top projected pace bowler in the IPL according to @CricViz Match Impact. #IPL #MI", "timestamp": "08:48 - 22. März 2019", "retweet_count": "14", "favorite_count": "129", "author": "fwildecricket", "is_retweet": true}, {"text": "This season MI, SRH & KKR look like the strongest three teams ahead of CSK & DC and then RCB, KXIP & RR. The format of the IPL with just 14 league matches & Play Offs makes it possible for even the weaker teams to win the tournament though, so no team should be written off. #IPL", "timestamp": "06:33 - 22. März 2019", "retweet_count": "12", "favorite_count": "108", "author": "fwildecricket", "is_retweet": true}, {"text": "CSK’s best chance of covering for the loss of Ngidi could be to produce rank turners at the already spin-friendly Chepauk and give Tahir (or Santner) the fourth overseas spot. If they wanted they could pick three frontline spinners: Jadeja, Tahir/Santner & Bhaji/Karn. #IPL #CSK", "timestamp": "06:23 - 22. März 2019", "retweet_count": "16", "favorite_count": "140", "author": "fwildecricket", "is_retweet": true}, {"text": "Here are my Best XIs for each IPL team. @ChennaiIPL @DelhiCapitals @lionsdenkxip @KKRiders @mipaltan @rajasthanroyals @RCBTweets @SunRisers #IPL", "timestamp": "06:09 - 22. März 2019", "retweet_count": "29", "favorite_count": "153", "author": "fwildecricket", "is_retweet": true}, {"text": "Here is my team-by-team @IPL preview, analysing the strengths and weaknesses of every team using @CricViz Match Impact analysis: https://bit.ly/2Wn1DcT . #IPL #CSK #DC #KXIP #KKR #MI #RR #RCB #SRH", "timestamp": "03:18 - 22. März 2019", "retweet_count": "39", "favorite_count": "152", "author": "fwildecricket", "is_retweet": true}, {"text": "Surrey's Will Jacks has just scored a 25 ball century (?!) in a T10 pre-season match against Lancashire in the UAE. It is likely that T10 will help push T20 run rates even higher as batsmen become more aware of the scope of their hitting.", "timestamp": "03:20 - 21. März 2019", "retweet_count": "8", "favorite_count": "60", "author": "fwildecricket", "is_retweet": true}, {"text": "CSK can only replace Ngidi with a player who had the same base price or lower than him in the auction (Rs. 50 lakh). Among the pace bowling options some standouts are: Frylink, Cottrell, Pat Brown, Blair Tickner, McCoy, Ali Khan, Paterson, Dwarshuis & Sipamla. #IPL #CSK", "timestamp": "08:59 - 20. März 2019", "retweet_count": "68", "favorite_count": "261", "author": "fwildecricket", "is_retweet": true}, {"text": "Last year CSK overcame moving from Chepauk to Pune; finding a replacement for Ngidi this soon before the start of the season will require similar ingenuity. He was such a key player for them last season and was set to be again this year. #IPL #CSK", "timestamp": "08:22 - 20. März 2019", "retweet_count": "7", "favorite_count": "51", "author": "fwildecricket", "is_retweet": true}, {"text": "With Lockie Ferguson & Harry Gurney in the squad KKR are covered for pace bowlers, but losing Nortje is a blow. Nortje recently made his ODI debut after a breakthrough tournament in the Mzansi Super League where he took eight wickets at a SR of 9 & ER of 6.91. #KKR #IPL", "timestamp": "03:07 - 20. März 2019", "retweet_count": "2", "favorite_count": "43", "author": "fwildecricket", "is_retweet": true}, {"text": "SL may have fallen short in the Super Over against SA but it was brilliant to watch Lasith Malinga help snatch a tie from the jaws of defeat with 2 for 11 from his four overs. What he has lost in pace he makes up for in cunning. His dipping slower balls are sensational. #SAvSL", "timestamp": "14:27 - 19. März 2019", "retweet_count": "6", "favorite_count": "65", "author": "fwildecricket", "is_retweet": true}, {"text": "Rohit has said he will open for MI in every match this season. This feels like a good call. It'll be interesting whether they partner him with Lewis or de Kock. It looks like Suryakumar will have to move down despite an excellent season last year (512 runs at 8 RPO). #IPL #MI", "timestamp": "01:35 - 19. März 2019", "retweet_count": "9", "favorite_count": "81", "author": "fwildecricket", "is_retweet": true}]