[{"text": "Maybe if you had more faith in your cat's abilities and didn't publicly malign him this way, he'd be able to achieve more.", "timestamp": "15:56 - 23. März 2019", "retweet_count": "2", "favorite_count": "9", "author": "ggreenwald", "is_retweet": true}, {"text": "The continues to be one of the world's greatest events.", "timestamp": "15:40 - 23. März 2019", "retweet_count": "1", "favorite_count": "53", "author": "ggreenwald", "is_retweet": true}, {"text": "This video is completely hilarious. Wolf's facial expressions are priceless.", "timestamp": "15:38 - 23. März 2019", "retweet_count": "590", "favorite_count": "2088", "author": "ggreenwald", "is_retweet": true}, {"text": "I totally agree. That's what I meant. The only way they could believe that I meant this literally is if they were staggeringly stupid. But they're not, which is what proves more sinister and/or self-protective psychological motives are driving it.", "timestamp": "15:37 - 23. März 2019", "retweet_count": "4", "favorite_count": "58", "author": "ggreenwald", "is_retweet": true}, {"text": "That may be. Or maybe people who work in journalism and politics sometimes deliberately distort what people say for their own purposes.", "timestamp": "15:35 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "ggreenwald", "is_retweet": true}, {"text": "\"Trump supporter\" - lol", "timestamp": "15:34 - 23. März 2019", "retweet_count": "1", "favorite_count": "4", "author": "ggreenwald", "is_retweet": true}, {"text": "Exactly. The level of stupidity required to think I literally predicted this is staggering. But so many of them are doing exactly that because they don't know what else to say now that Mueller ended without indicting anyone for election conspiracy so this is all they have.", "timestamp": "15:33 - 23. März 2019", "retweet_count": "2", "favorite_count": "39", "author": "ggreenwald", "is_retweet": true}, {"text": "When you read my tweet, your brain transmitted to you: \"oh, he literally believes that Adam Schiff is going to be publicly demanding the arrest of Robert Mueller?\" That's actually what happened cognitively to you when you saw this tweet?", "timestamp": "15:31 - 23. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "ggreenwald", "is_retweet": true}, {"text": "The number of Democrats trying to pretend that I meant this literally - rather than blatantly using irony and mocking hyperbole to make a point - just so they can have *something* to say to mask their humiliation in the wake of the Mueller Ending, is simply sad.", "timestamp": "15:30 - 23. März 2019", "retweet_count": "4", "favorite_count": "46", "author": "ggreenwald", "is_retweet": true}, {"text": "I forgot about that: the Jill-Stein-is-a-Russian-agent-because-she-was-at-a-dinner-in-Moscow-which-Putin-attended hysteria was very reflective of the toxic stupidity and jingoistic paranoia that reigned for two+ years.", "timestamp": "14:38 - 23. März 2019", "retweet_count": "24", "favorite_count": "117", "author": "ggreenwald", "is_retweet": true}, {"text": "On how humans - all of us - grow, evolve, recognize errors, and have the right not to be held permanently responsible for our worst moments. In many ways, the learning process @mehdirhasan is describing here is the essence of life and one of its most valuable opportunities:", "timestamp": "14:35 - 23. März 2019", "retweet_count": "174", "favorite_count": "880", "author": "ggreenwald", "is_retweet": true}, {"text": "Yes, Putin may soon go on the TV and release the pee-pee tape. Tiffany Trump may have recordings proving her father and Putin planned the DNC hack while having oral sex. The SDNY may indict Trump Jr & Jared for the Trump Tower meeting. But here in the world of facts:", "timestamp": "13:31 - 23. März 2019", "retweet_count": "10", "favorite_count": "32", "author": "ggreenwald", "is_retweet": true}, {"text": "", "timestamp": "13:22 - 23. März 2019", "retweet_count": "5", "favorite_count": "10", "author": "ggreenwald", "is_retweet": true}, {"text": "That's why you keep saying: \"we haven't seen the report yet!\" I get it: that's all you have now to keep your confused followers calm. But its contents can't & won't salvage the 2-year media narrative about Mueller & Russia conspiracy *indictments.* That reckoning is unavoidable.", "timestamp": "13:21 - 23. März 2019", "retweet_count": "336", "favorite_count": "918", "author": "ggreenwald", "is_retweet": true}, {"text": "Things like the above video from Brennan 2 weeks ago predicting a slew of Mueller indictments of Trump family members & tweets like this one from the supremely unhinged Malcolm Nance are what MSNBC viewers have been fed for 2 years straight. The after-effects will long endure:", "timestamp": "13:15 - 23. März 2019", "retweet_count": "358", "favorite_count": "845", "author": "ggreenwald", "is_retweet": true}, {"text": "Obrigado, Renata! ", "timestamp": "12:53 - 23. März 2019", "retweet_count": "0", "favorite_count": "11", "author": "ggreenwald", "is_retweet": true}, {"text": "MSNBC is going to say literally anything to salvage their reputations in the eyes of their partisan viewers. And those who expressed skepticism & dissent about their deranged, now-discredited conspiracies will continue to be banned: no reason to expose the viewers to dissent.", "timestamp": "10:59 - 23. März 2019", "retweet_count": "929", "favorite_count": "2393", "author": "ggreenwald", "is_retweet": true}, {"text": "This @PeteButtigieg answer about the Mueller investigation contains many of the key questions and truths the Democratic Party - using the Mueller investigation and its fixation on PUTIN - has spent two years desperately trying to supress:", "timestamp": "10:46 - 23. März 2019", "retweet_count": "105", "favorite_count": "344", "author": "ggreenwald", "is_retweet": true}, {"text": "Just as with the Iraq War, the people who spread the most discredited, reckless, and destructive conspiracy theories will rise even further in the media & have more MSNBC and CNN appearances because of it. It's the model of making Jeffrey Goldberg EIC of the Atlantic after this:", "timestamp": "10:40 - 23. März 2019", "retweet_count": "196", "favorite_count": "502", "author": "ggreenwald", "is_retweet": true}, {"text": "From the Department of Things That Will Never Happen. TV news outlets, especially cable news hosts and pundits, don't do accountability:", "timestamp": "10:38 - 23. März 2019", "retweet_count": "104", "favorite_count": "336", "author": "ggreenwald", "is_retweet": true}, {"text": "What was the reason?", "timestamp": "10:26 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "ggreenwald", "is_retweet": true}, {"text": "Do you understand why a Special Counsel was appointed in the first place rather than just having the regular DOJ officials and prosecutors conduct investigation and prosecutions?", "timestamp": "10:24 - 23. März 2019", "retweet_count": "2", "favorite_count": "3", "author": "ggreenwald", "is_retweet": true}, {"text": "If they broke myriad laws, as you claim, why didn't Mueller indict them?  He investigated them for 20 months with subpoena power.", "timestamp": "10:14 - 23. März 2019", "retweet_count": "1", "favorite_count": "5", "author": "ggreenwald", "is_retweet": true}, {"text": "The Mueller investigation has closed.", "timestamp": "10:11 - 23. März 2019", "retweet_count": "2", "favorite_count": "5", "author": "ggreenwald", "is_retweet": true}, {"text": "", "timestamp": "10:10 - 23. März 2019", "retweet_count": "3", "favorite_count": "8", "author": "ggreenwald", "is_retweet": true}, {"text": "Me neither! I've been promised it for years. Do you know when it's coming? I've been trying to be patient. I'm so said Mueller closed everything without it happening, as was promised. Do you know who will do it now?", "timestamp": "09:19 - 23. März 2019", "retweet_count": "2", "favorite_count": "45", "author": "ggreenwald", "is_retweet": true}, {"text": "Sorry - I mis-read your tone.", "timestamp": "09:14 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "ggreenwald", "is_retweet": true}, {"text": "It's absolutely true nobody benefited more from the endless stream of Trump/Russia bullshit than MSNBC. It saved careers & that network. It generated huge ratings. It enabled them to sell best-selling books to deluded followers. It turned them into stars. It was a 2-year party:", "timestamp": "09:08 - 23. März 2019", "retweet_count": "1428", "favorite_count": "3830", "author": "ggreenwald", "is_retweet": true}, {"text": "One media lesson of the Iraq War was supposed to be that it's very unhealthy to exclude dissenters and those who are skeptical of the prevailing media narrative. Any chance MSNBC might realize that largely banning dissenters on Trump/Russia produced a very unhealthy environment?", "timestamp": "09:04 - 23. März 2019", "retweet_count": "367", "favorite_count": "1271", "author": "ggreenwald", "is_retweet": true}, {"text": "Finally! Some long over-due honesty about the anti-gay blog she deleted and the hacker she invented and criminally told the FBI to find. Oh: she's talking about the Mueller investigation:", "timestamp": "09:02 - 23. März 2019", "retweet_count": "441", "favorite_count": "1739", "author": "ggreenwald", "is_retweet": true}, {"text": "Also, it's rather false to claim I \"didn't really care about what Trump and Russia did in 2016\" when, in multiple media venues, I was calling for a full investigation, to be made public, before Mueller was appointed. I was indifferent to *some* allegations", "timestamp": "08:51 - 23. März 2019", "retweet_count": "4", "favorite_count": "3", "author": "ggreenwald", "is_retweet": true}, {"text": "Yes, that's from 3 weeks ago. Once Schiff started realizing none of the indictments he & MSNBC spent the last 2 years promising were imminent, he began - like the dishonest worm he is - rewriting and revising history & pretending it was never about this. But everyone knows it was", "timestamp": "08:50 - 23. März 2019", "retweet_count": "10", "favorite_count": "17", "author": "ggreenwald", "is_retweet": true}, {"text": "", "timestamp": "08:20 - 23. März 2019", "retweet_count": "2", "favorite_count": "16", "author": "ggreenwald", "is_retweet": true}, {"text": "Yes, if I went on national television and confidently \"predicted\" that specific individuals were about to be arrested for major felonies (with good reason), and then it turned out it was false and it never happened, I would at least note that I was wrong and apologize.", "timestamp": "07:59 - 23. März 2019", "retweet_count": "4", "favorite_count": "43", "author": "ggreenwald", "is_retweet": true}, {"text": "If the evidence is so clear that Trump, Jr. conspired with Russia over the election and then lied about it to Mueller and Congress, why didn't Mueller indict him for it? Are you angry at Mueller for this?", "timestamp": "07:55 - 23. März 2019", "retweet_count": "3", "favorite_count": "89", "author": "ggreenwald", "is_retweet": true}, {"text": "LOL. Mueller was just \"a side show.\" Yeah - that's totally what the US media narrative conveyed for two years until yesterday. Mueller who?", "timestamp": "07:36 - 23. März 2019", "retweet_count": "374", "favorite_count": "1489", "author": "ggreenwald", "is_retweet": true}, {"text": "I'm not making claims about what's in the Mueller Report. I'm making claims about the indictments & convictions he obtained before closing his team. The number of Americans indicted for conspiring with the Russians over the election is zero. Why is this hard to understand?", "timestamp": "07:35 - 23. März 2019", "retweet_count": "90", "favorite_count": "549", "author": "ggreenwald", "is_retweet": true}, {"text": "The worst part of this video is how Brennan said Mueller would indict Trump Family members for conspiring with Russia before March 15 or after, because he was too noble to do it on the Ides of March. Will MSNBC or Brennan apologize? Will there be consequences for any of this? LOL", "timestamp": "07:32 - 23. März 2019", "retweet_count": "439", "favorite_count": "1170", "author": "ggreenwald", "is_retweet": true}, {"text": "One of the low points in a sewer of two years of media lows:", "timestamp": "07:19 - 23. März 2019", "retweet_count": "652", "favorite_count": "1710", "author": "ggreenwald", "is_retweet": true}, {"text": "I mean: they didn't even get Carter Page! When I was urging a full investigation in lieu of media leaks & predicting the likely outcome back in March, 2017, even I thought they'd get one low-level person for Russia conspiring. No: they got zero. https://theintercept.com/2017/03/16/key-democratic-officials-now-warning-base-not-to-expect-evidence-of-trumprussia-collusion/ …", "timestamp": "07:17 - 23. März 2019", "retweet_count": "255", "favorite_count": "890", "author": "ggreenwald", "is_retweet": true}, {"text": "Also:", "timestamp": "07:14 - 23. März 2019", "retweet_count": "1", "favorite_count": "0", "author": "ggreenwald", "is_retweet": true}, {"text": "The entire reason a Special Counsel was created in the first place was because the DOJ concluded that it couldn't validly or impartially investigate or prosecute the President's family and his campaign, remember??????", "timestamp": "07:13 - 23. März 2019", "retweet_count": "3", "favorite_count": "15", "author": "ggreenwald", "is_retweet": true}, {"text": "THE MUELLER REPORT CAN'T INDICT AND ARREST PEOPLE. That's not how the justice system works. Why is this so hard to for people to process? It's a very basic point.", "timestamp": "07:07 - 23. März 2019", "retweet_count": "60", "favorite_count": "489", "author": "ggreenwald", "is_retweet": true}, {"text": "At least CNN and MSNBC had the decency last night to have a funereal tone. There were no admissions of wrongdoing, and it seemed more pained and coerced than voluntary, but at least it was the first step in the coping process. Down that path lies some salvation at least.", "timestamp": "07:06 - 23. März 2019", "retweet_count": "278", "favorite_count": "1344", "author": "ggreenwald", "is_retweet": true}, {"text": "If you constantly went on TV or wrote things to mislead millions into believing Mueller was coming to arrest Trump, Jr., Jared and a whole slew of others for conspiring with the Russians, just admit it. Save yourselves the embarrassment of all this whitewashing & pretending.", "timestamp": "07:04 - 23. März 2019", "retweet_count": "2087", "favorite_count": "6712", "author": "ggreenwald", "is_retweet": true}, {"text": "He didn't mean anything by it!", "timestamp": "07:02 - 23. März 2019", "retweet_count": "4", "favorite_count": "63", "author": "ggreenwald", "is_retweet": true}, {"text": "So you're not going to admit you lied when you said \"Greenwald thinks the Russians didn’t try to meddle in our election\"? In the face of all the evidence that you lied, you're just going to ignore it without apologizing & move to other questions, thinking I'll answer those?", "timestamp": "06:41 - 23. März 2019", "retweet_count": "0", "favorite_count": "17", "author": "ggreenwald", "is_retweet": true}, {"text": "LOL. Oh my god.", "timestamp": "06:26 - 23. März 2019", "retweet_count": "0", "favorite_count": "12", "author": "ggreenwald", "is_retweet": true}, {"text": "You're blatantly lying. I've always said the exact opposite for more than two years, and all of these links prove that you're lying about my views:", "timestamp": "06:20 - 23. März 2019", "retweet_count": "0", "favorite_count": "17", "author": "ggreenwald", "is_retweet": true}, {"text": "That's fair, Matt. I'm not saying otherwise. I've long urged (even before Mueller was appointed) a full investigation with public disclosure. But Mueller didn't indict 1 American for election-conspiring with Russia: not one! It's amazing. https://medium.com/@ggreenwald/statements-about-possibility-russia-meddling-hacking-need-for-investigations-2016-present-f5794c1496d6 …", "timestamp": "06:15 - 23. März 2019", "retweet_count": "4", "favorite_count": "21", "author": "ggreenwald", "is_retweet": true}, {"text": "Yes.", "timestamp": "06:03 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "ggreenwald", "is_retweet": true}, {"text": "Do you understand the difference between where one is \"conceived\" and where one is \"born\"? In my case, it doesn't matter, since I was both conceived and born in NYC, but your attempt to confuse those two things to prove i'm not a US citizen is quite unhinged.", "timestamp": "06:03 - 23. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "ggreenwald", "is_retweet": true}, {"text": "Do you know what an indictment is?", "timestamp": "06:01 - 23. März 2019", "retweet_count": "0", "favorite_count": "85", "author": "ggreenwald", "is_retweet": true}, {"text": "Mainstream Dem discourse on Trump/Russia has been in InfoWars/Glenn-Beck-chalkboard territory for 2 years now when it comes to circulating reckless conspiracy theories. It may be only a matter of time before the End of Mueller pushes them into QAnon land.", "timestamp": "05:59 - 23. März 2019", "retweet_count": "96", "favorite_count": "413", "author": "ggreenwald", "is_retweet": true}, {"text": "How many days away are we from hearing @RepAdamSchiff threaten Robert Mueller with arrest and prosecution rather than just a subpoena?", "timestamp": "05:58 - 23. März 2019", "retweet_count": "99", "favorite_count": "406", "author": "ggreenwald", "is_retweet": true}, {"text": "It's truly fascinating to watch Dems grapple with the fact that Mueller finished his work without indicting a single American for conspiring with Russia over the election: everything from \"nobody has read his report!\" (irrelevant to that fact) to \"sealed indictments!\" (unhinged).", "timestamp": "05:48 - 23. März 2019", "retweet_count": "207", "favorite_count": "776", "author": "ggreenwald", "is_retweet": true}, {"text": "Interesting. @Isikoff has been one of the few honest voices over the last several months on MSNBC and similar venue about the Mueller investigation - what it was and, critically, was not going to achieve.", "timestamp": "05:41 - 23. März 2019", "retweet_count": "75", "favorite_count": "403", "author": "ggreenwald", "is_retweet": true}, {"text": "The crux of the accusations against David Sirota from the Atlantic's Edward-Isaac Dovere is False", "timestamp": "05:01 - 23. März 2019", "retweet_count": "199", "favorite_count": "608", "author": "ggreenwald", "is_retweet": true}, {"text": "I wasn't born a US citizen? That will come as a shock to my American parents who gave birth to me in New York. Please break it to them gently.", "timestamp": "04:10 - 23. März 2019", "retweet_count": "0", "favorite_count": "6", "author": "ggreenwald", "is_retweet": true}, {"text": "First, that I ever voted for George W. Bush is a total lie. Second, here's Mueller, on video, proving you lied about that, too. 2 demonstrable lies in one tweet - impressive!", "timestamp": "04:09 - 23. März 2019", "retweet_count": "1", "favorite_count": "8", "author": "ggreenwald", "is_retweet": true}, {"text": "I think the most humane thing to do is to stop trying to make them accept reality and just let them go through the multiple stages of the coping process. Maddow started tonight with tiny little steps so maybe she can guide them through it.", "timestamp": "19:42 - 22. März 2019", "retweet_count": "14", "favorite_count": "136", "author": "ggreenwald", "is_retweet": true}, {"text": "\"Oh gosh - turns out that if you hire ex-CIA Directors to be 'news analysts,' they'll abuse our airwaves to disseminate self-serving disinformation\" - what MSNBC executives would be saying right now if they were honest & self-reflecting (and therefore aren't saying):", "timestamp": "19:36 - 22. März 2019", "retweet_count": "1465", "favorite_count": "4111", "author": "ggreenwald", "is_retweet": true}, {"text": "I'm going to try to be patient with you. The clip I just showed you had John Brennan strongly suggesting Mueller was going to issue a slew of indictments charging collusion before he left. That never happened. The Mueller Report can't indict anyone. Do you understand this?", "timestamp": "19:32 - 22. März 2019", "retweet_count": "11", "favorite_count": "152", "author": "ggreenwald", "is_retweet": true}, {"text": "How - if you're an MSNBC viewer (or consumer of similar online content) - can you not be angry & disoriented having been fed utter bullshit like this for 2 straight years with basically no dissent allowed? Just listen to what they were telling you to believe & how false it was ", "timestamp": "19:30 - 22. März 2019", "retweet_count": "1607", "favorite_count": "4607", "author": "ggreenwald", "is_retweet": true}, {"text": "You can't blame MSNBC viewers for being confused. They largely kept dissenters from their Trump/Russia spy tale off the air for 2 years. As recently as 2 weeks ago, they had @JohnBrennan strongly suggesting Mueller would indict Trump family members on collusion as his last act:", "timestamp": "19:25 - 22. März 2019", "retweet_count": "1784", "favorite_count": "4467", "author": "ggreenwald", "is_retweet": true}, {"text": "Trump is demanding full disclosure of the Mueller report - for reasons that are pretty obvious. Let it be seen. https://www.nytimes.com/2019/03/22/us/politics/mueller-report.html?action=click&module=Spotlight&pgtype=Homepage …", "timestamp": "18:35 - 22. März 2019", "retweet_count": "486", "favorite_count": "1472", "author": "ggreenwald", "is_retweet": true}, {"text": "One more from the NYT report on the close of the Mueller investigation, just to drive the nail into the coffin https://www.nytimes.com/2019/03/22/us/politics/mueller-report.html?action=click&module=Spotlight&pgtype=Homepage …", "timestamp": "18:32 - 22. März 2019", "retweet_count": "469", "favorite_count": "1380", "author": "ggreenwald", "is_retweet": true}, {"text": "Can we get it any clearer than this?? From the NYT: https://www.nytimes.com/2019/03/22/us/politics/mueller-report.html?action=click&module=Spotlight&pgtype=Homepage …", "timestamp": "18:31 - 22. März 2019", "retweet_count": "446", "favorite_count": "1351", "author": "ggreenwald", "is_retweet": true}, {"text": "OK, thanks for the clarification. \"Coordination\" is a weird term to use to describe it, as it implies some sort of sinister agreement, particularly in this context. I read a lot of people and don't copy anyone. I just say what I think without coordination.", "timestamp": "18:07 - 22. März 2019", "retweet_count": "4", "favorite_count": "72", "author": "ggreenwald", "is_retweet": true}, {"text": "Thanks, Susan ", "timestamp": "17:18 - 22. März 2019", "retweet_count": "2", "favorite_count": "82", "author": "ggreenwald", "is_retweet": true}, {"text": "LOL. Now I'm the one who vested Mueller with \"the status of arbiter of objective truth.\" That's hilarious. Read this - it's from today:", "timestamp": "16:57 - 22. März 2019", "retweet_count": "4", "favorite_count": "53", "author": "ggreenwald", "is_retweet": true}, {"text": "Thank you.", "timestamp": "16:51 - 22. März 2019", "retweet_count": "0", "favorite_count": "8", "author": "ggreenwald", "is_retweet": true}, {"text": "So many in the media devoted endless airtame & print & pixels misleading people to believe Mueller was coming to arrest & prosecute Trump, Jr, Kushner & so many others for conspiring with Russia over the election & obstruction. None of that happened. You can't pretend it away.", "timestamp": "16:46 - 22. März 2019", "retweet_count": "843", "favorite_count": "2552", "author": "ggreenwald", "is_retweet": true}, {"text": "When you refer to this statement of fact as a \"coordinated talking point,\" could you let us know who \"coordinated\" it? Might it be...Putin? Someone else? I was hoping the end of Mueller's investigation would put an end to inane conspiracies but you've proven that was misplaced.", "timestamp": "16:40 - 22. März 2019", "retweet_count": "20", "favorite_count": "169", "author": "ggreenwald", "is_retweet": true}, {"text": "https://www.nytimes.com/2019/02/21/us/politics/mueller-report-ending.html …", "timestamp": "16:37 - 22. März 2019", "retweet_count": "25", "favorite_count": "159", "author": "ggreenwald", "is_retweet": true}, {"text": "Remember when huge numbers believed this was a genuine account from an real disgruntled high-level Trump aide revealing secrets- roughly when NYT was publishing Louise \"Marshall\" Mensch on its op-ed page & Eric Garland's genius was heralded? This is where our discourse went:", "timestamp": "16:25 - 22. März 2019", "retweet_count": "64", "favorite_count": "387", "author": "ggreenwald", "is_retweet": true}, {"text": "If Mueller's investigation was improperly shut down by the Trump DOJ and Mueller said nothing in protest or said nothing at all about this undue interference, then that's an incredibly serious indictment of Mueller's integrity you're implying (with no evidence, of course).", "timestamp": "16:21 - 22. März 2019", "retweet_count": "1", "favorite_count": "11", "author": "ggreenwald", "is_retweet": true}, {"text": "The parts of the media that spent 2 years obsessing on Trump/Russia are now going to seamlessly pretend it was always unimportant whether Mueller indicted any Americans for conspiring with Russia over the election - when that was the key point all along & everyone knows this:", "timestamp": "16:19 - 22. März 2019", "retweet_count": "717", "favorite_count": "1851", "author": "ggreenwald", "is_retweet": true}, {"text": "The whole point of appointing Mueller was that a Special Counsel was needed to investigate the Trump campaign and those close to the Trump WH because the DOJ couldn't. That was the whole reason the Mueller team existed.", "timestamp": "16:14 - 22. März 2019", "retweet_count": "2", "favorite_count": "11", "author": "ggreenwald", "is_retweet": true}, {"text": "Multiple reporters are reporting that the Mueller report contains no recommendations for further indictments, and that no more sealed or unsealed indictments are coming from Mueller. So yes, there is reporting on this - lots of it", "timestamp": "16:12 - 22. März 2019", "retweet_count": "9", "favorite_count": "61", "author": "ggreenwald", "is_retweet": true}, {"text": "Oh my god. I'm honestly starting to pity people now clinging to this stuff. Have a nice evening, non-ironically.", "timestamp": "16:09 - 22. März 2019", "retweet_count": "1", "favorite_count": "12", "author": "ggreenwald", "is_retweet": true}, {"text": "Roger Stone foi acusado de mentir para os investigadores, não de conspirar com a Rússia.", "timestamp": "16:08 - 22. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "ggreenwald", "is_retweet": true}, {"text": "Pointing out how many Americans have been indicted by Mueller for conspiring with Russia to influence the election is called a fact, not \"editorializing.\"", "timestamp": "16:05 - 22. März 2019", "retweet_count": "3", "favorite_count": "24", "author": "ggreenwald", "is_retweet": true}, {"text": "And to be clear: I've urged a full investigation into these Trump/Russia claims from the start, from before Mueller was appointed, with full disclosure. I still favor that - precisely to end the reckless speculation to which we've been endlessly subjected", "timestamp": "16:03 - 22. März 2019", "retweet_count": "287", "favorite_count": "1492", "author": "ggreenwald", "is_retweet": true}, {"text": "", "timestamp": "16:00 - 22. März 2019", "retweet_count": "3", "favorite_count": "25", "author": "ggreenwald", "is_retweet": true}, {"text": "US discourse has been drowned for 2+ years with conspiratorial, unhinged, but highly inflammatory and unhinged idiocy - playing games with two nuclear-armed powers because of anger over the 2016 election. It's time to stop. Mueller ended his work. We see the public indictments.", "timestamp": "15:57 - 22. März 2019", "retweet_count": "994", "favorite_count": "3046", "author": "ggreenwald", "is_retweet": true}, {"text": "If Mueller found evidence that Putin controls Trump & forces him to act against US interests & in favor of Russia - not just with a pee-pee tape but with financial blackmail - what could possibly justify keeping that a secret through the end of the investigation? It's ludicrous.", "timestamp": "15:55 - 22. März 2019", "retweet_count": "495", "favorite_count": "2004", "author": "ggreenwald", "is_retweet": true}, {"text": "Trump, Jr. testified for hours and hours before Congress, including about the Trump Tower meeting. If he lied there, or to Mueller, why didn't Mueller indict him for perjury, lying to Congress or obstruction? Same questions for Kushner. Stop embarrassing yourselves.", "timestamp": "15:54 - 22. März 2019", "retweet_count": "966", "favorite_count": "3095", "author": "ggreenwald", "is_retweet": true}, {"text": "The desperate attempts to salvage something from this debacle by the Mueller dead-enders are just sad. Yes, the public hasn't read the Mueller report. But we *know* he ended his investigation without indicting a single American for conspiring with Russia to influence the election", "timestamp": "15:53 - 22. März 2019", "retweet_count": "1135", "favorite_count": "3266", "author": "ggreenwald", "is_retweet": true}, {"text": "Conspiracy is a federal crime.", "timestamp": "15:15 - 22. März 2019", "retweet_count": "1", "favorite_count": "5", "author": "ggreenwald", "is_retweet": true}, {"text": "I was just there in December and will be there again in 2 weeks. Want to have lunch?", "timestamp": "15:12 - 22. März 2019", "retweet_count": "0", "favorite_count": "7", "author": "ggreenwald", "is_retweet": true}, {"text": "Do you understand what it means that the Mueller investigation has been completed?", "timestamp": "15:11 - 22. März 2019", "retweet_count": "2", "favorite_count": "15", "author": "ggreenwald", "is_retweet": true}, {"text": "All along, the question of whether the Trump/Russia conspiracy was proven was an *evidentiary* question. But manipulative Democrats tried to distort it into an ideological and tribal one (if you question our Trump/Russia narrative, it means you're a Trump supporter). So stupid:", "timestamp": "15:08 - 22. März 2019", "retweet_count": "466", "favorite_count": "1106", "author": "ggreenwald", "is_retweet": true}, {"text": "I'm not gleeful - just disgusted that much of the US media spent 2 years spreading baseless (but very dangerous) conspiracy theories and mindlessly believing what their CIA, NSA and FBI sources whispered to them without seeing evidence - yet again.", "timestamp": "15:03 - 22. März 2019", "retweet_count": "729", "favorite_count": "2401", "author": "ggreenwald", "is_retweet": true}, {"text": "CNN's Justice Department reporter", "timestamp": "14:53 - 22. März 2019", "retweet_count": "316", "favorite_count": "1527", "author": "ggreenwald", "is_retweet": true}, {"text": "Sim, mas o relatório do Mueller não pode processar nem transforme qualquer um em um réu. O trabalho dele está concluído e nem um americano - nem um - foi processado, muito menos condenado, por conspirar com a Rússia para influenciar a eleição de 2016. Isto é um fato.", "timestamp": "14:52 - 22. März 2019", "retweet_count": "2", "favorite_count": "27", "author": "ggreenwald", "is_retweet": true}, {"text": "False.", "timestamp": "14:40 - 22. März 2019", "retweet_count": "0", "favorite_count": "9", "author": "ggreenwald", "is_retweet": true}, {"text": "GIving up these exciting conspiracy theories about international blackmail & convening panels to decipher all the genius hidden maneuvers of Mueller will be bad for cable ratings, book sales & the Patreon accounts of online charlatans. But it'll be very healthy in all other ways.", "timestamp": "14:37 - 22. März 2019", "retweet_count": "566", "favorite_count": "2466", "author": "ggreenwald", "is_retweet": true}, {"text": "Perhaps now we can focus on the actually consequential actions the Trump administration is taking and finally move past the deranged conspiracy theories that have drowned US discourse for 2+ years. A side benefit will be not ratcheting up tension between 2 nuclear-armed powers.", "timestamp": "14:35 - 22. März 2019", "retweet_count": "859", "favorite_count": "3258", "author": "ggreenwald", "is_retweet": true}, {"text": "Are we now ready to rid ourselves of the thrilling espionage fantasy that Trump is controlled by Putin and the Kremlin using blackmail? There's no way Robert Mueller would have gone 18 months without telling anyone about this if it were true, right? How could that be justified?", "timestamp": "14:34 - 22. März 2019", "retweet_count": "728", "favorite_count": "2897", "author": "ggreenwald", "is_retweet": true}, {"text": "Emergency podcasts are needed:", "timestamp": "14:32 - 22. März 2019", "retweet_count": "297", "favorite_count": "1456", "author": "ggreenwald", "is_retweet": true}, {"text": "Don't even try to pretend the point of the Mueller investigation from the start wasn't to obtain prosecutions of Americans guilty of conspiring with Russia to influence the outcome of the election or that Putin controlled Trump through blackmail. Nobody will believe your denials.", "timestamp": "14:30 - 22. März 2019", "retweet_count": "1178", "favorite_count": "3525", "author": "ggreenwald", "is_retweet": true}, {"text": "Who signed it into law? And heralded it from the White House?", "timestamp": "14:25 - 22. März 2019", "retweet_count": "32", "favorite_count": "775", "author": "ggreenwald", "is_retweet": true}, {"text": "", "timestamp": "14:22 - 22. März 2019", "retweet_count": "228", "favorite_count": "1531", "author": "ggreenwald", "is_retweet": true}, {"text": "Because the Democrats implemented a law called \"The Defense of Marriage Act\" in 1996 that barred my Brazilian husband from obtaining immigration rights to live with me in the US, so've lived together in Brazil since 2005. And oh: also because Bob Mueller wanted to get me. ", "timestamp": "14:19 - 22. März 2019", "retweet_count": "114", "favorite_count": "1488", "author": "ggreenwald", "is_retweet": true}, {"text": "Compare what cable hosts (let's leave them unnamed) & Democratic operatives spent two years claiming this would lead to - the imprisonment of Don, Jr., Jared, even Trump on conspiracy-with-Russia charges - to what it actually produced. A huge media reckoning is owed.", "timestamp": "14:17 - 22. März 2019", "retweet_count": "2011", "favorite_count": "6193", "author": "ggreenwald", "is_retweet": true}, {"text": "The Mueller investigation is complete and this is a simple fact that will never go away: not one single American was charged, indicted or convicted for conspiring with Russia to influence the 2016 election - not even a low-level volunteer. The number is zero.", "timestamp": "14:13 - 22. März 2019", "retweet_count": "13306", "favorite_count": "32632", "author": "ggreenwald", "is_retweet": true}, {"text": "Independentemente da ideologia, deve ficar claro que @MarceloFreixo é um dos políticos mais corajosos do mundo democrático e merece o apoio de todos por terem exposto milícias e enfrentar uma década inteira de sérias ameaças e conseqüências assim:", "timestamp": "13:15 - 22. März 2019", "retweet_count": "488", "favorite_count": "2829", "author": "ggreenwald", "is_retweet": true}, {"text": "Oh, OK - It was my point, but now I'm denying it was because I find your criticisms so hurtful, important and intimidating that I'm willing to disavow my own beliefs in order to appease you and avoid your wrath.", "timestamp": "13:09 - 22. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "ggreenwald", "is_retweet": true}, {"text": "Obama went on Fox long before 2014, including in 2008 when he was running for President. But the idea that Fox didn't exist or have power until Obama went on it wasn't even remotely my point- it wasn't even in the same universe as my point.", "timestamp": "13:06 - 22. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "ggreenwald", "is_retweet": true}, {"text": "Thanks, Marcy.", "timestamp": "11:48 - 22. März 2019", "retweet_count": "1", "favorite_count": "75", "author": "ggreenwald", "is_retweet": true}, {"text": "Hi, you racist piece of garbage. The person you're demeaning as \"the boytoy\" is my husband of 14 years, the father of our 2 kids, and an elected member of the Brazilian Congress. Just because he's brown & Brazilian doesn't entitle you to malign him with homophobic, racist insults", "timestamp": "11:40 - 22. März 2019", "retweet_count": "7", "favorite_count": "178", "author": "ggreenwald", "is_retweet": true}, {"text": "Correct - and it's 4 hours later, and they still haven't stopped.", "timestamp": "11:23 - 22. März 2019", "retweet_count": "1", "favorite_count": "111", "author": "ggreenwald", "is_retweet": true}, {"text": "There were in an orphanage/shelter for about 4 years previously.", "timestamp": "11:14 - 22. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "ggreenwald", "is_retweet": true}, {"text": "Thanks! 97% of the time it totally is!", "timestamp": "10:24 - 22. März 2019", "retweet_count": "0", "favorite_count": "74", "author": "ggreenwald", "is_retweet": true}, {"text": "They've been with us 18 months. This was just the final legal step. So they're very well accustomed to the dogs. They each chose one early on as their own and those dogs really helped with the transition.", "timestamp": "09:47 - 22. März 2019", "retweet_count": "4", "favorite_count": "255", "author": "ggreenwald", "is_retweet": true}, {"text": "Today @davidmirandario and I were in a family court in Northeastern Brazil to complete the final legal step of our adoption. I didn't expect it to be so amazing. One of the best moments of our lives", "timestamp": "09:32 - 22. März 2019", "retweet_count": "1014", "favorite_count": "14609", "author": "ggreenwald", "is_retweet": true}, {"text": "More members of the United States Congress working to protect a foreign nation instead of the interests of their constituents who sent them to Congress. Apparently, the US & NYC have so few problems that @RepJerryNadler has nothing to do but introduce bills to protect Israel:", "timestamp": "08:49 - 22. März 2019", "retweet_count": "159", "favorite_count": "386", "author": "ggreenwald", "is_retweet": true}, {"text": "For those now trying to revise history - with very obvious motives - about what everyone agreed was the core purpose and objective of the Mueller investigation, here's the first paragraph of the NYT article reporting his appointment in 2017 https://www.nytimes.com/2017/05/17/us/politics/robert-mueller-special-counsel-russia-investigation.html …", "timestamp": "08:03 - 22. März 2019", "retweet_count": "115", "favorite_count": "247", "author": "ggreenwald", "is_retweet": true}, {"text": "God bless George W. Bush's FBI chief. #Resist. But make sure to bless him quickly because he's leaving soon!", "timestamp": "07:46 - 22. März 2019", "retweet_count": "7", "favorite_count": "212", "author": "ggreenwald", "is_retweet": true}, {"text": "This is the saddest thing I've ever read. Robert Mueller was George Bush's post-9/11 FBI Chief who rounded up Muslims and was a key figure in WMD lies. And now this:", "timestamp": "07:33 - 22. März 2019", "retweet_count": "1840", "favorite_count": "5872", "author": "ggreenwald", "is_retweet": true}, {"text": "By far the event that most \"legitimized\" Fox as a major news network is when major Democratic officials routinely went on there, the most important being when Obama gave Bill O'Reilly an exclusive interview in the WH. Jeet won't mention that for reasons too obvious to explain.", "timestamp": "07:30 - 22. März 2019", "retweet_count": "12", "favorite_count": "116", "author": "ggreenwald", "is_retweet": true}, {"text": "The reason you attack me, Donna Brazile & Mike Tracey for going on Fox - but cowardly refuse to mention it was Obama who gave exclusives to Bill O'Reilly, massively legitimizing Fox's status, or Hillary & Bernie who did the same - is because you're an addict for Twitter likes.", "timestamp": "07:22 - 22. März 2019", "retweet_count": "11", "favorite_count": "92", "author": "ggreenwald", "is_retweet": true}, {"text": "There are many, many Americans who live in countries that are not the United States. They are not any less American citizens than you for doing so. Did you not learn this in 4th grade civics?", "timestamp": "07:21 - 22. März 2019", "retweet_count": "1", "favorite_count": "5", "author": "ggreenwald", "is_retweet": true}, {"text": "The idea that you become responsible for- or endorse- what a cable network does by appearing on it is truly too stupid for words, but worse are the cowards like you who attack easy targets like me & Donna Brazile while refusing to condemn those who did the most to legitimize Fox:", "timestamp": "07:19 - 22. März 2019", "retweet_count": "2", "favorite_count": "55", "author": "ggreenwald", "is_retweet": true}, {"text": "I'm not American? I did not know this. Sorry that my citizenship has been revoked. Who did that?", "timestamp": "07:14 - 22. März 2019", "retweet_count": "0", "favorite_count": "6", "author": "ggreenwald", "is_retweet": true}, {"text": "", "timestamp": "07:13 - 22. März 2019", "retweet_count": "3", "favorite_count": "10", "author": "ggreenwald", "is_retweet": true}, {"text": "Marcy, I know you have a lot at stake here personally because you claimed you gave smoking gun evidence of collusion to Mueller & even *outed your own source* to the FBI, so I won't argue with you. Sorry it's ending like this. You can argue with the NYT: https://www.nytimes.com/2019/02/21/us/politics/mueller-report-ending.html …", "timestamp": "07:06 - 22. März 2019", "retweet_count": "99", "favorite_count": "350", "author": "ggreenwald", "is_retweet": true}, {"text": "LOL. My husband is in Congress as part of the left-wing Socialist party (PSOL) that is one of the most vehemently opposed to Bolsonaro. But yeah :\"thanks to Bolsonaro.\"", "timestamp": "06:45 - 22. März 2019", "retweet_count": "0", "favorite_count": "13", "author": "ggreenwald", "is_retweet": true}, {"text": "It's one of the most prestigious awards in journalism, if not the most prestigious, that Australia has. Just because something is outside of  the United States of America doesn't make it unimportant or worthless.", "timestamp": "04:59 - 22. März 2019", "retweet_count": "4", "favorite_count": "50", "author": "ggreenwald", "is_retweet": true}, {"text": "This gentleman, a former member of Brazil's Congress, literally tattooed his arm with the name of Michel Temer when he replaced DIlma as President to pay homage & show loyalty. He now refuses to comment on Temer's arrest yesterday for being an organized crime leader:", "timestamp": "04:56 - 22. März 2019", "retweet_count": "64", "favorite_count": "229", "author": "ggreenwald", "is_retweet": true}, {"text": "Hopefully, Dems this time won't make the same mistake of 2016 of choosing an unpopular centrist instead of a popular leftist, which I tried hard to warn them would elect Trump. Hopefully they'll also talk about things Americans care about instead of Putin", "timestamp": "04:54 - 22. März 2019", "retweet_count": "26", "favorite_count": "161", "author": "ggreenwald", "is_retweet": true}, {"text": "I'm the ones who gave out this prestigious award", "timestamp": "04:45 - 22. März 2019", "retweet_count": "11", "favorite_count": "84", "author": "ggreenwald", "is_retweet": true}, {"text": "If Trump wins a second term, the people he should thank first are those who devoted themselves for two years to little other than a country and leader - Russia and Putin - that Americans care little about instead of things that actually matter to them: meaning frauds like you.", "timestamp": "04:43 - 22. März 2019", "retweet_count": "44", "favorite_count": "287", "author": "ggreenwald", "is_retweet": true}, {"text": "Someone should start a pool on who will be the first person on cable news to insinuate this:", "timestamp": "04:41 - 22. März 2019", "retweet_count": "561", "favorite_count": "2444", "author": "ggreenwald", "is_retweet": true}, {"text": "POLITICO on what top Democrats except from the Mueller Report: https://www.politico.com/newsletters/playbook/2019/03/22/why-muellers-end-is-only-the-beginning-413618?nname=playbook&nid=0000014f-1646-d88f-a1cf-5f46b7bd0000&nrid=0000014e-f0ed-dd93-ad7f-f8edad790000&nlid=630318 …", "timestamp": "04:39 - 22. März 2019", "retweet_count": "260", "favorite_count": "770", "author": "ggreenwald", "is_retweet": true}, {"text": "I used to love and revere prosecutors and George Bush's FBI Director and uncritically accept claims from the CIA about threats posed by foreign adversaries - that's what all my journalism has been about - but now I've changed suddenly so it's probably because Putin is paying me.", "timestamp": "17:31 - 21. März 2019", "retweet_count": "3", "favorite_count": "20", "author": "ggreenwald", "is_retweet": true}, {"text": "", "timestamp": "17:26 - 21. März 2019", "retweet_count": "0", "favorite_count": "11", "author": "ggreenwald", "is_retweet": true}, {"text": "Then why hasn't Mueller indicted them - or anyone - for that if this evidence is ias clear as you claim? Seems like a long time to leave criminals in office.", "timestamp": "17:25 - 21. März 2019", "retweet_count": "5", "favorite_count": "44", "author": "ggreenwald", "is_retweet": true}, {"text": "From @AriMelber who - while pointing out that lots of Trump associates being charged & convicted is not good for Trump - notes what should be obvious: that thus far Mueller has indicted **zero** Americans for conspiring with Russia & that will hand Trump a big win if unchanged:", "timestamp": "17:11 - 21. März 2019", "retweet_count": "101", "favorite_count": "320", "author": "ggreenwald", "is_retweet": true}, {"text": "You don't say....", "timestamp": "17:08 - 21. März 2019", "retweet_count": "102", "favorite_count": "494", "author": "ggreenwald", "is_retweet": true}, {"text": "Lula's conviction and imprisonment remains highly controversial even among anti-PT legal scholars, as does Dilma's impeachment. But the whole country heard Temer on audio tapes ordering bribes; the evidence of his massive criminality is overwhelming", "timestamp": "16:06 - 21. März 2019", "retweet_count": "65", "favorite_count": "234", "author": "ggreenwald", "is_retweet": true}, {"text": "Last 4 Brazilian Presidents:\n\n* Lula da Silva (2002-2010): imprisoned on corruption charges for 12 years\n* Dilma Rousseff (2010-2016): impeached\n* Michel Temer (2016-2018): arrested today for being an organized crime leader\n* Jair Bolsonaro (2018-): multiple paramilitary links", "timestamp": "16:05 - 21. März 2019", "retweet_count": "135", "favorite_count": "388", "author": "ggreenwald", "is_retweet": true}, {"text": "Também nunca esquecerei uma das exibições mais embaraçosas de jornalismo que já vi quando a mídia brasileira tentava vender Michel Temer como um honrado e nobre líder depois que conseguiram remover Dilma:", "timestamp": "13:13 - 21. März 2019", "retweet_count": "555", "favorite_count": "1405", "author": "ggreenwald", "is_retweet": true}, {"text": "Nunca esquecerei isto: quando @ECantanhede anunciou em @Estadao em 2016 que, basicamente, quem era contra Michel Temer era traidor do Brasil.", "timestamp": "13:11 - 21. März 2019", "retweet_count": "404", "favorite_count": "1316", "author": "ggreenwald", "is_retweet": true}, {"text": "Also: the key figure in Congress who caused the impeachment of Dilma to proceed & who presided over the vote to remove her - Eduardo Cunha - is already now in prison for many years for gangster crimes. Dilma wasn't the criminal; those who removed her were.", "timestamp": "07:45 - 21. März 2019", "retweet_count": "98", "favorite_count": "276", "author": "ggreenwald", "is_retweet": true}, {"text": "The realization is sinking in among lots of reporters that the fundamental claims of @TheAtlantic's accusatory attack on @davidsirota by @IsaacDovere was simply false. We're working on our story about it now. So are many others. That story has collapsed, humiliatingly.", "timestamp": "07:41 - 21. März 2019", "retweet_count": "907", "favorite_count": "3171", "author": "ggreenwald", "is_retweet": true}, {"text": "In 2017, shortly after Dilma was impeached, everyone heard audio tapes of Temer ordering bribes to silence witnesses. He himself clearly receive huge amounts of bribes. But the same Congress that impeached Dilma protected him. Prison is where he belongs", "timestamp": "07:39 - 21. März 2019", "retweet_count": "186", "favorite_count": "459", "author": "ggreenwald", "is_retweet": true}, {"text": "Former Brazilian President @MichelTemer - who was installed as President when Dilma was removed under the pretext of fighting corruption - was just arrested on charges of various forms of corruption. The impeachment of Dilma will be remembered as one of democracy's greatest scams", "timestamp": "07:38 - 21. März 2019", "retweet_count": "159", "favorite_count": "366", "author": "ggreenwald", "is_retweet": true}, {"text": "My favorite \"DC-journalists-are-out-of-touch episode\" from the 2016 campaign was this 2015 Dan Balz article in the WashPost strongly suggesting that Trump's first mean comments about John McCain would doom his candidacy https://www.washingtonpost.com/politics/trumps-attack-on-mccain-marks-a-turning-point-for-him--and-the-gop/2015/07/19/92759254-2e51-11e5-97ae-30a30cca95d7_story.html …", "timestamp": "13:54 - 20. März 2019", "retweet_count": "89", "favorite_count": "396", "author": "ggreenwald", "is_retweet": true}, {"text": "Bolsonaro is so submissive to the US and Trump - but especially the US - that it's actually uncomfortable to watch. It's also true of his sons and his followers. Total self-degradation as part of a creepy inferiority complex:", "timestamp": "13:11 - 20. März 2019", "retweet_count": "198", "favorite_count": "685", "author": "ggreenwald", "is_retweet": true}, {"text": "Not just publicly, but I was haranguing Fox specifically about it, insisting that it be aired.", "timestamp": "19:00 - 19. März 2019", "retweet_count": "2", "favorite_count": "33", "author": "ggreenwald", "is_retweet": true}, {"text": "Yeah: it's like the LA/NYC rivalry: whoever likes ones hates the other. And I've just accepted my new and likely permanent lot in life as \"@davidmirandario's husband.\" A friend of mine warned me it would happen after this 2016 headline from @TheAdvocateMag", "timestamp": "18:56 - 19. März 2019", "retweet_count": "0", "favorite_count": "8", "author": "ggreenwald", "is_retweet": true}, {"text": "People who don't live in Brazil are going to assume you're being sarcastic or trolly.", "timestamp": "18:06 - 19. März 2019", "retweet_count": "7", "favorite_count": "159", "author": "ggreenwald", "is_retweet": true}, {"text": "Two men who have six wives between them - because they kept substituting their wives with younger replacements - and who had children with each of them - pay homage to the imperative that we pay \"respect to traditional family lifestyles.\" Very inspiring:", "timestamp": "18:01 - 19. März 2019", "retweet_count": "8363", "favorite_count": "24423", "author": "ggreenwald", "is_retweet": true}, {"text": "If you believe Trump is the \"most vicious dictator since Pol Pot,\" you should be directing your rage toward Pelosi, Hoyer and the Dems for allowing him to stay in office, not toward me. In fact, if you believed that, you should be marching and doing sit-ins in Pelosi's office.", "timestamp": "17:49 - 19. März 2019", "retweet_count": "3", "favorite_count": "31", "author": "ggreenwald", "is_retweet": true}, {"text": "Fantasies of international blackmail are fun & exciting. That's why Hollywood builds movies around them & fiction thrillers based on them go on best-seller lists. But rational, stable, healthy people in politics don't peddle them as real absent nefarious motives: ratings & profit", "timestamp": "17:45 - 19. März 2019", "retweet_count": "86", "favorite_count": "481", "author": "ggreenwald", "is_retweet": true}, {"text": "Anyone who genuinely believed \"Putin has something on Trump\" - meaning leverage that allows Russia to force Trump to obey Putin to the detriment of the US - would be doing *everything* to remove Trump from office. But, of course, it was always just fodder for the cable masses.", "timestamp": "17:42 - 19. März 2019", "retweet_count": "196", "favorite_count": "754", "author": "ggreenwald", "is_retweet": true}, {"text": "I'm still waiting for someone to explain how it could be moral - let alone patriotic - to leave someone in office for 2 full years - in charge of the nuclear arsenal, military and Executive Branch - who is controlled by Putin & forced to act to serve Russia at the expense of US:", "timestamp": "17:40 - 19. März 2019", "retweet_count": "247", "favorite_count": "844", "author": "ggreenwald", "is_retweet": true}, {"text": "", "timestamp": "17:35 - 19. März 2019", "retweet_count": "0", "favorite_count": "35", "author": "ggreenwald", "is_retweet": true}, {"text": "Rsrsrs - fiz essa piada mais cedo hj", "timestamp": "17:14 - 19. März 2019", "retweet_count": "3", "favorite_count": "149", "author": "ggreenwald", "is_retweet": true}, {"text": "Muito bonitinho! Vcs 2 devem visitar Rio.", "timestamp": "16:57 - 19. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "ggreenwald", "is_retweet": true}, {"text": "Meia hora antes de Bolsonaro ser entrevistado pela Fox News, conversei com @IngrahamAngle, da Fox, e fiz questão de lembrar que o escândalo envolvendo o presidente brasileiro e as milícias é muito mais importante que a postura da líder Democrata Nancy Pelosi em relação à Trump.", "timestamp": "16:46 - 19. März 2019", "retweet_count": "841", "favorite_count": "3689", "author": "ggreenwald", "is_retweet": true}, {"text": "One of the most important objectives when working on a presidential campaign is to minimize as much as possible the range of people who support your candidate, and therefore exclude and banish anyone who praises them if they're disliked by anyone else.", "timestamp": "13:35 - 19. März 2019", "retweet_count": "0", "favorite_count": "33", "author": "ggreenwald", "is_retweet": true}, {"text": "Also, I forgot how much delight it gives me when you engage in Twitter banter with the Blanchard brothers and they like all of one another's replies. It gave me such joy the first time it happened and it's never diluted no matter how often I've been blessed by it.", "timestamp": "13:33 - 19. März 2019", "retweet_count": "1", "favorite_count": "8", "author": "ggreenwald", "is_retweet": true}, {"text": "What kind of monstrous troglodyte travels all the way to Brazil and only goes to São Paulo but not **Rio**?", "timestamp": "13:32 - 19. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "ggreenwald", "is_retweet": true}, {"text": "For me, it's not a \"debate with Nathan\" if there's no bowtie, so I felt like I could leave that implicit.", "timestamp": "13:30 - 19. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "ggreenwald", "is_retweet": true}, {"text": "That wasn't Jack Goldsmith's argument, and I've always been in favor of a complete and full investigation into the Trump/Russia allegations since before Mueller was even appointed, as those documents I just sent you prove.", "timestamp": "13:28 - 19. März 2019", "retweet_count": "0", "favorite_count": "7", "author": "ggreenwald", "is_retweet": true}, {"text": "Typically thoughtful answer from @PeteButtigieg to @ThePlumLineGS about white nationalism, the causes of it, and the solutions for it: https://www.washingtonpost.com/opinions/2019/03/19/how-democrats-can-defeat-trump-his-ugly-ideas-according-pete-buttigieg/?utm_term=.faa4d127a433 …", "timestamp": "13:16 - 19. März 2019", "retweet_count": "108", "favorite_count": "435", "author": "ggreenwald", "is_retweet": true}, {"text": "I've long thought about having a debate with Nathan where I unleash various forms of poisonous ants against him, and they crawl up his leg, slowly gnawing and biting, but only in an annoying way, until the really vicious ones leave no doubt about what's going on. Is that wrong?", "timestamp": "13:09 - 19. März 2019", "retweet_count": "1", "favorite_count": "9", "author": "ggreenwald", "is_retweet": true}, {"text": "In case anyone is believing anything you're claiming about me, I'll post these two links with my actual words and links to prove how much you're lying: 1) https://medium.com/@ggreenwald/statements-about-possibility-russia-meddling-hacking-need-for-investigations-2016-present-f5794c1496d6 … - 2)", "timestamp": "12:21 - 19. März 2019", "retweet_count": "0", "favorite_count": "11", "author": "ggreenwald", "is_retweet": true}, {"text": "É verdade que David não é tecnicamente um \"suplente\", mas um deputado federal completo e regular, porque Jean nunca ocupou o cargo. Então sim, ele também usou essa palavra errado.", "timestamp": "10:38 - 19. März 2019", "retweet_count": "1", "favorite_count": "9", "author": "ggreenwald", "is_retweet": true}, {"text": "There were many times I went on CNN & MSNBC & didn't bring up all that they've done to encourage and support imperialism, racist wars, and a wide range of other evils, and don't recall hearing from you about this. Happy to talk more if you really want, Micah - but not on Twitter.", "timestamp": "10:35 - 19. März 2019", "retweet_count": "0", "favorite_count": "27", "author": "ggreenwald", "is_retweet": true}, {"text": "\"Marido,\" não \"companheiro.\"", "timestamp": "10:32 - 19. März 2019", "retweet_count": "20", "favorite_count": "302", "author": "ggreenwald", "is_retweet": true}, {"text": "Fox News é mais um comunista:", "timestamp": "10:28 - 19. März 2019", "retweet_count": "91", "favorite_count": "663", "author": "ggreenwald", "is_retweet": true}, {"text": "Here's the full discussion i had this morning on @WNYC with @BrianLehrer about the Bolsonaro government in general, the real purpose of his trip to Washington, and his family's growing links with paramilitary gangs", "timestamp": "10:22 - 19. März 2019", "retweet_count": "85", "favorite_count": "184", "author": "ggreenwald", "is_retweet": true}, {"text": "Sort of like the way that MSNBC significantly reduced the invitations to appear when my critiques shifted from Bush/Cheney's militarism and civil liberties assaults to Obama's, and then stopped completely when I critiqued the Trump/Russia narrative & MSNBC's role in it?", "timestamp": "10:20 - 19. März 2019", "retweet_count": "0", "favorite_count": "11", "author": "ggreenwald", "is_retweet": true}, {"text": "I've had a substantive discussion with Nathan and many others about those views on this question. I'm happy to engage anyone on it: in constructive venues, not through vapid, strutting Twitter slogans.", "timestamp": "10:18 - 19. März 2019", "retweet_count": "0", "favorite_count": "9", "author": "ggreenwald", "is_retweet": true}, {"text": "Have you? Why is fighting US fascism all that counts to you? I have had serious arguments with Fox hosts on Fox. If you think they're inadequate, please feel free to lead *by example* instead of safe virtuous tweets - 1) https://www.huffpostbrasil.com/2014/06/23/shep-smith-glenn-greenwald-fox-news_n_5523275.html … - 2)", "timestamp": "10:11 - 19. März 2019", "retweet_count": "0", "favorite_count": "39", "author": "ggreenwald", "is_retweet": true}, {"text": "", "timestamp": "10:06 - 19. März 2019", "retweet_count": "0", "favorite_count": "16", "author": "ggreenwald", "is_retweet": true}, {"text": "The idea that appearing on a network that has been the most-watched cable network in the US for two decades \"legitimizes\" it is the stupidest fucking thing I've ever heard, especially when it's used to sabotage actually fascist political leaders.", "timestamp": "10:01 - 19. März 2019", "retweet_count": "3", "favorite_count": "33", "author": "ggreenwald", "is_retweet": true}, {"text": "Maybe media people who live in insulated, safe, homogenized environments and purposely avoid subjecting themselves to any actual risks or provoking dangerous people have a different understanding of what fighting fascism entails than those who actually face such risks?", "timestamp": "09:40 - 19. März 2019", "retweet_count": "115", "favorite_count": "623", "author": "ggreenwald", "is_retweet": true}, {"text": "Oh my god, you're right. She's a blue-check elite now!", "timestamp": "07:35 - 19. März 2019", "retweet_count": "0", "favorite_count": "35", "author": "ggreenwald", "is_retweet": true}, {"text": "The Intercept's loss is the Sanders campaign's gain! @briebriejoy is one of the smartest, most talented, & most interesting voices to arrive on the US political scene in years. So sorry to see her leaving TI but so happy she has the perfect position for her passion & talents:", "timestamp": "07:26 - 19. März 2019", "retweet_count": "607", "favorite_count": "3788", "author": "ggreenwald", "is_retweet": true}, {"text": "Caio Coppola provavelmente vai me parabenizar pela minha nova posição como correspondente internacional da Fox News pela minha participação no programa da Fox ontem à noite, imediatamente antes da entrevista de Bolsonaro.", "timestamp": "06:09 - 19. März 2019", "retweet_count": "464", "favorite_count": "3187", "author": "ggreenwald", "is_retweet": true}, {"text": "Last night, Brazil's Jair Bolsonaro, in DC to meet today with Trump, gave his first-ever interview on Fox News, to @ShannonBream. I appreciate being able to go on shortly before him and provide some critical facts about his presidency that would have otherwise not been heard:", "timestamp": "05:56 - 19. März 2019", "retweet_count": "248", "favorite_count": "1183", "author": "ggreenwald", "is_retweet": true}, {"text": "Mission Accomplished™ from the Brave Men and Women Who Keep Our Nation Safe™. The endless fixation on Russia hasn't resulted in any indictments of Americans charged with conspiring with them over the election, but at least it helped bring about this:", "timestamp": "05:52 - 19. März 2019", "retweet_count": "226", "favorite_count": "642", "author": "ggreenwald", "is_retweet": true}, {"text": "Here's the video tonight, live on Fox, for your small number of fans, talking about Bolsonaro's links to paramilitary gangs just a few moments before Captião himself appeared. Enjoy ", "timestamp": "22:17 - 18. März 2019", "retweet_count": "391", "favorite_count": "1717", "author": "ggreenwald", "is_retweet": true}, {"text": "I go to the US every six to eight weeks or so. I was just there two months ago. What a weird way to show fear of extradition - to constantly travel back to the country you're supposedly petrified of being extradited to. Brilliant:", "timestamp": "22:14 - 18. März 2019", "retweet_count": "6", "favorite_count": "175", "author": "ggreenwald", "is_retweet": true}, {"text": "Do you think Mueller might be compromised?", "timestamp": "21:09 - 18. März 2019", "retweet_count": "1", "favorite_count": "6", "author": "ggreenwald", "is_retweet": true}, {"text": "Why did Flávio Bolsonaro employ the mother and wife of one of the worst miliciano chiefs in Brazil - a fugitive for murders - for a full decade?", "timestamp": "20:49 - 18. März 2019", "retweet_count": "2", "favorite_count": "23", "author": "ggreenwald", "is_retweet": true}, {"text": "If Aaron can't figure out how something helps the Dem Party, his brain literally can't acknowledge its existence, let alone understand it. \"A fascist with ties to paramilitary ties runs a major country & is about to go to the White House? Boring. What about Pelosi's shades?!!?!", "timestamp": "20:32 - 18. März 2019", "retweet_count": "4", "favorite_count": "62", "author": "ggreenwald", "is_retweet": true}, {"text": "Bolsonaro was about to be on Fox in 20 minutes, his first-ever interview there. Not just millions of Americans but *many* Brazilians were watching. I think exposing Bolsonaro as the murderous thug he is is worthwhile. You don't because you're a jingoistic Democratic Party hack.", "timestamp": "20:30 - 18. März 2019", "retweet_count": "14", "favorite_count": "149", "author": "ggreenwald", "is_retweet": true}, {"text": "It's not healthy to fantasize that you speak for \"most\" people. Also:", "timestamp": "20:24 - 18. März 2019", "retweet_count": "8", "favorite_count": "171", "author": "ggreenwald", "is_retweet": true}, {"text": "It's because his job is to smear critics of the Democratic Party and he omits and distorts anything that doesn't achieve that singular aim.", "timestamp": "20:18 - 18. März 2019", "retweet_count": "10", "favorite_count": "105", "author": "ggreenwald", "is_retweet": true}, {"text": "The Vox boy whose creepy, rather sad job is to take pictures of the TV when I'm on it and post the pictures to Twitter was very active in doing this tonight, but for some odd reason omitted that part. You can watch our full video report on Bolsonaro here:", "timestamp": "19:53 - 18. März 2019", "retweet_count": "204", "favorite_count": "1283", "author": "ggreenwald", "is_retweet": true}, {"text": "Having the ugly, incriminating truth heard about Bolsonaro by millions of people immediately before he appeared for his own interview on Fox - and on the even of his meeting with Trump - seemed a very worthwhile & productive thing to do. I'm glad I had that opportunity.", "timestamp": "19:51 - 18. März 2019", "retweet_count": "326", "favorite_count": "2630", "author": "ggreenwald", "is_retweet": true}, {"text": "I did indeed, as this angry pro-Bolsonaro gentleman points out, go on Fox News tonight in order - right before Bolsonaro's own interview on Fox - to describe all the highly incriminating evidence linking him & his family to Brazil's most murderous militias https://theintercept.com/2019/03/18/jair-bolsonaro-family-militias-gangs-brazil/ …", "timestamp": "19:49 - 18. März 2019", "retweet_count": "967", "favorite_count": "4444", "author": "ggreenwald", "is_retweet": true}, {"text": "O vídeo completo está aqui:", "timestamp": "19:09 - 18. März 2019", "retweet_count": "8", "favorite_count": "17", "author": "ggreenwald", "is_retweet": true}, {"text": "The Miami Herald has been doing exceptional investigative reporting into the Jeffrey Epstein case, and these questions and key points from @jkbjournalist illustrate the intrepid mentality that has been driving it. Impressive and important work. This whole thread is worth reading:", "timestamp": "18:40 - 18. März 2019", "retweet_count": "121", "favorite_count": "285", "author": "ggreenwald", "is_retweet": true}, {"text": "Yes, they are.", "timestamp": "17:40 - 18. März 2019", "retweet_count": "3", "favorite_count": "22", "author": "ggreenwald", "is_retweet": true}, {"text": "MSNBC and Media Matters will air literally any conspiracy and speculation without the slightest concern for whether it's true as long as it provides them some short-term petty advantage in their banal daily partisan battles.", "timestamp": "17:32 - 18. März 2019", "retweet_count": "84", "favorite_count": "342", "author": "ggreenwald", "is_retweet": true}, {"text": "On the left: Media Matters & MSNBC last month disseminate the conspiratorial, baseless bullshit that Bezos' texts were illicitly obtained by \"politically motivated\" govt agencies (Trump). On the right: WSJ today confirms NatlEnq got them because Bezos' mistress' brother sold them", "timestamp": "17:29 - 18. März 2019", "retweet_count": "102", "favorite_count": "263", "author": "ggreenwald", "is_retweet": true}, {"text": "In Brazil, Bolsonaro has avoided answering these questions: why did his son employ the mother & wife of the chief of Rio's most murderous gang? What are his connections to Marielle Franco's assassins? @ShannonBream should ask this if it's a real interview", "timestamp": "14:55 - 18. März 2019", "retweet_count": "139", "favorite_count": "437", "author": "ggreenwald", "is_retweet": true}, {"text": "Fox News's @ShannonBream tonight is interviewing Brazil's President Jair Bolsonaro. We wrote to the producers of the show urging them to ask him about the stunning links recently revealed between him and his family and Brazil's most murderous paramilitary gangs.", "timestamp": "14:53 - 18. März 2019", "retweet_count": "265", "favorite_count": "1037", "author": "ggreenwald", "is_retweet": true}, {"text": "It was really sweet. Just a few short years after Cheney invaded & destroyed a country of 26 million (which Biden voted to authorize), tortured people systematically & spied without warrants, Biden playfully praised him at the unveiling of his bust. Don't be too proud to tear up:", "timestamp": "13:20 - 18. März 2019", "retweet_count": "515", "favorite_count": "1490", "author": "ggreenwald", "is_retweet": true}, {"text": "In 2015, Joe Biden attended a ceremony at Capitol Hill honoring Dick Cheney: \"I actually like Dick Cheney.… I can say without fear of contradiction, there’s never one single time been a harsh word, not one single time in our entire relationship.\"", "timestamp": "13:16 - 18. März 2019", "retweet_count": "814", "favorite_count": "1786", "author": "ggreenwald", "is_retweet": true}, {"text": "\"I just posted about Trump being Orange, made a mean tweet about Ben Norton, and drew a cartoon about Mitch McConnell, and now I'm going to mock people taking actual risks for being insulated and living coddled lives.\" Their cowardice is exceeded only by their desperation.", "timestamp": "13:10 - 18. März 2019", "retweet_count": "10", "favorite_count": "86", "author": "ggreenwald", "is_retweet": true}, {"text": "It's long been like this. People like those liberal journalists insulated in Brooklyn know they won't take real risks to confront reactionary forces & dangerous fascism, so they hate those who do & try to reverse the scenario. It's psychological self-defense: not political.", "timestamp": "13:08 - 18. März 2019", "retweet_count": "14", "favorite_count": "70", "author": "ggreenwald", "is_retweet": true}, {"text": "Last year, our best friend's head was blown off by militia assassins. Last month, the LGBT Congressman from the same party fled under death threats. The police said the same assassins monitored David &  left-wing journalists (ahem). But they're the real anti-fascist warriors.", "timestamp": "13:06 - 18. März 2019", "retweet_count": "44", "favorite_count": "231", "author": "ggreenwald", "is_retweet": true}, {"text": "She's the one who stepped out of all class and race lines by speaking critically to Chelsea Clinton and, ever since, has been the target of a grotesque shaming campaign.", "timestamp": "13:00 - 18. März 2019", "retweet_count": "4", "favorite_count": "132", "author": "ggreenwald", "is_retweet": true}, {"text": "It's the Kyler Murray story all over again. @vivafalastin seems eager to engage & apologize & that's great and her own choice. But a world in which people are stuck to & judged by things they say when they're 14 - still a child - is warped. And in this case, it's just vindictive.", "timestamp": "12:59 - 18. März 2019", "retweet_count": "51", "favorite_count": "499", "author": "ggreenwald", "is_retweet": true}, {"text": "When a young political activist - 20 years old - is having to apologize because she offended a very powerful person and that powerful person's servants dug up dumb tweets she posted when she was **14 years old**, the world has gone very wrong:", "timestamp": "12:57 - 18. März 2019", "retweet_count": "494", "favorite_count": "2515", "author": "ggreenwald", "is_retweet": true}, {"text": "Thanks, Rania - we feel an obligation to use our platform for the country's future, especially since it belongs to our kids & Brazil has so much untapped potential. Certain insulated US liberal journalists free of all risk (on purpose) see it as a luxury & themselves as warriors.", "timestamp": "12:09 - 18. März 2019", "retweet_count": "30", "favorite_count": "269", "author": "ggreenwald", "is_retweet": true}, {"text": "During the Snowden reporting, I was repeatedly told/warned that CIA's largest permanent presence is in Brazil (due to Cold War roots when CIA helped overthrow Brazil's democratically elected government & then propped up the resulting military regime). It's worse now:", "timestamp": "12:01 - 18. März 2019", "retweet_count": "725", "favorite_count": "1504", "author": "ggreenwald", "is_retweet": true}, {"text": "Let's say it for the 10,000th time, but certainly not the last: if you endorse and ratify the principle that certain ideas should be prohibited and those who express them should be punished, that power will be used *against* the marginalized, not to protect them:", "timestamp": "10:48 - 18. März 2019", "retweet_count": "334", "favorite_count": "940", "author": "ggreenwald", "is_retweet": true}, {"text": "Here's the start of our video report on Bolsonaro as he meets Trump tomorrow with the key context: he & his family have been exposed as having multiple, close ties to Brazil's most violent paramilitary gangs. Full video here https://theintercept.com/2019/03/18/jair-bolsonaro-family-militias-gangs-brazil/ … pic.twitter.com/48VJYo3R9t", "timestamp": "10:30 - 18. März 2019", "retweet_count": "79", "favorite_count": "134", "author": "ggreenwald", "is_retweet": true}, {"text": "Despite the obvious risks, Edward @Snowden - with his characteristic bravery and principle - has repeatedly and publicly denounced repressive measures by the Russian government, including (but not only) attempts to censor the internet https://www.theguardian.com/us-news/2018/jun/29/edward-snowden-describes-russian-government-as-corrupt …", "timestamp": "09:12 - 18. März 2019", "retweet_count": "73", "favorite_count": "221", "author": "ggreenwald", "is_retweet": true}, {"text": "VIDEO: As Brazil's Jair Bolsonaro prepares to meet Trump, new information about his family's ties to the country's worst paramilitary gangs draws scrutiny and outrage https://interc.pt/2OaUMQG ", "timestamp": "08:57 - 18. März 2019", "retweet_count": "243", "favorite_count": "544", "author": "ggreenwald", "is_retweet": true}, {"text": "That's what Obama said when he gave Bill O'Reilly an incredibly valuable & highly legitimizing exclusive during the Super Bowl. It's what Obama, Hillary & Bernie all said about why they went on as candidates. It's what Adam Schiff said when he went on Tucker, etc.", "timestamp": "08:45 - 18. März 2019", "retweet_count": "10", "favorite_count": "84", "author": "ggreenwald", "is_retweet": true}, {"text": "Fox News announces that long-time Democratic operative & former DNC Chair @DonnaBrazile has joined the network as a Fox News contributor. Here's her explanation for why she's doing that https://variety.com/2019/tv/news/donna-brazile-joins-fox-news-as-contributor-1203165558/ … (via @ErikWemple)", "timestamp": "08:44 - 18. März 2019", "retweet_count": "157", "favorite_count": "341", "author": "ggreenwald", "is_retweet": true}, {"text": "Exactly the time that David Ignatius, Tom Friedman and various Silicon Valley geniuses were heralding MBS as a brave and noble reformer:", "timestamp": "08:39 - 18. März 2019", "retweet_count": "85", "favorite_count": "274", "author": "ggreenwald", "is_retweet": true}, {"text": "Seems confusing when it's OK to impugn the integrity of a combat veteran & when it isn't. As is true of the Dem Party's rules for identity politics - as reflected by the vicious attacks on the young Muslim woman who spoke irreverently to Chelsea Clinton- the rules seem arbitrary.", "timestamp": "07:26 - 18. März 2019", "retweet_count": "173", "favorite_count": "743", "author": "ggreenwald", "is_retweet": true}, {"text": "Right. I think one recent, instructive example was the NY Governor's race. From Twitter, one would have thought Andrew Cuomo was the world's most hated figure. Then he - again - cruised easily to re-election against an opponent who got a lot of media play.", "timestamp": "07:12 - 18. März 2019", "retweet_count": "1", "favorite_count": "7", "author": "ggreenwald", "is_retweet": true}, {"text": "I think it's pretty common for out-of-the-party-mainstream members of Congress to end up being discussed among the political class. Michele Bachmann certainly was, and did well in polling for awhile. Other members of Congress have made decent presidential runs. Still very early.", "timestamp": "07:11 - 18. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "ggreenwald", "is_retweet": true}, {"text": "That said, I think this \"Twitter-is-distortive\" point can be overstated. It's unsurprising people who are super politically engaged (those on political Twitter) have stronger views & are more polarized than those who aren't. But they may just be ahead of the curve, not wildly off", "timestamp": "07:09 - 18. März 2019", "retweet_count": "1", "favorite_count": "8", "author": "ggreenwald", "is_retweet": true}, {"text": "No, I totally agree. I think there's a second-tier of candidates - which includes Senators like Klobachur & Gillibrand and definitely Tulsi & \"Mayor Pete\" - who have way less name-recognition. I just meant that, even there, Twitter sentiment is not reflective of broader sentiment", "timestamp": "07:08 - 18. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "ggreenwald", "is_retweet": true}, {"text": "Does the same observation apply to Bernie and Tulsi? Is Twitter contempt for them among establishment/centrist Dem pundits and online activists reflected in undecided voters and those who attend their events?", "timestamp": "06:51 - 18. März 2019", "retweet_count": "24", "favorite_count": "287", "author": "ggreenwald", "is_retweet": true}, {"text": "That would be a cool and unconventional First Spouse (obviously not intended to be an endorsement of his husband, etc. etc.).", "timestamp": "05:51 - 18. März 2019", "retweet_count": "5", "favorite_count": "54", "author": "ggreenwald", "is_retweet": true}, {"text": "They have the largest nuclear stockpile in the world other than the US, with thousands of nuclear-tipped missiles pointed at US cities. That's why the BAS doomsday clock specifically warns of US/Russia nuclear tensions as a threat to humanity. Is that a good enough reason?", "timestamp": "04:47 - 18. März 2019", "retweet_count": "7", "favorite_count": "101", "author": "ggreenwald", "is_retweet": true}, {"text": "The Bulletin of Atomic Scientists' doomsday clock is at 2 minutes before midnight. By far its two greatest threats to *humanity's existence* are climate change & US/Russia nuclear war. Yes, how crazy and treasonous to want to avoid ratcheting up tensions:", "timestamp": "04:36 - 18. März 2019", "retweet_count": "146", "favorite_count": "539", "author": "ggreenwald", "is_retweet": true}, {"text": "It's not surprising that former members of the NSA and intelligence community - like the poster below - mock those who want better relations with Moscow as treasonous weaklings. That's what they've always done. What's most amazing is that this is now standard liberal dogma:", "timestamp": "04:33 - 18. März 2019", "retweet_count": "458", "favorite_count": "1424", "author": "ggreenwald", "is_retweet": true}, {"text": "OK, thanks, I'll seek out Cindy. But since you work with her, you'll probably talk to her first, so I'd be grateful if you could let her know that EFF would be an ideal partner to take on this archive work that some are angry TI can't do any longer. EFF would be perfect for it.", "timestamp": "13:15 - 17. März 2019", "retweet_count": "0", "favorite_count": "10", "author": "ggreenwald", "is_retweet": true}, {"text": "Oh, OK. Wanting this work done seemed really important to you and you have a very high and important position at EFF, especially when it comes to the archive, so I thought making publicly clear to you that EFF could do this work would be of interest to you. But I'll try Cindy.", "timestamp": "12:56 - 17. März 2019", "retweet_count": "0", "favorite_count": "5", "author": "ggreenwald", "is_retweet": true}, {"text": "\"Fabricando\"", "timestamp": "10:24 - 17. März 2019", "retweet_count": "19", "favorite_count": "132", "author": "ggreenwald", "is_retweet": true}, {"text": "Yes, and his first trip to the US as President.", "timestamp": "10:17 - 17. März 2019", "retweet_count": "1", "favorite_count": "13", "author": "ggreenwald", "is_retweet": true}, {"text": "Why do you support Hitler, Pol Pot, neo-Nazi groups and Kim Jong-un? Just wondering?", "timestamp": "10:15 - 17. März 2019", "retweet_count": "0", "favorite_count": "8", "author": "ggreenwald", "is_retweet": true}, {"text": "In honor of Bolsonaro's trip this week to Washington to meet Trump, we'll have a detailed investigation tomorrow - in both English and Portuguese - of how extensive, personal and dark are the ties between the Bolsonaro family & Brazil's most violent paramilitary criminal gangs", "timestamp": "10:14 - 17. März 2019", "retweet_count": "204", "favorite_count": "642", "author": "ggreenwald", "is_retweet": true}, {"text": "It's beyond creepy how submissive & self-degrading the Bolsonaros are regarding the US. Bolsonaro *saluted* not just the US flag but also John Bolton. His son is in the US calling undocumented Brazilian immigrants an \"embarrassment\" & justifying US visa requirements for Brazil:", "timestamp": "10:07 - 17. März 2019", "retweet_count": "329", "favorite_count": "827", "author": "ggreenwald", "is_retweet": true}, {"text": "I wasn't being sarcastic.", "timestamp": "09:06 - 17. März 2019", "retweet_count": "0", "favorite_count": "6", "author": "ggreenwald", "is_retweet": true}, {"text": "Which candidates have called for Chelsea's release from prison or, for that matter, called for her release or even defended her the first time around? I honestly don't know of a single one. I'm not \"stanning\" for any candidate.", "timestamp": "09:05 - 17. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "ggreenwald", "is_retweet": true}, {"text": "That's part of what I was referring to in the first part of this tweet from earlier this week. But all of the candidates - all of them - have \"disturbing\" or \"troubling\" things they've said and that they believe. I just find his discourse interesting:", "timestamp": "08:41 - 17. März 2019", "retweet_count": "0", "favorite_count": "7", "author": "ggreenwald", "is_retweet": true}, {"text": "I agree there's a lot to be filled in with him, and that question is the key one. All I'm saying is that he's not invoking the trite DLC centrist script about how we should be neither left nor right. It's more complex, substantive & thoughtful than that. But we'll see.", "timestamp": "08:37 - 17. März 2019", "retweet_count": "2", "favorite_count": "93", "author": "ggreenwald", "is_retweet": true}, {"text": "Many are going to misinterpret @PeteButtigieg's label talk like it's some sort of warmed-over, 1990s centrist DLC tripe about how ideology doesn't matter. It's not that. He's saying the meaning of \"left\" and \"right\" has changed & is so archaic & ambiguous that they don't clarify:", "timestamp": "08:33 - 17. März 2019", "retweet_count": "120", "favorite_count": "723", "author": "ggreenwald", "is_retweet": true}, {"text": "He's spoken for himself many times on that question, including very recently and publicly, so there's no need to speculate about it. But either way, your speculation is quite wrong.", "timestamp": "07:44 - 17. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "ggreenwald", "is_retweet": true}, {"text": "Since my name was somehow dragged into this thread: i hope you're feeling better and are recovering well.", "timestamp": "07:43 - 17. März 2019", "retweet_count": "3", "favorite_count": "32", "author": "ggreenwald", "is_retweet": true}, {"text": "The creation, rapid growth & influence of @TheInterceptBr at exactly the time this type of journalism is most needed in Brazil - the Bolsonaro era - is expertly profiled here by @_brenocosta_. It's driven by a courageous & tireless team of journalists", "timestamp": "07:35 - 17. März 2019", "retweet_count": "34", "favorite_count": "133", "author": "ggreenwald", "is_retweet": true}, {"text": "If @EFF would like to take on the responsibility of providing the archive with the extensive security it requires and having a team of experts curate and publish it in accordance with our source's principles, let me know. That'd be great. So far it hasn't, but email me about it.", "timestamp": "07:27 - 17. März 2019", "retweet_count": "0", "favorite_count": "10", "author": "ggreenwald", "is_retweet": true}, {"text": "Yeah, I agree with all of that, & what I particularly appreciate is her recognition of the need to construct arguments and compile convincing rationale - and her great skill in doing so - as opposed to just strutting around pronouncing the virtuous conclusion & expecting applause", "timestamp": "07:15 - 17. März 2019", "retweet_count": "0", "favorite_count": "9", "author": "ggreenwald", "is_retweet": true}, {"text": "Yeah, I agree. The Vice article is way too short and somewhat vapid to do justice to her content. I just cited it to avoid the appearance that I thought I was the first one to find her and it does provide some interesting insights on her strategy of discourse.", "timestamp": "06:53 - 17. März 2019", "retweet_count": "0", "favorite_count": "9", "author": "ggreenwald", "is_retweet": true}, {"text": "I only recently discovered it from someone's recommendation & find it amazing. Anyone on the right of anything will disagree with her core premises but it's all free of reflexive sanctimony & dogma & will challenge your beliefs in the smartest way possible", "timestamp": "06:49 - 17. März 2019", "retweet_count": "39", "favorite_count": "357", "author": "ggreenwald", "is_retweet": true}, {"text": "If you want to watch a very smart, compelling, thoughtful, creative and provocative discussion of various cultural debates surrounding sexuality, gender and discourse, watch Natalie Wynn's @ContraPoints' YouTube show", "timestamp": "06:47 - 17. März 2019", "retweet_count": "115", "favorite_count": "757", "author": "ggreenwald", "is_retweet": true}, {"text": "I think there's a big difference between an actual war reporter who has spent 2 decades risking his life to travel to the most dangerous area to expose US imperialism & someone who takes pictures of the TV. And I said Aaron uses screenshots when he wants to lie about content.", "timestamp": "05:31 - 17. März 2019", "retweet_count": "0", "favorite_count": "21", "author": "ggreenwald", "is_retweet": true}, {"text": "All of this is true about the comparison of Bolsonaro and Trump. But note that the common foreign policy Brazil's President will be in Washington to discuss on Wednesday with Trump - engineering regime change in Venezuela - is one supported by the leaders of both US parties:", "timestamp": "05:23 - 17. März 2019", "retweet_count": "128", "favorite_count": "324", "author": "ggreenwald", "is_retweet": true}, {"text": "Many of us are creeped out, still, by that time you recently called @JeremyScahill - a 40-something father of two who has spent the last two decades reporting from the world's most dangerous war zones - a \"boy.\" Now that was \"gross.\"", "timestamp": "05:17 - 17. März 2019", "retweet_count": "2", "favorite_count": "33", "author": "ggreenwald", "is_retweet": true}, {"text": "Exactly: I became awful to you in 2009: the year Obama was inaugurated, and my criticisms of Bush/Cheney's civil liberties assaults & militarism shifted to Obama's civil liberties assaults and militarism. That's when your views of me shifted because you're only a partisan hack.", "timestamp": "11:23 - 16. März 2019", "retweet_count": "9", "favorite_count": "69", "author": "ggreenwald", "is_retweet": true}, {"text": "The embarrassingly gushing praise Eric heaped on my work when I was criticizing Bush & Cheney - almost like he bases his \"media criticisms\" about journalists on what partisan agenda they're serving at the moment rather than any actual beliefs or principles https://www.salon.com/2009/05/19/eric_boehlert/ …", "timestamp": "11:16 - 16. März 2019", "retweet_count": "7", "favorite_count": "37", "author": "ggreenwald", "is_retweet": true}, {"text": "That Brazil and the US are remotely comparable in terms of these risks, or that Bolsonaro and Trump are remotely similar in that regard, is steeped in wholesale jingoistic ignorance. And the premise of your claim is obviously false, as these words prove:", "timestamp": "11:11 - 16. März 2019", "retweet_count": "0", "favorite_count": "9", "author": "ggreenwald", "is_retweet": true}, {"text": "All religions and groups of non-religious people have individuals in them who hate LGBTs, but the idea that all or most Muslims want to hang LGBTs is moronic. Polling shows several groups with more virulently anti-LGBT attitudes in the US than Muslims https://theintercept.com/2016/06/13/stop-exploiting-lgbt-issues-to-demonize-islam-and-justify-anti-muslim-policies/ …", "timestamp": "11:05 - 16. März 2019", "retweet_count": "2", "favorite_count": "9", "author": "ggreenwald", "is_retweet": true}, {"text": "He ran a full-on, undiluted anti-Muslim hate site for a decade. Every time a Muslim did something bad, he'd create a post ironically entitled \"Religion of Peace\" with a link. The whole site was devoted to generating hatred for Muslims. Then he became a Dem & all was forgotten.", "timestamp": "11:02 - 16. März 2019", "retweet_count": "57", "favorite_count": "472", "author": "ggreenwald", "is_retweet": true}, {"text": "The idea that \"Muslims\" want to hang and kill gay people is too disgusting and ignorant for any human being with a functioning brain to believe. Read about this:", "timestamp": "10:52 - 16. März 2019", "retweet_count": "3", "favorite_count": "12", "author": "ggreenwald", "is_retweet": true}, {"text": "There are specific policy views expressed by @PeteButtigieg I disagree with, but have been very impressed by him from the moment I began paying attention. I couldn't put my finger on why. Part of it was his heterodox thinking. But now I see the crux: he only speaks authentically:", "timestamp": "10:47 - 16. März 2019", "retweet_count": "79", "favorite_count": "484", "author": "ggreenwald", "is_retweet": true}, {"text": "If I spent my days tweeting about Rania Khalek & Ben Norton, \"investigating\" Jill Stein, or drawing cartoons of Paul Ryan, & if my husband weren't a Congressman in the same party as Marielle & Jean, we also wouldn't need guards, gates & armor. Their ignorance = their cowardice.", "timestamp": "10:38 - 16. März 2019", "retweet_count": "37", "favorite_count": "241", "author": "ggreenwald", "is_retweet": true}, {"text": "Some insulated, risk-free liberal journalists in the US who have never been forced to use measures like this & others to protect yourself and your family from real, proven threats of actual fascism ignorantly think these are signs of comfort & luxury. They live in a bubble.", "timestamp": "10:34 - 16. März 2019", "retweet_count": "64", "favorite_count": "230", "author": "ggreenwald", "is_retweet": true}, {"text": "The tweet contained a full video. Had he linked to it - which he could have easily done since he follows me - everyone could have heard the video and perfectly understood the point I was making. He didn't want that. He wanted to lie about what I said. So he screenshot the video.", "timestamp": "09:26 - 16. März 2019", "retweet_count": "0", "favorite_count": "8", "author": "ggreenwald", "is_retweet": true}, {"text": "Fair enough. It's not the first time I (and others) have noted it. But I'm happy to reply. Everyone with a public platform is fair game. And sometimes screenshots are necessary. But he uses them in lieu of links & video on purpose so he can create distortions nobody can check.", "timestamp": "09:21 - 16. März 2019", "retweet_count": "5", "favorite_count": "56", "author": "ggreenwald", "is_retweet": true}, {"text": "Here's another. You'll have to suffice with two for now, though if you're as interested as you are claiming to be, they're very easy to find. Many of those he lies about and smears have noted it", "timestamp": "09:14 - 16. März 2019", "retweet_count": "16", "favorite_count": "103", "author": "ggreenwald", "is_retweet": true}, {"text": "Exactly. They think fighting fascism means posting mean tweets about Mitch McConnell or drawing cartoons mocking Trump to the applause of liberals, while living in complete ignorance of what real dangers and risks are & thus mistake miserable security measures for fun luxuries.", "timestamp": "09:11 - 16. März 2019", "retweet_count": "8", "favorite_count": "64", "author": "ggreenwald", "is_retweet": true}, {"text": "How many would you like? You can start here from this morning https://twitter.com/atrupar/status/1106921175240855552 … - let me know if you'd like more.", "timestamp": "09:07 - 16. März 2019", "retweet_count": "11", "favorite_count": "101", "author": "ggreenwald", "is_retweet": true}, {"text": "Ah, sorry - I thought it was a criticism. Thanks.", "timestamp": "08:06 - 16. März 2019", "retweet_count": "0", "favorite_count": "5", "author": "ggreenwald", "is_retweet": true}, {"text": "I know this can be hard for some insulated risk-free liberal journalists in the US to understand, but prominent LGBTs, leftists, and other minorities who aggressively oppose Bolsonaro face real security risks. Security measures are unpleasant & repressive, not luxuries.", "timestamp": "08:00 - 16. März 2019", "retweet_count": "70", "favorite_count": "448", "author": "ggreenwald", "is_retweet": true}, {"text": "Jean Wyllys is the LGBT Congressman who fled Brazil last month under serious death threats. He's from the same party as Marielle, assassinated in March. Bolsonaro supporters have continued to harass him Europe, including Brazil's UN ambassador yesterday", "timestamp": "07:57 - 16. März 2019", "retweet_count": "182", "favorite_count": "587", "author": "ggreenwald", "is_retweet": true}, {"text": "Vox really does employ a boy whose job is to take TV screen shots of any critics of the Democratic Party and then post them to Twitter in the exact way that most blatantly distorts what they say. It's always screenshots - never links or videos - to enable the lies to thrive.", "timestamp": "07:50 - 16. März 2019", "retweet_count": "351", "favorite_count": "1313", "author": "ggreenwald", "is_retweet": true}, {"text": "Who are the \"right ones\"? The ones who agree with you? How am I supposed to be able to divine the \"right ones\" to address and the \"wrong ones\" to ignore?", "timestamp": "07:39 - 16. März 2019", "retweet_count": "0", "favorite_count": "5", "author": "ggreenwald", "is_retweet": true}, {"text": "I was raised by a single mother who worked as a cashier at McDonald's and as a part-time defensive driving instructor for people who got traffic tickets. I went to George Washington Univ. because I got a debate team scholarship and then NYU Law School entirely on student loans.", "timestamp": "07:35 - 16. März 2019", "retweet_count": "1", "favorite_count": "18", "author": "ggreenwald", "is_retweet": true}, {"text": "I'm sorry your attention span is devastating short, but the  thread I posted was based on the words of the activist herself, which I cited. In other words, I did the opposite of what you claimed: I linked to her own words rather than spoke for her", "timestamp": "07:18 - 16. März 2019", "retweet_count": "5", "favorite_count": "53", "author": "ggreenwald", "is_retweet": true}, {"text": "Class loyalty among elites is extremely strong and vicious, especially when perceived rabble step out of line. I'm surprised no candlelight vigils or GoFundMe campaigns have been scheduled yet for Chelsea. She'll be OK.", "timestamp": "07:12 - 16. März 2019", "retweet_count": "400", "favorite_count": "1363", "author": "ggreenwald", "is_retweet": true}, {"text": "Finally, if you have a large & influential platform, there are probably better uses for it than defending one of the richest & most privileged dynastic princesses who has repeatedly been lavished with unearned wealth & power. She was criticized,not injured", "timestamp": "07:10 - 16. März 2019", "retweet_count": "672", "favorite_count": "2200", "author": "ggreenwald", "is_retweet": true}, {"text": "Obviously, those young activists' point wasn't that Chelsea was literally the cause of the massacre, but that her families' vehement pro-Israel politics, along with the role she bizarrely played in attacking Omar, made her a bad choice. In her own words:", "timestamp": "07:07 - 16. März 2019", "retweet_count": "280", "favorite_count": "924", "author": "ggreenwald", "is_retweet": true}, {"text": "While Donald Trump Jr. reasonably argues in his valiant defense of @ChelseaClinton that she's not to blame for the New Zealand massacre, it's certainly understandable why young Muslim activists found her presence alienating, for reasons I discussed 2 weeks ago on @democracynow:", "timestamp": "07:03 - 16. März 2019", "retweet_count": "639", "favorite_count": "1966", "author": "ggreenwald", "is_retweet": true}, {"text": "Que @FlavioBolsonaro, por uma década inteira, manteve a mãe e a esposa de um chefe de milícia em sua folha pagamento, ainda não recebeu nem de perto a atenção que isso merecia. Estamos trabalhando em um projeto para corrigir esse problema, no Brasil e o mundo, Vai saber. Aguardem", "timestamp": "19:06 - 15. März 2019", "retweet_count": "713", "favorite_count": "4033", "author": "ggreenwald", "is_retweet": true}, {"text": "- Senator Klobuchar, many of your staff members, including professional women who have worked for many tough bosses, have complained that you were abusive, degrading and demeaning to your employees. What's your response?\n\n- PUTIN!!!!", "timestamp": "09:08 - 15. März 2019", "retweet_count": "189", "favorite_count": "1095", "author": "ggreenwald", "is_retweet": true}]