[{"text": "Kirsten Gillibrand wants to stop doctors from prescribing more than seven days of opioids for acute pain, even when it is medically appropriate. Yet she says her bill \"is not intended to interfere with these decisions.\"", "timestamp": "12:26 - 22. März 2019", "retweet_count": "6", "favorite_count": "18", "author": "jacobsullum", "is_retweet": true}, {"text": "Houston Police Chief Art Acevedo wants credit for not covering up the false search warrant affidavit that led to a deadly drug raid: \"This police chief is the one that asked the tough questions.\"", "timestamp": "15:15 - 21. März 2019", "retweet_count": "7", "favorite_count": "27", "author": "jacobsullum", "is_retweet": true}, {"text": "The model American gun controllers think we should follow: New Zealand is banning \"military-style semi-automatic weapons\" and redefining them to include most firearms with detachable magazines.", "timestamp": "11:46 - 21. März 2019", "retweet_count": "2", "favorite_count": "1", "author": "jacobsullum", "is_retweet": true}, {"text": "George Conway's spat with Donald Trump illustrates psychiatry's pernicious influence on the debate about the president's fitness, which features critics who present their moral and political judgments as scientific conclusions.", "timestamp": "11:30 - 20. März 2019", "retweet_count": "7", "favorite_count": "23", "author": "jacobsullum", "is_retweet": true}, {"text": "I have no idea where he gets the idea that any impact on initiation of \"tobacco product\" use must be \"overweight[ed].\" (3/3)", "timestamp": "08:05 - 20. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "jacobsullum", "is_retweet": true}, {"text": "That includes \"the increased or decreased likelihood that those who do not use tobacco products will start using such products.\" Presumably that is what Gottlieb means by \"youth initiation.\" (2/3)", "timestamp": "08:03 - 20. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "jacobsullum", "is_retweet": true}, {"text": "The standard says nothing about \"youth initiation\" per se, but it does say the FDA should consider the impact on \"the health of the population as a whole taking into account both users of tobacco products and persons who do not currently use tobacco products.\" (1/3)", "timestamp": "08:02 - 20. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "jacobsullum", "is_retweet": true}, {"text": "Donald Trump is not the first president to steal the power of the purse or use the military however he likes. But he is first to provoke the sort of congressional rebuke we saw last week.", "timestamp": "06:16 - 20. März 2019", "retweet_count": "13", "favorite_count": "25", "author": "jacobsullum", "is_retweet": true}, {"text": "\"Devin Nunes’ Mom falsely accused Nunes of frequenting prostitutes and doing cocaine.\" I guess they had a falling-out.", "timestamp": "14:32 - 19. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "jacobsullum", "is_retweet": true}, {"text": "Cory Booker knocks Kamala Harris and Bernie Sanders for joking about marijuana, noting the serious, long-lasting consequences of pot busts.", "timestamp": "12:30 - 19. März 2019", "retweet_count": "6", "favorite_count": "9", "author": "jacobsullum", "is_retweet": true}, {"text": "Trump, who cares about freedom of speech only when he is speaking, keeps wondering why people are allowed to make fun of him on TV.", "timestamp": "10:55 - 18. März 2019", "retweet_count": "19", "favorite_count": "61", "author": "jacobsullum", "is_retweet": true}, {"text": "Wilbur Ross repeatedly and brazenly misled Congress about the reason for adding a citizenship question to the census. His defense: He did not do it on purpose.", "timestamp": "12:51 - 15. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "jacobsullum", "is_retweet": true}]