[{"text": "If you want to freak out over “foreign influence”, 501(c)4s should be the target. Their secret donors can easily be foreign. & don’t even get me started on AIPAC. The hypocrisy of the Russia hysteria is maddening considering how open the influence is from other foreign countries", "timestamp": "16:49 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "JenBriney", "is_retweet": true}, {"text": " That lie and so many others were spread by domestic media and shady dark money organizations. $100,000 compared with BILLIONS spent by PACs, SuperPACs, 501(4)s, etc. Clearly, the hysteria has misinformed though based on these comments", "timestamp": "16:46 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "JenBriney", "is_retweet": true}, {"text": "And if you want a detailed history of the hysteria - the reckless “journalism” and claims by Democratic members of Congress- you must read this chapter of @mtaibbi’s new book:", "timestamp": "16:08 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "JenBriney", "is_retweet": true}, {"text": "Russians spent about $100,000 on Facebook ads (compared with hundreds of millions spent by the campaigns & PACs). They MIGHT have stolen emails. That’s it. That is not some grave threat to our democracy & Trump hasn’t been proven to have been a part of any of it", "timestamp": "16:03 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "JenBriney", "is_retweet": true}, {"text": "I went to two all inclusive hotels in Cancun and there were kids EVERYWHERE. I felt totally safe and would bring my tiny loved ones there without hesitation", "timestamp": "13:37 - 23. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "JenBriney", "is_retweet": true}, {"text": "I’m so disappointed to see you push Russia hysteria. It’s going to cause me to question everything you say, starting with your tweet about the alleged DCCC pledge. \n\nOur democracy is in trouble due to domestic lies, spread by those in power via corporate media. Aka: Both of you", "timestamp": "12:21 - 23. März 2019", "retweet_count": "6", "favorite_count": "25", "author": "JenBriney", "is_retweet": true}, {"text": "Need proof the corporate media is failing us all? Look no further. \n\nHere’s an excellent overview of the shameful BSing that the corporate media has inflicted upon us with #Russiagate. \n\nThank you @mtaibbi ", "timestamp": "11:47 - 23. März 2019", "retweet_count": "4", "favorite_count": "17", "author": "JenBriney", "is_retweet": true}, {"text": "Yup, and I’ll continue to ignore it until I see one shread of evidence that there was any coordination to rig the 2016 election for Trump. With no further indictments coming, it appears my strategy of ignoring this storyline has been a wise one", "timestamp": "09:38 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "JenBriney", "is_retweet": true}, {"text": "Thank you for all the kind tweets while I was gone. I’m fine, I swear. I’m just sick of all the nonsense and lies in the halls of power in this country... Just like everyone else. \n\nI’m back to work next week  We’re all in this insane asylum together. I’m happy to be home", "timestamp": "09:36 - 23. März 2019", "retweet_count": "2", "favorite_count": "52", "author": "JenBriney", "is_retweet": true}, {"text": "Just got back from Mexico and every TV in every airport told me the Mueller report is done...", "timestamp": "09:21 - 23. März 2019", "retweet_count": "0", "favorite_count": "15", "author": "JenBriney", "is_retweet": true}, {"text": "@rickygervais I just finished binge watching After Life... Thank you for creating such an honest, raw, brilliant show. I hope there are many more seasons to come. Bravo  (@Netflix: Take note, thanks)", "timestamp": "22:14 - 22. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "JenBriney", "is_retweet": true}]