[{"text": "Lindsey Graham has so jumped the shark it’s pathetic. Worse, he is the biggest sellout ever. He has no values whatsoever. He is just part of the human centipede that is owned by trump.", "timestamp": "14:13 - 23. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "KathyinBburg", "is_retweet": true}, {"text": "I takes work to uncover it all because guess who have one track minds. All we have heard for weeks in “Mueller, Muelle,” all speculation. Meanwhile candidates have some excellent ideas.  At the same time, Trump actually tries to destroy everything in sight. Little reporting.", "timestamp": "09:11 - 23. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "KathyinBburg", "is_retweet": true}, {"text": "Then if the word collusion does not appear, he claims “victory,” even if he presided over the biggest scandal and criminal campaign in history...worse than Watergate.", "timestamp": "08:57 - 23. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "KathyinBburg", "is_retweet": true}, {"text": "It never was investigating “collusion” because that is not a legal term.  The whole exercise by Trump was to substitute the word collusion for conspiracy, which can be a crime.", "timestamp": "08:56 - 23. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "KathyinBburg", "is_retweet": true}, {"text": "untroubled and Trump did nothing to stop it from happening in the future.", "timestamp": "08:30 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "It is not affordable to have to subscribe to more than two newspapers. And two are very expensive.", "timestamp": "08:28 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Paywall. Can you tell us the gist?", "timestamp": "08:27 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Disagree about a nothingburger, however. But the whole thing is in so many ways a distraction behind which too many ruinous policies & actions have been hidden from the country. Meanwhile media fiddle “waiting for Mueller,” & little that Trump is doing behind the scenes gets out", "timestamp": "08:24 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Yes, it is.  And to celebrate courageous journalists, who try to report what happened, even while political heavies try to thwart them at every opportunity. Thanks to him and the Parrys.", "timestamp": "08:19 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "At least she doesnt make ideological stuff up like Moore. Her positions are based upon how money actually works in a nation with sovereign currency (despite how we are told it works). And the for the rest she relies on science and actual analysis.", "timestamp": "08:05 - 23. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "KathyinBburg", "is_retweet": true}, {"text": "Attention @sengraham2016 There were 15 Republican led investigations into Hillary. She did nothing illegal. That you and fellow Dominionists continue down this road is abuse of power. It also makes you a bad person.", "timestamp": "07:24 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Exactly. For example, too many warped ppl celebrate ruthless opportunists, like those who spawn shows celebrating “you’re fired,” or those in WH, no matter how many laws they break, & no matter how much they lie, cheat & hurt others, just because they claim wealth. This is sick.", "timestamp": "06:19 - 23. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "KathyinBburg", "is_retweet": true}, {"text": "But age is a serious issue. As someone 70+ I think it nuts that we have three candidates between 70 & 80 by inauguration day.  Especially Biden & Bernie are too old so will likely pass on them. But Warren will be in her 70s by inauguration day too, but younger than the other 2", "timestamp": "05:53 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "And I am not deciding for sure for a while.", "timestamp": "05:47 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "I’d add that, as a feminist, I resent the suggestion that we MUST vote for a woman. The point is we CAN vote for anyone we think to be the best candidate, incl five women. And no one gets to tell me whom I should support.  (All I know is wont be Beto, Yang or Hickenlooper)", "timestamp": "05:46 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Thanks.", "timestamp": "20:31 - 22. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "LOL. It is a map of land, not people.", "timestamp": "20:27 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "America, where a pathological liar, mad man, ignoramus, probable crook, cheat and serial bully can become president but a journalist who made a single mistake gets attacked by those trying to run her out of a job. Fox crazies can foam at the mouth for years and they  still work.", "timestamp": "13:50 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Dinesh is a PoS.  Pls do not believe everyone is like his apalling self. (He cannot handle that @KevinMKruse has made mincemeat of his pathetic know.edgemof history.) He is an underachiever who is jealous.", "timestamp": "13:43 - 22. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "Yep.  TRump is considering the nein, nein, nein guy.  That guy was actually trying to run for president himself at one time because every dumba** pizza exec is qualified to be prez. Not.", "timestamp": "13:30 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "The impression this gives is that the person fibbed a little. NO, HE DIDN’T. Sorry. This requires shouting because politifact cannot being itself to gives trues to Dems, even when deserved (most of the time).", "timestamp": "13:25 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "So-called fact checkers are usually a single person weighing in on the truth of a stmt. And they tend to be biased too. I think politifact, http://factcheck.org  and Glenn Kessler at WP also need fact checking. Who’s in?", "timestamp": "13:10 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "“Politifact” refuses to give True ratings for Dems, even when the item is true. They will find some minor “context” reason to deny full truth to a Democratic claim. Just one example...", "timestamp": "13:07 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "He apparently also plans to appoint Herman Caine. Talk about worst ever.", "timestamp": "12:54 - 22. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "", "timestamp": "12:51 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Word is that in addition to Stephen Moore, Trump will also name Herman Caine to the Fed.  If one needs more reason to doubt tRump’s competence (who does really?), this should seal it. Caine would probably be his worst appointment yet.", "timestamp": "12:39 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Oh, come on. This is ridiculous.  It is fiction, not current events. WTF?", "timestamp": "12:35 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Thank you. Please cover the news and the candidates, the candidates themselves, not what someone says about them.  This endless, speculation is a sick joke.", "timestamp": "12:33 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Laughing isnt exactly it. Maybe mooooooiing in our grain, er hops.", "timestamp": "12:30 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "No, do not tweet your birthday. Do you have mad cow disease?", "timestamp": "07:35 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "VTs ACC opponents mock us for being in cow country. Indeed I lived where there were pastures on three sides of our development inside the town limits. Today I am proud to be from there.  So I keep my same twitter name. Go Hokies! PS He’s back!", "timestamp": "07:25 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Yup. The double standard must stop. But the double standard begins with either hypocritical Rs or the media who use thier frame everytime. This time our frames must be impeccable. Who can do it best? That person will win.", "timestamp": "07:21 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "But Rs think everything, including air safety thould be self-monitored (industry monitors itself). This situation shows how dangerous that thinking is.", "timestamp": "07:11 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "This is the best tweet of the week, imho.", "timestamp": "06:53 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Oh, Kindler, not you mooo, I mean too.", "timestamp": "06:50 - 22. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "Doesn’t matter. If housing is still too expensive one can never mooooove back.", "timestamp": "06:47 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "James Comey strikes again.  He needs to learn when to stay out of it.", "timestamp": "06:45 - 22. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "KathyinBburg", "is_retweet": true}, {"text": "@HowardSchultz Sanders is a democratic socialist who merely wants the party to be an FDR democratic party again. There are no actual socialists running.  Do not lie. Furthermore your approach to things citizens need is optional for employers. Optional wont cut it for human needs.", "timestamp": "06:43 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "PS I “herd” what you said & I am mooooved to say this: You are hereby nominated for the double standard award when it comes to fact cking R vs Dems (constantly judge Dems harsher) & men v women. & that is no bull, I mean cowtalk.Can hardly wait till you pretend to fact check cows", "timestamp": "07:11 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Male candidates talk tough in crime and they win, regardless of the fact that enlightened people realize the perils of mass incarceration and admit the system has gone too far.", "timestamp": "07:03 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "Let’s face it. Anyone enforcing three strikes or mandatory sentencing, as they were required to do under the (bad) law contributed ton the problem. But it in no way was Klobuchar’s or any other prosecutor’s (ie (Harris’s) fault. Note this is never an issue for male candidates.", "timestamp": "07:02 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "@SRuhle This guy from AEI telling us all how to live? Sorry, Rs have been waging hate against Dems for half a century.  And after 20 years of Fox lies and name-calling (and Trump!) he dares to lecture anyone? There is no counterpart on the left for extreme right wing hate radio.", "timestamp": "06:54 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Spare the world such idiotic governors (and president). Cows are smarter than this. #DevinCow", "timestamp": "06:24 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Yeh, me thinks this is all for show.", "timestamp": "06:19 - 21. März 2019", "retweet_count": "0", "favorite_count": "7", "author": "KathyinBburg", "is_retweet": true}, {"text": "I ask again, has no one read “Click, Clack Moo: Cows that Type”?  If not, your child needs this book.  You will love her cows. The whole Doreen Cronin series is great, but this one is mooovelous. (I have no stake or steak in saying this, just find them udderly charming.)", "timestamp": "06:18 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "I do realize the irony of talking about imposters while I have a cow profile pic. @devincow", "timestamp": "06:06 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Spare the world, and especially America, these dreadful imposters.", "timestamp": "06:03 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "We have around 20 candidates. Why do we keep desperately looking for a savior? We do not need more candidates. We need coverage of the ones we have. PS Some if them are excellent, but this constant longing for a savior is a distraction. We have to choose and then make it happen.", "timestamp": "04:31 - 21. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "KathyinBburg", "is_retweet": true}, {"text": "Our rightful indignation over the election in GA does not mean Stacey is ready to be VP or president any more than Beto is. Neither actually served in the positions which would have better prepared them for higher offices. Better than tRump doesnt mean they can win", "timestamp": "04:26 - 21. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "KathyinBburg", "is_retweet": true}, {"text": "Totally agree. But I also think it is premature for either Beto or Stacey to run for either president or VP.", "timestamp": "04:07 - 21. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "KathyinBburg", "is_retweet": true}, {"text": "LOL. But hurry back. Ali is pretty awesome in that timeslot. On the other hand Ali already has two hours a day. Why wld he want a show that late?", "timestamp": "22:40 - 20. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "KathyinBburg", "is_retweet": true}, {"text": "Skateboards dont power themselves.", "timestamp": "22:32 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Do you think you could possibly stop this? It is not as if all the grievances are on one side. But this refusal to move forward is going to kill our chances in 2020 if you keep acting like this.", "timestamp": "14:26 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "All these candidates (and also Butigieg) have well formulated, detailed policy ideas. But you ask Beto if he agrees with one of them on this or that and, voilla, we are told he has a “policy.”", "timestamp": "14:23 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "Where are the good media stories about Amy Klobuchar, Kamala Harris, Elizabeth Warren, Kirsten Gillibrand, and Tulsi Gabbard? Every one of them have accomplishd more than Beto.  Come on, people. Where is the coverage?  Same for Jay Inslee. Where is the coverage?", "timestamp": "14:23 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "Seriously? That’s it.  The man lost.", "timestamp": "14:17 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "The person who tweeted thus is disgusting. I am sorry you and Meagan have had to put up with this garbage.  And I wish you well. Losing a loved one hurts enough without this nastiness.", "timestamp": "14:14 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Well, that assumes we actually take Beto seriously.  Maybe Beto should have studied harder, prepared harder, taken this more seriously. Women candidates run circles around his royal superficialness. It is shocking how women candidates are covered given their superior performance.", "timestamp": "14:08 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "My thoughts exactly. We needed a reason to laugh again.  Hope your b/d is great.", "timestamp": "13:57 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "Seriously, Liz. Call those two organizations.", "timestamp": "13:27 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Three words: Electronic Frontier Foundation.  And an acronym, ACLU. You might like to know it helps conservatives too.", "timestamp": "13:26 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "At least something on the internet is fun right now. tRump has made sure nothing else is. PS, we gotta go for half a million followers, dont you think.", "timestamp": "13:24 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "You must have read “Click Clack Moo: Cows that Type,” which we so obviously can.", "timestamp": "11:07 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "I and this Hethwood cow in my profile pic wish you all well. Let’s go Hokies. ", "timestamp": "06:55 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Oh, God. How could you show this steak photo to all the cows online rallying to save @DevinCow ?", "timestamp": "06:53 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "I feel Moooovelous. @DevinCow lives and is growing followers. We all have a “steak” in Devin Nunes failing to sue “his own cow.“ Instead someone should investigate Nunes allegedly faking a congressional investigation.", "timestamp": "06:51 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "#resist fight cow hating Devin Nunes, the worst congressional investigator in US history. How does one hate “his own” cow? @DevinCow", "timestamp": "06:46 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": " Please remember to Mooosey on over to @DevinCow He needs about 53,000 more follows to have more followers than Devin Nunes and his bot friends.  Nunes is suing “his own” satirical cow because Devin has no sense of humor. Stand up for satirical cows everywhere.", "timestamp": "06:28 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "I dunno. His skin is a bit thin.  Not good for a steak.  I’m no good for steak either btw. ", "timestamp": "06:22 - 20. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "KathyinBburg", "is_retweet": true}, {"text": "Yeh and the way it is now 47 states are irrelevant.", "timestamp": "05:51 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "At least he follows @DevinCow.  So there’s that.", "timestamp": "05:20 - 20. März 2019", "retweet_count": "0", "favorite_count": "12", "author": "KathyinBburg", "is_retweet": true}, {"text": "Take away tRumps twitter feed.  He’ll get ideas. He might even forget how bills are made. We are in for some hysterical moooing from the WH lawn.", "timestamp": "05:19 - 20. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "KathyinBburg", "is_retweet": true}, {"text": "He cant possibly have 400,000 real followers! There cannot be that nany cowed ppl.", "timestamp": "05:15 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "@DevinCow I think Devin Nunes has a lot of bot folliwers. It is inconceivable that that many ppl and cows care what he says.", "timestamp": "04:49 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "We tried hard to get ppl to follow @devincow but you trended anyway.  No worries. Reporting on candidates voting records and donors is essential and too few are doing it. You told the truth. And it needed to be told. Thank you.", "timestamp": "04:40 - 20. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "KathyinBburg", "is_retweet": true}, {"text": "Onward! Solidarity!", "timestamp": "03:30 - 20. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "LOL", "timestamp": "15:33 - 19. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "So hard to decide. But these candidates warm my cow-ckles.  That is, I think they will lead us to greener pastures: Klobuchar, Inslee, Harris, Warren, Buttiegeg, Sanders, Gabbard. Still thinking on Gillibrand. She did have an outstanding town hall yesterday.", "timestamp": "15:31 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "How perfect. But he always was a turd.", "timestamp": "15:24 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "She had a great town hall last evening, way better than I predicted. Perhaps the best so far. But I am still hung up on this issue. There should never be a railroading without due process. She did say investigate, but then seemed to suggest in his case the accusations were enough", "timestamp": "15:18 - 19. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "KathyinBburg", "is_retweet": true}, {"text": "LOL. I can tell when I’m being cowed. Anything Bill O writes needs a shovel.", "timestamp": "15:07 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "I am not a cow, except perhaps by weight, joining cows everywhere to save @DevinCow from the likes of Devin Nunes,  a humorless human parody if ever there were one. PS, Devin, stay off my lawn.", "timestamp": "14:46 - 19. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "@NicolleDWallace Have you followed @DevinCow yet?", "timestamp": "14:16 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Maybe Katie shoud consider not pretending to be a history expert and esp not getting her info from Fox, Breitbart, Daily Caller and InfoWars.", "timestamp": "13:38 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "@DevinCow is the twitter feed de jour. See why the cowpoke and erstwhile transition team member investigated said transition team (ie himself and his tRump buds). Best read on twitter.", "timestamp": "13:35 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "I will support the Democratic Party nominee, but if it is Beto, I will change my registration to unaffiliated. I have been a Dem for more thant 50 years. But giving credence to his cult-like empty candidacy like this would be an exercise in desperation.", "timestamp": "13:27 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "It is just a bit early, don’t you think?", "timestamp": "13:07 - 19. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "KathyinBburg", "is_retweet": true}, {"text": "Come on, people. It is called early voting. Get election workers to work multiple days. Lines shorter. Democracy flourishes. It’s as it should be.", "timestamp": "09:31 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "What does anyone expect from their one-man (biased) fact checker.  One lone person is not an arbitor of anything.", "timestamp": "05:14 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "With your “guides” voters have absolutely nothing upon which to base their vote. Or maybe you just want voters to support the idiot incumbent.", "timestamp": "18:45 - 18. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "We have a list of very experienced and prepared candidates. While I do not plan to vote for Gillibrand, there is far more to her than this crap. And you know it. Your followers should jump ship and watch the Town Hall she just gave at msnbc. PS Your bad and you’re bad.", "timestamp": "18:44 - 18. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Yup. Double barreled questions tell us nothing re what the responder means. Someone doesn’t know how to write survey items. Even interns should know better.", "timestamp": "17:15 - 18. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Child care plan", "timestamp": "16:42 - 18. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Ivanka’s fraudulent care plan is not better than nothing. It is nothing. Any amounts used will be subtracted from the person’s Social Security later. With the diminishing of pensions in America, Social Security will be even more necessary for people. Cutting it is a dirty trick.", "timestamp": "15:49 - 18. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "I am so glad that @chucktodd blocked me. He now blames Obama for not bringing us together? After how Congressional Rs treated him, birthered him and treated him like he didnt belong? Todd shows his bias in making such a claim. He abets the poisonous way Rs treated Obama.", "timestamp": "20:08 - 17. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "Astonishing.", "timestamp": "18:30 - 17. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "As you noted tuition is so much higher now, prob 10 times higher in in flation adjusted dollars. If it was next to impossible to earn enough for college in the summer in the 1960s, it is definitely impossible now,", "timestamp": "09:52 - 17. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Even in the 1960s my summer pay would not have done that.  Certainly not today. I had to work both summers and 20 hours a week during the school year to pay my tuition and fees. And I lived at home instead of the often today expected perk of living in a dorm.", "timestamp": "09:50 - 17. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "There’re more (all men) who might declare yet.  Biden, Cuomo, DiBlasio, Moulton, Swalwell, Yang etc.The field is so saturated & will be so diluted in the vote count that in crossover states Rs could end up picking our candidate. All are better than Trump, but not all can beat him", "timestamp": "08:14 - 17. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "So far overrated he almost believes the shit he makes up as he goes because he thinks he doesn’t need to prepare (you know, when you are “born to do this” your every utterance is for us to grasp).  But it is all in the voting record. PS He is  a media artifact.", "timestamp": "06:38 - 17. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "Wow! What a great group!", "timestamp": "18:48 - 16. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "KathyinBburg", "is_retweet": true}, {"text": "Behold what is wrong with America.", "timestamp": "19:47 - 15. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}, {"text": "LOL", "timestamp": "19:46 - 15. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "KathyinBburg", "is_retweet": true}]