[{"text": "Amazon Prime is the independent corner video store of streaming. Without the judgmental clerk.", "timestamp": "22:10 - 22. März 2019", "retweet_count": "6", "favorite_count": "52", "author": "Lileks", "is_retweet": true}, {"text": "Netflix: hey here’s a new series about attractive serious people with powers who are back from the dead in the future; it makes no sense\n\nAmazon Prime: so, \"Mondo Cane?\" To Tell the Truth eps? 1974 sex musical? Maisel? Bond? 40s noir? Cartoons?", "timestamp": "22:09 - 22. März 2019", "retweet_count": "7", "favorite_count": "24", "author": "Lileks", "is_retweet": true}, {"text": "It was for research purposes. I have a long-standing aversion to the Stooges. Growing up, I thought Moe was a grim sadist, and he repelled me.", "timestamp": "22:00 - 22. März 2019", "retweet_count": "2", "favorite_count": "36", "author": "Lileks", "is_retweet": true}, {"text": "The entire time I was having a voice-msg WhatsApp convo with daughter in Brazil about the dangers of nihilism in comedy she had no idea I was watching a Three Stooges short where Moe shaved off slices of Larry’s scalp with a hand sander. On the planet Venus", "timestamp": "21:58 - 22. März 2019", "retweet_count": "1", "favorite_count": "23", "author": "Lileks", "is_retweet": true}, {"text": "Lucky for us we were spared a Murray Slaughter sitcom, because he was a bitter little man of limited talent whose dominant internal script was how unlikely it was he could attract a woman like Mar.", "timestamp": "21:40 - 20. März 2019", "retweet_count": "0", "favorite_count": "20", "author": "Lileks", "is_retweet": true}, {"text": "So imagine a show that gave him some pathos and depth, as well as explored his demons and his inconsistent decency. I think Ted Knight could have carried it off, too. (3/3)", "timestamp": "21:37 - 20. März 2019", "retweet_count": "1", "favorite_count": "26", "author": "Lileks", "is_retweet": true}, {"text": "Ted, in the end, was the only character on the show who had his life together: he was happily married, unlike Grant; he adopted a kid; he kept his job when everyone else was axed. And he was the only character capable of uncomplicated happiness. (2/x)", "timestamp": "21:34 - 20. März 2019", "retweet_count": "2", "favorite_count": "50", "author": "Lileks", "is_retweet": true}, {"text": "If I’d been an MTM productions exec after the end of the “Mary Tyler Moore Show,” I would have proposed a show about Ted Baxter, done “Lou Grant” style. Drop the sitcom tropes. (1/x)", "timestamp": "21:32 - 20. März 2019", "retweet_count": "2", "favorite_count": "36", "author": "Lileks", "is_retweet": true}, {"text": "Twitter needs an bedit utton.", "timestamp": "22:12 - 19. März 2019", "retweet_count": "9", "favorite_count": "41", "author": "Lileks", "is_retweet": true}, {"text": "You’re right; my error", "timestamp": "22:11 - 19. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "Lileks", "is_retweet": true}, {"text": "Alan Reed had a long career before Flintstone, but nothing like the guy who voiced George Jetson: he was in a *1933* Busby Berkeley musical.", "timestamp": "21:25 - 19. März 2019", "retweet_count": "3", "favorite_count": "38", "author": "Lileks", "is_retweet": true}, {"text": "The Canadian radio announcer just said the the guy who voiced Fred Flintstone based “dabba dabba do” on his mother’s catch phrase, “A little dab’ll do ya” and now I weep for the state of cultural literacy", "timestamp": "21:21 - 19. März 2019", "retweet_count": "6", "favorite_count": "62", "author": "Lileks", "is_retweet": true}, {"text": "Daughter prank to me today by sending a picture of a homemade tattoo and saying she’d just gotten it. All you need to know about parenthood is that your kids can give you tachycardia from a distance of 5600 miles away", "timestamp": "20:45 - 19. März 2019", "retweet_count": "5", "favorite_count": "144", "author": "Lileks", "is_retweet": true}, {"text": "Almost made a simple, harmless tweet about a new salsa I like, and realized I would drowned by people telling me I should really try another brand which is better and also only available in the town of Butlap, TX (pop 58)", "timestamp": "15:59 - 17. März 2019", "retweet_count": "11", "favorite_count": "111", "author": "Lileks", "is_retweet": true}, {"text": "The England of the Sixties vibe is nicely done. You can accomplish a lot with lamps and mantle bric-a-brac.", "timestamp": "21:33 - 12. März 2019", "retweet_count": "1", "favorite_count": "29", "author": "Lileks", "is_retweet": true}, {"text": "I’m watching the Inspector Morse prequels, having never watched any of the 37 seasons of “Inspector Morse.” I’m sure I’m missing everything, but gather he likes singing and is good at deduction and his colleagues aren’t as smart", "timestamp": "21:31 - 12. März 2019", "retweet_count": "0", "favorite_count": "20", "author": "Lileks", "is_retweet": true}, {"text": "Bill Stern was an original, but the stories told on the air makes me think “BS” was coined to describe his yarns.", "timestamp": "14:39 - 12. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "Lileks", "is_retweet": true}, {"text": "There’s only one Poirot for me, and that’s Jon Polito. Shame he never played the role", "timestamp": "21:34 - 11. März 2019", "retweet_count": "1", "favorite_count": "16", "author": "Lileks", "is_retweet": true}, {"text": "Amazon recommended “An Inspector Calls” because I had watched “The ABC Murders,” which I gather infuriated Poirot fans b/c it gave the character depth and pathos", "timestamp": "21:32 - 11. März 2019", "retweet_count": "2", "favorite_count": "17", "author": "Lileks", "is_retweet": true}, {"text": "Surprised the BBC's “An Inspector Calls” is a one-off, not a beloved six-season series about  a low-key detective who informs a family of Victorian rotters that they share collective blame for a murder in every episode", "timestamp": "21:30 - 11. März 2019", "retweet_count": "1", "favorite_count": "10", "author": "Lileks", "is_retweet": true}, {"text": "It’s beginning to look a lot like Christmas", "timestamp": "19:45 - 9. März 2019", "retweet_count": "10", "favorite_count": "106", "author": "Lileks", "is_retweet": true}, {"text": "Ah, good, it’s raining, so we’ll have a thick sheaf of ice that keeps the snow below from melting for three weeks.", "timestamp": "12:57 - 9. März 2019", "retweet_count": "4", "favorite_count": "48", "author": "Lileks", "is_retweet": true}, {"text": "In the first she reaches out to grab the sleeve of Robert Young, who is wearing an immaculate and nicely accessorized cowboy outfit, and he *snarls* “don’t touch me.” Because he is a he-man.", "timestamp": "20:19 - 8. März 2019", "retweet_count": "0", "favorite_count": "14", "author": "Lileks", "is_retweet": true}, {"text": "There are TEN movies in the series, and I presume she seduces a he-man woman-hater in each, then leaves him. They are comedies.", "timestamp": "20:17 - 8. März 2019", "retweet_count": "0", "favorite_count": "14", "author": "Lileks", "is_retweet": true}, {"text": "Watching a movie where Ann Sothern convinces a he-man woman-hater to change his ways. He lives alone in the Congo on a rubber plantation.", "timestamp": "20:16 - 8. März 2019", "retweet_count": "0", "favorite_count": "21", "author": "Lileks", "is_retweet": true}, {"text": "It is not the biopic of the real Christopher Robin, who apparently was unhappy. I’ve no desire to see that. It’s like knowing Dennis the Menace was estranged from the father who had to keep drawing him as a child for decades.", "timestamp": "21:32 - 7. März 2019", "retweet_count": "0", "favorite_count": "28", "author": "Lileks", "is_retweet": true}, {"text": "Watching “Christopher Robin,”  a nice mix of mild family-friendly humor and stab-you-in-the-heart unslakable aching sadness. Nice trick", "timestamp": "21:26 - 7. März 2019", "retweet_count": "0", "favorite_count": "32", "author": "Lileks", "is_retweet": true}, {"text": "Spent 20 minutes furiously texting with daughter on the other side of the world about a cartoon math problem. Highlight of the week ;)", "timestamp": "16:23 - 7. März 2019", "retweet_count": "2", "favorite_count": "66", "author": "Lileks", "is_retweet": true}, {"text": "“American in Paris” come on the radio and I was reminded that the opening sequence quotes the pig toy music box that survived the sinking of the Titanic.", "timestamp": "16:35 - 6. März 2019", "retweet_count": "1", "favorite_count": "20", "author": "Lileks", "is_retweet": true}, {"text": "Shark, not stark", "timestamp": "16:08 - 5. März 2019", "retweet_count": "1", "favorite_count": "13", "author": "Lileks", "is_retweet": true}, {"text": "But was a stark really jumped? What if witnesses were wrong, and it was a dolphin - and no one jumped at all? We went to investigate, and found surprising resistance to two reporters with Boston accents", "timestamp": "16:07 - 5. März 2019", "retweet_count": "3", "favorite_count": "20", "author": "Lileks", "is_retweet": true}, {"text": "When a true crime podcast narrator says “yep, it’s the small-town music” to introduce the segment about a sleepy southern town where an injustice was done, you suspect the genre may have jumped the shark.", "timestamp": "16:06 - 5. März 2019", "retweet_count": "6", "favorite_count": "33", "author": "Lileks", "is_retweet": true}, {"text": "“He’s been so snuggly tonight,” my wife said. “It’s because he’s going to barf gouts,” I said.\" He’s had breath like a frat house in pledge week all night.\"", "timestamp": "21:17 - 4. März 2019", "retweet_count": "2", "favorite_count": "40", "author": "Lileks", "is_retweet": true}, {"text": "Birch the dog gently requested to go outside, where it is 3 above, so that he could bring up the meatballs he purloined. I obliged.", "timestamp": "21:14 - 4. März 2019", "retweet_count": "1", "favorite_count": "40", "author": "Lileks", "is_retweet": true}, {"text": "Of all the things I forgot about “The Sopranos,” the Lauren Bacall cameo tops the list", "timestamp": "21:53 - 28. Feb. 2019", "retweet_count": "1", "favorite_count": "26", "author": "Lileks", "is_retweet": true}, {"text": "Served David Byrne at a college bar; he wanted coffee and two aspirin, and asked if the tv volume could be increased so he could hear the documentary on African drumming", "timestamp": "21:17 - 28. Feb. 2019", "retweet_count": "21", "favorite_count": "461", "author": "Lileks", "is_retweet": true}, {"text": "Not yet! Iowa City is the next Iowa town I do, I think. (I’m usually 10 months out on these. I have a big backlog)", "timestamp": "13:16 - 28. Feb. 2019", "retweet_count": "0", "favorite_count": "1", "author": "Lileks", "is_retweet": true}, {"text": "Found in the office: rare promotional material from the 1978 ABC show “Staplin’ Jones,” about a widowed pioneer who ran the town’s only stapling shop, and solved crime. Ran one season; came back as summer replacement in variety form.", "timestamp": "13:14 - 28. Feb. 2019", "retweet_count": "9", "favorite_count": "92", "author": "Lileks", "is_retweet": true}, {"text": "Blizzard wind ripped the storm door out of the frame, sheared the screws right out of the plate that held the pneumatic door-closer bolted to the frame.\n\n“Storm door.” YOU HAD ONE JOB", "timestamp": "11:49 - 24. Feb. 2019", "retweet_count": "17", "favorite_count": "156", "author": "Lileks", "is_retweet": true}, {"text": "Saw “Stan & Ollie.” Rather predictable arc, but the performances are astonishing and the film has a quiet sense of decency that feels rare. Also, *funny.*", "timestamp": "21:46 - 23. Feb. 2019", "retweet_count": "1", "favorite_count": "64", "author": "Lileks", "is_retweet": true}, {"text": "Went down slippery steps with the dog in a leash; neighbor had left gate open while he shoveled, and the dogs got out. Birch lunged. Took tremendous fall. But the AirPods did not fall out! Man, you could wear these things while boxing.", "timestamp": "18:31 - 21. Feb. 2019", "retweet_count": "4", "favorite_count": "45", "author": "Lileks", "is_retweet": true}, {"text": "Greensleeves, like that Peanuts skating song, eventually serves to make grownups feel bittersweet about Christmas", "timestamp": "10:30 - 20. Feb. 2019", "retweet_count": "1", "favorite_count": "26", "author": "Lileks", "is_retweet": true}, {"text": "Eight inches of snow, and the harpist in the atrium is playing “Greensleeves.” It’s like someone bumped the record player and its jumped back three cuts.", "timestamp": "10:29 - 20. Feb. 2019", "retweet_count": "7", "favorite_count": "47", "author": "Lileks", "is_retweet": true}, {"text": "Surely I’m not the only one bothered by the fact that the motion in the Sopranos opening credits is all in the same direction, except for the Pizzaland store", "timestamp": "21:59 - 19. Feb. 2019", "retweet_count": "2", "favorite_count": "13", "author": "Lileks", "is_retweet": true}, {"text": "I mean, the four-roll option at least suggests “you got other things to do\"", "timestamp": "21:33 - 19. Feb. 2019", "retweet_count": "3", "favorite_count": "42", "author": "Lileks", "is_retweet": true}, {"text": "The only “bathroom tissue” options left at the store tonight were 24-roll bales, which exist only to make you confront the inescapable reality of existence", "timestamp": "21:33 - 19. Feb. 2019", "retweet_count": "8", "favorite_count": "61", "author": "Lileks", "is_retweet": true}, {"text": "Just saw someone on the street who made me want to say “you look like a young Guindon Minnesotan” but no one under 50 would get the reference. Sic transit, etc https://en.m.wikipedia.org/wiki/Dick_Guindon …", "timestamp": "12:29 - 19. Feb. 2019", "retweet_count": "6", "favorite_count": "37", "author": "Lileks", "is_retweet": true}, {"text": "Best fake I’ve seen in years.", "timestamp": "10:53 - 15. Feb. 2019", "retweet_count": "0", "favorite_count": "3", "author": "Lileks", "is_retweet": true}, {"text": "Note from the Post Office that I have a parcel waiting; probably the box I sent to Brazil two months ago. I tracked it; it spent 1 day in Brazil, and then went to South Korea. Guess the Post Office in Brazil said “eh, delivering it, that’s work.” Gah.", "timestamp": "09:10 - 15. Feb. 2019", "retweet_count": "3", "favorite_count": "29", "author": "Lileks", "is_retweet": true}, {"text": "Rewatching the Sopranos and enjoying it.  I still think Boardwalk Empire is richer, has better secondary characters, and zero scenes that could be set to a laugh track. All it lacks is Gandolfini, but that’s everything.", "timestamp": "22:18 - 14. Feb. 2019", "retweet_count": "0", "favorite_count": "26", "author": "Lileks", "is_retweet": true}, {"text": "When I walk inside, my eyes streaming from the cold wind, I just consider it practice for getting some really bad news", "timestamp": "12:21 - 11. Feb. 2019", "retweet_count": "1", "favorite_count": "27", "author": "Lileks", "is_retweet": true}, {"text": "It took a long, long time, but I finally found a whiskey I wanted to pour down the drain. All the reviews rave about its \"subtle notes of paper and mild leather\" and whatnot, but to me it’s like licking a half-eaten rawhide the dog buried in a hogsty", "timestamp": "21:50 - 10. Feb. 2019", "retweet_count": "4", "favorite_count": "63", "author": "Lileks", "is_retweet": true}, {"text": "Me, 1st time I MC’d at Orchestra Hall: HOW DO MY EYEBROWS LOOK ARE MY SHOELACE TIPS SHINED \n\nToday, after 22 seasons: eh, my fly’s probably zipped", "timestamp": "15:33 - 10. Feb. 2019", "retweet_count": "4", "favorite_count": "76", "author": "Lileks", "is_retweet": true}, {"text": "Sitting by the radiator trying to un-numb my feet so I can go back outside and re-numb them", "timestamp": "13:38 - 9. Feb. 2019", "retweet_count": "4", "favorite_count": "73", "author": "Lileks", "is_retweet": true}]