[{"text": ".@MLabberton's sermon is on the \"mesmerizing rhythms\" that can control our lives & God's grace/ability to interrupt the destructive narratives that control our lives and replace them with mercy, goodness, hope. It ends with a lovely story of redemption.   \nhttp://www.losttreechapel.org/sermons/ ", "timestamp": "13:04 - 23. März 2019", "retweet_count": "0", "favorite_count": "5", "author": "Peter_Wehner", "is_retweet": true}, {"text": "On the Mueller report/any other investigations, what ought to matter to us are facts. We should above all want to know what happened/didn't happen and shape our response based on reality, not on what our tribalistic, pro/anti-Trump feelings are. That shouldn't be too much to ask.", "timestamp": "10:02 - 23. März 2019", "retweet_count": "46", "favorite_count": "273", "author": "Peter_Wehner", "is_retweet": true}, {"text": "\"Mr. President, he's dead. He can't punch back.\" And yet it makes no difference to him. I'm afraid Mr. Trump is being consumed by a moral sickness.", "timestamp": "15:00 - 21. März 2019", "retweet_count": "39", "favorite_count": "131", "author": "Peter_Wehner", "is_retweet": true}, {"text": "This new book by the theologian Tremper Longman is excellent. It deals with questions of evolution, sexuality, and violence in the context of the Hebrew Bible. Whether you agree with him or not, you’ll be better and wiser for having read him.", "timestamp": "13:09 - 21. März 2019", "retweet_count": "0", "favorite_count": "8", "author": "Peter_Wehner", "is_retweet": true}, {"text": "And pretty important, too, @SykesCharlie. A piece very much worth reading in order to understand some of what is overtaking the American right.", "timestamp": "12:36 - 21. März 2019", "retweet_count": "31", "favorite_count": "51", "author": "Peter_Wehner", "is_retweet": true}, {"text": "\"Among the many problems with the president’s behavior is that it is unnecessary. It is also offensive.\" @CalThomas weighs in on the president's troubled behavior.   \nhttps://calthomas.com/columns/insulter-in-chief …", "timestamp": "07:14 - 21. März 2019", "retweet_count": "3", "favorite_count": "27", "author": "Peter_Wehner", "is_retweet": true}, {"text": "Such a telling compassion, @BillKristol. And now ask yourself which man inspired the base of his party more. That goes to the heart of the challenge, I would say. Sen. McCain pushed back against the ugliest tendencies in his movement, as did others. Donald Trump appeals to them.", "timestamp": "06:31 - 21. März 2019", "retweet_count": "63", "favorite_count": "223", "author": "Peter_Wehner", "is_retweet": true}, {"text": "The cognitive and emotional/psychological decline of the president is clearly accelerating. He is breaking apart before our eyes. It is a remarkable thing to witness; and it’s only going to get worse. We’re in uncharted waters.", "timestamp": "15:06 - 20. März 2019", "retweet_count": "3114", "favorite_count": "12597", "author": "Peter_Wehner", "is_retweet": true}, {"text": "Of course it'd be better if this wasn't a public dispute among the parents. On some level they must both wish the same thing. But human relationships can be complicated, difficult & sometimes embittering. It's not something to delight in; the rest of us don't need to cheer it on.", "timestamp": "12:41 - 20. März 2019", "retweet_count": "5", "favorite_count": "57", "author": "Peter_Wehner", "is_retweet": true}, {"text": "I understand why there's coverage of the Kellyanne-George Conway story. But in doing so remember there are 4 children involved who are collateral damage. This has to be so painful for them; so perhaps we can all show some restraint in the eagerness/glee in covering this story.", "timestamp": "12:41 - 20. März 2019", "retweet_count": "6", "favorite_count": "127", "author": "Peter_Wehner", "is_retweet": true}, {"text": "I'm not sure Mr. Trump is in a particularly strong position to call anyone a \"husband from hell!\" Whatever you think of @gtconway3d, he didn't pay hush money to a porn star to cover up an affair that occurred shortly after his third wife gave birth to their son. Just a thought.", "timestamp": "06:22 - 20. März 2019", "retweet_count": "1266", "favorite_count": "7500", "author": "Peter_Wehner", "is_retweet": true}, {"text": "\"As politics has become a religion in so many lives, political discourse has taken on theological overtones.\" From a marvelous column by @MJGerson.", "timestamp": "12:23 - 19. März 2019", "retweet_count": "14", "favorite_count": "32", "author": "Peter_Wehner", "is_retweet": true}, {"text": "This is more evidence of the radicalism of the today's Democratic Party. It appears as if there's no abortion they oppose. \"Safe, legal and rare\" is a formulation you're not going to hear from any Democrat running for president. I'm not sure they believe abortion should be rare.", "timestamp": "16:13 - 18. März 2019", "retweet_count": "6", "favorite_count": "36", "author": "Peter_Wehner", "is_retweet": true}, {"text": "\"A culture lives or dies based on its allegiance to unwritten rules of conduct and unstated norms, on the signals sent about what kind of conduct constitutes good character and honor and what kind of conduct constitutes dishonor and corruption.\"", "timestamp": "11:02 - 18. März 2019", "retweet_count": "646", "favorite_count": "1499", "author": "Peter_Wehner", "is_retweet": true}, {"text": "\"Trump's Damaged Soul.\" My latest reflections on the president in @TheAtlantic \nhttps://www.theatlantic.com/ideas/archive/2019/03/trump-tweets-attack-john-mccain/585193/ …", "timestamp": "10:42 - 18. März 2019", "retweet_count": "341", "favorite_count": "815", "author": "Peter_Wehner", "is_retweet": true}, {"text": "\"White evangelical Protestants who regularly attend church (that is, once a week or more) approve of Trump at rates matching or exceeding those of white evangelicals who attend church less often.\" -- @pewresearch", "timestamp": "07:22 - 18. März 2019", "retweet_count": "8", "favorite_count": "22", "author": "Peter_Wehner", "is_retweet": true}, {"text": "“An insurance policy against life’s cruelty.” What a lovely phrase by @nytdavidbrooks on what community is.", "timestamp": "05:01 - 18. März 2019", "retweet_count": "14", "favorite_count": "33", "author": "Peter_Wehner", "is_retweet": true}, {"text": "Trump's obsession with tearing down John McCain is another demonstration of what a genuinely broken soul the president is. His resentment & utter lack of dignity/empathy for the family of a war hero who recently died is but one reminder of the president's disordered personality.", "timestamp": "11:17 - 17. März 2019", "retweet_count": "4889", "favorite_count": "20941", "author": "Peter_Wehner", "is_retweet": true}, {"text": "Agreed @RonBrownstein. But are the concerns of the 2020 senators about a primary challenge knocking them off valid or overstated? I took their votes to be driven more by fear of an intraparty challenge than a general election one. Which highlights the political bind for the GOP.", "timestamp": "12:46 - 15. März 2019", "retweet_count": "2", "favorite_count": "7", "author": "Peter_Wehner", "is_retweet": true}]