[{"text": "I signed the petition: Revoke Article 50 and remain in the EU.", "timestamp": "16:14 - 23. März 2019", "retweet_count": "3", "favorite_count": "12", "author": "PhMarliere", "is_retweet": true}, {"text": "Alors que Jeremy Corbyn était absent de la manif anti-#Brexit & pour un 2e référendum qui a réuni un million de personnes à Londres, Nicola Sturgeon, la première ministre écossaise, y était & a pris la parole. Respect & admiration pour Nicola Sturgeon.", "timestamp": "11:55 - 23. März 2019", "retweet_count": "18", "favorite_count": "48", "author": "PhMarliere", "is_retweet": true}, {"text": "Un million de Britanniques ont manifesté aujourd’hui à Londres contre le #Brexit et pour la tenue d’un deuxième référendum. C’est la plus grande manif politique au Royaume-Uni depuis celle contre l’intervention militaire en Irak en 2003.", "timestamp": "10:42 - 23. März 2019", "retweet_count": "30", "favorite_count": "52", "author": "PhMarliere", "is_retweet": true}, {"text": "Mon entretien à ⁦@Regards_fr⁩. Le #Brexit est un projet néolibéral et xénophobe qui va accentuer les inégalités ; 2) La gauche britannique dans son ensemble s’y oppose; 3) C’est une bonne nouvelle que la gauche française ne parle plus de #Frexit", "timestamp": "11:23 - 22. März 2019", "retweet_count": "15", "favorite_count": "27", "author": "PhMarliere", "is_retweet": true}, {"text": "Un des rares effets positifs du #Brexit, l’attitude du public vis-à-vis de l’immigration: négative avant le référendum et très positive aujourd’hui. La campagne #pro-Brexit était nationaliste et xénophobe. Le sondage montre un rejet de ces positionnements.", "timestamp": "07:36 - 22. März 2019", "retweet_count": "20", "favorite_count": "17", "author": "PhMarliere", "is_retweet": true}, {"text": "‘When Hannah Arendt was herded into a detention camp in 1940, she did one of the most sensible things you can do when you are trapped in a real-life nightmare: she read Proust, Clausewitz’s On War &, compulsively, the detective stories of Georges Simenon.’", "timestamp": "06:30 - 22. März 2019", "retweet_count": "2", "favorite_count": "6", "author": "PhMarliere", "is_retweet": true}, {"text": "Quinze ans après, une étude scientifique montre les effets discriminatoires de la loi de 2004. L’interdiction du port du hijab en classe a instauré une forte inégalité entre les élèves. D’un point de vue pratique et moral, cette loi est injustifiable.", "timestamp": "02:50 - 21. März 2019", "retweet_count": "26", "favorite_count": "42", "author": "PhMarliere", "is_retweet": true}, {"text": "Le fait que dans la FI nombre de cadres et de militants s’y réfèrent positivement montre que la critique du Diplo rate sa cible (en plus de montrer une ignorance des débats en cours à gauche)", "timestamp": "01:28 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "PhMarliere", "is_retweet": true}, {"text": "“Le pluralisme est un puissant instrument de pacification sociale.” J’ajouterais que le pluralisme réel, basé sur une démarche pragmatique, est un instrument au service de l’égalité. Food for thought pour une partie de la gauche qui est pseudo-pluraliste.", "timestamp": "00:46 - 21. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "PhMarliere", "is_retweet": true}, {"text": "Comme le dit Moretti dans le docu: \"Io non sono imparziale\". ;-)", "timestamp": "04:26 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "PhMarliere", "is_retweet": true}, {"text": "Mais tu sais bien que le compromis historique est le contrecoup du coup d'Etat fasciste au Chili. Berlinguer en conclut que sans democratie, le projet d'une societe socialiste n'est que pure illusion.", "timestamp": "04:25 - 20. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "PhMarliere", "is_retweet": true}, {"text": "\"Memories of the Future\", Siri Hustvedt's latest novel, is about the incomprehensibility of time and the fragility of memory; the strengths, failings and enigmas of fiction; misogyny, authority, entitlement and selfhood. She is such a great writer.", "timestamp": "03:05 - 20. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "PhMarliere", "is_retweet": true}, {"text": "Nanni Moretti raconte l'histoire des réfugiés politiques chiliens qui disent avoir retrouvé dans l'Italie des années 70 avec son PCI, le réseau des associations et des syndicats, le rêve du Chili socialiste d'Allende. Belle Italie, inestimable Moretti.", "timestamp": "02:57 - 20. März 2019", "retweet_count": "9", "favorite_count": "37", "author": "PhMarliere", "is_retweet": true}, {"text": "\"The #Christchurch terrorist is from the far right, but the ideology he stands for has been spread by the mainstream media & intellectuals. It has been exported from France to a country that has one of the lowest murder rates in the world.\" @RokhayaDiallo", "timestamp": "14:46 - 19. März 2019", "retweet_count": "80", "favorite_count": "83", "author": "PhMarliere", "is_retweet": true}, {"text": "“Vous ne m’entendrez pas prononcer son nom.” Jacinda Ardern, l’exemplaire première ministre néo-zélandaise ne fera pas cet honneur au criminel de #Christchurch. Par contre, ses idées criminelles (ex: le “Grand remplacement”) doivent être réfutées dans le débat public.", "timestamp": "11:06 - 19. März 2019", "retweet_count": "23", "favorite_count": "56", "author": "PhMarliere", "is_retweet": true}, {"text": "Co-signataire de cet appel pour que la gauche prenne au sérieux la lutte contre l'antisémitisme: \"Nous affirmons qu’aucun acte antisémite n’est acceptable, quel qu’en soit l’auteur et ne peut être occulté ou amoindri pour quelque raison que ce soit.\"", "timestamp": "23:56 - 18. März 2019", "retweet_count": "31", "favorite_count": "67", "author": "PhMarliere", "is_retweet": true}, {"text": "Il y a un an, la communaute juive de Pittsburgh, frappee par une attaque meurtriere, avait recu une donation des musulman.e.s de Pittsburgh. Elle vient a son tour en aide aux musulman.e.s de #Christchurch. La plus belle reponse aux racistes fanatiques.", "timestamp": "14:00 - 18. März 2019", "retweet_count": "53", "favorite_count": "107", "author": "PhMarliere", "is_retweet": true}, {"text": "Comment s’étonner que la thèse du Grand remplacement qui a inspiré le tueur de #Christchurch soit devenue \"acceptable\" en France et ailleurs? Nous avons une \"gauche\" populiste qui ne cesse de dire qu’il y a trop d’immigré.e.s et que nous avons atteint un seuil migratoire limite.", "timestamp": "08:01 - 18. März 2019", "retweet_count": "55", "favorite_count": "174", "author": "PhMarliere", "is_retweet": true}, {"text": "Novel: A small tale, generally of love.\nSamuel Johnson (A Dictionary of the English Language, 1755).", "timestamp": "05:02 - 18. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "PhMarliere", "is_retweet": true}, {"text": "Lors de son allocution à la mosquée de #Christchurch, la première ministre Jacinda Ardern portait un hijab: c’est un geste de compassion, mais c’est aussi un geste de respect et de solidarité envers les musulmanes qui portent le hijab et sont victimes des attaques islamophobes.", "timestamp": "00:51 - 18. März 2019", "retweet_count": "68", "favorite_count": "242", "author": "PhMarliere", "is_retweet": true}, {"text": "La première ministre Jacinda Ardern se rend sur les lieux de la tuerie à #Christchruch. Des gestes de compassion très touchants. Un exemple pour toutes et tous.", "timestamp": "00:35 - 18. März 2019", "retweet_count": "18", "favorite_count": "53", "author": "PhMarliere", "is_retweet": true}, {"text": "#Venezuela. Un entretien important avec Marc St-Upery, journaliste en Équateur. #Maduro, le chavisme, intervention US, des réponses aux mensonges et aux fantasmes ”révolutionnaires” d’une gauche radicale qui continue de soutenir la dictature madurienne.", "timestamp": "00:21 - 18. März 2019", "retweet_count": "1", "favorite_count": "4", "author": "PhMarliere", "is_retweet": true}, {"text": "L’#islamophobie n’est pas une opinion respectable mais exprime la haine des musulman.e.s. Ce n’est pas une critique de l’Islam, mais un racisme. Ses victimes sont souvent des populations racisées originaires des ex-colonies. L’islamophobie est mainstream.", "timestamp": "00:50 - 17. März 2019", "retweet_count": "292", "favorite_count": "460", "author": "PhMarliere", "is_retweet": true}, {"text": "Le “Grand remplacement” est une idéologie blanche suprémaciste. Elle inspire des néo-nazis et tue des innocents. Il ne peut y avoir de liberté d’expression pour la propagation de ces idées criminelles dans les médias. Ces derniers y perdent toute crédibilité. #Christchurch", "timestamp": "08:57 - 16. März 2019", "retweet_count": "49", "favorite_count": "75", "author": "PhMarliere", "is_retweet": true}, {"text": "Sadiq Khan, le maire de Londres, est désigné comme cible dans le pamphlet de l’assassin islamophobe de Nouvelle Zélande. Musulman, Khan répond que Londres, face au danger, restera une ville multiculturelle, ouverte et tolérante. Très fier de mon maire. ", "timestamp": "07:41 - 16. März 2019", "retweet_count": "435", "favorite_count": "1356", "author": "PhMarliere", "is_retweet": true}, {"text": "Journaliste sur la BBC radio 4 à 13h: « Les personnes qui ne comprennent pas ce qu’est l’#Islamaphobie ou qui rejettent ce terme sont celles qui sont le plus susceptibles d’être sensibles aux idées islamophobes. »", "timestamp": "06:57 - 16. März 2019", "retweet_count": "127", "favorite_count": "240", "author": "PhMarliere", "is_retweet": true}, {"text": "L’assassin en Nouvelle Zélande s'est inspiré de la thèse du “Grand remplacement” de Renaud Camus. Interrogé par le @washingtonpost, Camus dit qu’il condamne la violence, mais pas l’usage qui est faite de sa thèse par l’extrême droite. Lâche admission.", "timestamp": "18:47 - 15. März 2019", "retweet_count": "21", "favorite_count": "32", "author": "PhMarliere", "is_retweet": true}, {"text": "Co-signataire de ce texte qui appelle à la résistance à la répression d’Etat contre les mouvements sociaux (avec l’interdiction des armes mutilantes), et s’engage à promouvoir un véritable Etat de droit, démocratique et émancipateur. #GiletsJaunes", "timestamp": "10:24 - 15. März 2019", "retweet_count": "2", "favorite_count": "7", "author": "PhMarliere", "is_retweet": true}]