[{"text": "Lawsuit filed in DC federal court to compel release of Mueller report", "timestamp": "08:54 - 23. März 2019", "retweet_count": "19", "favorite_count": "26", "author": "rachelweinerwp", "is_retweet": true}, {"text": "Also in govt. filing from Chelsea Manning case: “Criminal acts committed by citizens and journalists alike in obtaining information is a proper subject of inquiry ... [We're] confident that its questioning will pose no legitimate First Amendment concerns.”", "timestamp": "12:46 - 21. März 2019", "retweet_count": "1", "favorite_count": "2", "author": "rachelweinerwp", "is_retweet": true}, {"text": "Govt. said Manning’s “testimony is highly relevant to an ongoing criminal investigation,\" so much so that they granted her immunity from both federal and military prosecution", "timestamp": "09:31 - 21. März 2019", "retweet_count": "16", "favorite_count": "16", "author": "rachelweinerwp", "is_retweet": true}, {"text": "Unsealed docs shed light on dynamic in Chelsea Manning case — government thinks she did not tell truth at court martial, she thinks they want to undermine her credibility in case she testifies in Julian Assange’s defense https://wapo.st/2FrlT7j ", "timestamp": "09:22 - 21. März 2019", "retweet_count": "63", "favorite_count": "62", "author": "rachelweinerwp", "is_retweet": true}, {"text": "All the Michael Cohen search warrants: https://wapo.st/2JBGbiP ", "timestamp": "06:15 - 19. März 2019", "retweet_count": "5", "favorite_count": "8", "author": "rachelweinerwp", "is_retweet": true}, {"text": "Supreme Court will decide if Beltway sniper who was 17 at time of killings can challenge his life sentence", "timestamp": "07:04 - 18. März 2019", "retweet_count": "11", "favorite_count": "6", "author": "rachelweinerwp", "is_retweet": true}, {"text": "AUSA Jim Gillis said he has a \"hair trigger\" instinct to hand over anything that could be used to challenge Mike Flynn's testimony, but that defense can't just go on \"a frolic through everything else\" the special counsel has investigated", "timestamp": "09:17 - 15. März 2019", "retweet_count": "8", "favorite_count": "24", "author": "rachelweinerwp", "is_retweet": true}]