[{"text": "Dire situation. Not sure how much their slots at airports are worth. Probably quite a bit with our airports getting crowded. But lenders will have to take a huge haircut", "timestamp": "00:35 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "raoabhijeet", "is_retweet": true}, {"text": "Happy Holi everyone! I have mastered the back lanes of the neighborhood so I managed to go out and come back without getting any color put on me. Some kids tried to douse me with a bucket of water but missed. Next up: dodging some relatives arriving with organic colors!", "timestamp": "00:32 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "raoabhijeet", "is_retweet": true}, {"text": "After twin Boeing 737 Max crashes other countries may rely less on FAA certification and do their own aircraft safety assessments.", "timestamp": "19:48 - 19. März 2019", "retweet_count": "1", "favorite_count": "0", "author": "raoabhijeet", "is_retweet": true}, {"text": "Thread. ", "timestamp": "18:43 - 18. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "raoabhijeet", "is_retweet": true}, {"text": "‘Sacred Games’ was Ok. Had a book as an underlying text. ‘Made in Heaven’ - couldn’t get through two shows. Netflix has a Delhi Crime show - dialogue looks awful.", "timestamp": "09:09 - 18. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "raoabhijeet", "is_retweet": true}, {"text": "My advice to Amazon Prime and Netflix is don’t be in a hurry to green light Indian content. Make sure it meets universal standards of excellence. Some recent web series have been very sub par.", "timestamp": "09:00 - 18. März 2019", "retweet_count": "0", "favorite_count": "7", "author": "raoabhijeet", "is_retweet": true}, {"text": "A very nice tribute", "timestamp": "20:36 - 17. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "raoabhijeet", "is_retweet": true}, {"text": "We should value honest and hard working politicians when we have them in our midst. Don’t mistake humbleness and dignity for lack of stature. Any day I’d rather have a Manohar Parrikar running a part of the country than some of our other entitled politicians", "timestamp": "07:52 - 17. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "raoabhijeet", "is_retweet": true}, {"text": "Really sad to hear of this. An honest and hard working leader. He maintained his composure and dignity throughout.", "timestamp": "07:39 - 17. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "raoabhijeet", "is_retweet": true}, {"text": "According to some experts Boeing should have opted for a clean sheet design rather than refreshing the 50 year old 737.", "timestamp": "04:06 - 16. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "raoabhijeet", "is_retweet": true}, {"text": "The Christchurch terrorist not only filmed his attack but also posted a lengthy manifesto espousing white supremacist ideology. And since he was caught alive he will likely use his trial to further disseminate his bigotry.", "timestamp": "19:02 - 15. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "raoabhijeet", "is_retweet": true}]