[{"text": "Per @alanhe, the letters from House and Senate Democrats demanding the preservation of all documents, communication and evidence amassed by Mueller went to NSA, DNI, State Dept, Treasury, White House counsel, CIA, DOJ, FBI, and IRS.", "timestamp": "16:36 - 23. März 2019", "retweet_count": "1", "favorite_count": "3", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "According to a source on the House Dems conference call this afternoon, @SpeakerPelosi said she would reject any classified briefing on the Mueller report for the Gang of 8 or any other groups because she believes members must be able to discuss the findings publicly.", "timestamp": "13:31 - 23. März 2019", "retweet_count": "20", "favorite_count": "32", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "@SpeakerPelosi tells House Dems committee chairs will brief members on a 3 pm call even though the full Mueller report isn’t out yet. She also insists any briefings about the report be unclassified so members can discuss them and that underlying findings should be made public.", "timestamp": "10:42 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "DOJ has told lawmakers not to expect anything more on the Mueller report today, a committee aide says.", "timestamp": "10:30 - 23. März 2019", "retweet_count": "2", "favorite_count": "0", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "Statement from @RepJerryNadler @RepCummings @RepAdamSchiff @RepMaxineWaters @RepRichardNeal and @RepEliotEngel on the Mueller report —>", "timestamp": "16:14 - 22. März 2019", "retweet_count": "6", "favorite_count": "4", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "Jared Kushner and Ivanka Trump's lawyer responds to the @OversightDems claims about their communication on email and WhatsApp (h/t @saraecook) -->", "timestamp": "12:47 - 21. März 2019", "retweet_count": "4", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "The White House has denied a request for more information on Trump-Putin communications from House Oversight/Foreign Affairs/Intel, citing various legal precedents to say the executive branch has full authority over diplomacy and Congress cannot demand demand full disclosure.", "timestamp": "12:39 - 21. März 2019", "retweet_count": "1", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": ".@RepCummings is demanding the White House provide a briefing and more information about email practices of administration officials, revealing in a letter that the Oversight Committee has learned Jared Kushner sometimes uses WhatsApp to conduct government business.", "timestamp": "10:03 - 21. März 2019", "retweet_count": "4", "favorite_count": "4", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "Both Hope Hicks and AMI, the owner of the National Enquirer, have agreed to turn over documents to the House Judiciary Committee in response to their request for documents for an investigation into the Trump administration obstruction of justice and abuse of power.", "timestamp": "15:02 - 20. März 2019", "retweet_count": "234", "favorite_count": "552", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "Happy birthday, @cspan!", "timestamp": "12:01 - 19. März 2019", "retweet_count": "0", "favorite_count": "5", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "Thankful that it's recess so I had the time to read this entire illuminating profile of @staceyabrams by @rtraister:", "timestamp": "10:49 - 19. März 2019", "retweet_count": "1", "favorite_count": "4", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "\"It is my hope that we will receive cooperation from the remainder of the list, and will be working to find an appropriate accommodation with any individual who may be reluctant to cooperate with our investigation,” Nadler says.", "timestamp": "15:08 - 18. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": ".@RepJerryNadler says he has heard from “a large number” of the 81 people and orgs who received document requests for @HouseJudiciary investigation into Trump admin obstruction of justice and abuse of power. Ongoing talks with ppl who have said they would like a subpoena.", "timestamp": "15:08 - 18. März 2019", "retweet_count": "4", "favorite_count": "3", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "Joint statement from @SenSchumer and @SpeakerPelosi: \"“The facts in this situation are very concerning and we urge Director Wray to adhere to the joint bicameral requests of the Democratic Senate ranking members and Democratic House chairmen and start an investigation.”", "timestamp": "12:23 - 18. März 2019", "retweet_count": "13", "favorite_count": "12", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "The House will vote to override Trump’s veto of the national emergency termination, per two leadership aides. Vote likely to occur 3/26.", "timestamp": "11:03 - 15. März 2019", "retweet_count": "15", "favorite_count": "24", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "“We should end the federal prohibition on marijuana.” And says the US can work to make it “not cool” for younger kids to reduce use while also helping reduce black and brown Americans in prison.", "timestamp": "06:34 - 14. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": ".@BetoORourke on the green new deal: “We face catastrophe and crisis on this planet even if we were to stop emitting carbon today...we have no more than 12 years to take incredibly bold action.” He expesses admiration for “young people” who have stepped up to propose solutions.", "timestamp": "06:28 - 14. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "First question to presidential candidate ⁦@BetoORourke⁩ is about prescription drug prices. \n\n“Let’s spread those costs out far more equitably,” he says of healthcare.", "timestamp": "06:18 - 14. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": ".@edokeefe and I will be along for the ride on his first full day as a presidential candidate. Tune in to @CBSThisMorning and @CBSEveningNews today for more — and then come@back for the @GayleKing interview tomorrow.", "timestamp": "03:20 - 14. März 2019", "retweet_count": "2", "favorite_count": "16", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "In a brief statement, @SpeakerPelosi says the House won’t take up legislation to amend the National Emergencies Act if the Senate passes that in order to avoid passing a House resolution to terminate the national emergency over the border.", "timestamp": "06:55 - 13. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": ".@RepSamGraves: “If at any point in the investigation the FAA's safety experts determine that additional steps must be taken to ensure the safety of the flying public, I will support their determination.\" He and @RepPeterDeFazio stop short of calling for 787 MAX 8 to be grounded.", "timestamp": "11:49 - 12. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "More support for @SpeakerPelosi on tamping down push for impeachment. @LeaderHoyer says the probability of success is low and distraction would be major.", "timestamp": "08:45 - 12. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": ".@RepJeffries tries to tamp down impeachment talk:\n\n“We did not run on impeachment, we did not win on impeachment, we are not governing with a focus on impeachment,” he says.", "timestamp": "08:04 - 12. März 2019", "retweet_count": "2", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "Hearing the words “New Democrat socialists” on repeat from @GOPLeader at a press conference today. Bet that’s a label we will be hearing a lot between now and November 2020.", "timestamp": "07:17 - 12. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "At the Economic Club of Washington, @SpeakerPelosi tells a cute anecdote about her daughter Alexandra's response when she was weighing her first congressional bid.\n\n\"Mother. Get a life. What teenage girl would not want her mother gone three nights a week?\"", "timestamp": "10:27 - 8. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "I recently said \"danger, Will Robinson\" to our intern. He had no idea what I was talking about. And a few days ago I joked that a young staffer should go all Office Space on his computer. Once again, the reference didn't land. :/", "timestamp": "09:45 - 8. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "More @GOPLeader on the GOP response to Trump saying there were fine people on both sides of the aisle in Charlottesville: \"I wasn't leader at the time, I think you heard a number of members who spoke out on that.\" Didn't answer a follow up about why no GOP resolution in response.", "timestamp": "09:43 - 8. März 2019", "retweet_count": "10", "favorite_count": "11", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "On @Liz_Cheney no vote on yesterday’s resolution condemning anti-Semitism and anti-Muslim bigotry, @GOPLeader said his conference is “stronger when we all vote together” but that everyone has their own voting card.", "timestamp": "09:07 - 8. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "Per a spokesperson for the House Intelligence Committee: “Due to scheduling issues, the Committee has moved Mr. Sater’s open interview to March 27. He continues to cooperate with the committee.”", "timestamp": "08:52 - 8. März 2019", "retweet_count": "2", "favorite_count": "2", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "House Dems passed their signature legislative initiative, HR 1, by a vote of 234 to 193. Aims to make it easier to vote, reduce dark $ in politics, strengthen ethics & reduce gerrymandering. Republicans call it the \"Democratic Politician Protection Act\" aimed to keep Ds in power.", "timestamp": "08:41 - 8. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "This is the first time Omar has spoken on the resolution that passed today condemning anti-Semitism and anti-Muslim bigotry -->", "timestamp": "15:48 - 7. März 2019", "retweet_count": "3", "favorite_count": "1", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "The House is now voting on the final version of the resolution condemning anti-Semitism and anti-Muslim bigotry: https://docs.house.gov/billsthisweek/20190304/BILLS-116hres183-SUSv1.pdf …\n\nIt needs a 2/3 majority to pass.", "timestamp": "14:06 - 7. März 2019", "retweet_count": "106", "favorite_count": "427", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "Here’s the text of the anti-Semitism/anti-hate resolution up for a vote this afternoon: https://docs.house.gov/billsthisweek/20190304/BILLS-116hres183-SUS.pdf …", "timestamp": "10:33 - 7. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "In a letter to @RepJerryNadler, @RepDougCollins says the investigation launched Monday is an abuse of the committee’s oversight power because it has no valid legislative purpose and encroaches on law enforcement, unconstitutional, an abuse of free speech: https://gallery.mailchimp.com/0275399506e2bdd8fe2012b77/files/cc3640b9-323a-4798-8205-88e8cad68f7c/3.07.19_DAC_Nadler_Investigations_.pdf?utm_source=Collins+Judiciary+Press+List&utm_campaign=391ef859e2-EMAIL_CAMPAIGN_2019_03_07_01_35&utm_medium=email&utm_term=0_ff92df788e-391ef859e2-169041873 …", "timestamp": "10:13 - 7. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "RebeccaRKaplan", "is_retweet": true}, {"text": "More on what's next for Democrats as they prepare to vote on a resolution condemning anti-Semitism, Islamophobia and white supremacy:", "timestamp": "09:37 - 7. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "RebeccaRKaplan", "is_retweet": true}]