[{"text": "In 1902, German New Guinea started building the Blanche Bay ring road in Rabaul. The proposed road ended up meeting the sheer rock face at Blue Lagoon so had to be diverted inland to Malaguna. A large labour force was used to build this road by hand. It was completed in 1907 #PNG", "timestamp": "15:25 - 22. März 2019", "retweet_count": "9", "favorite_count": "45", "author": "Tavurvur", "is_retweet": true}, {"text": "Our border must have hallucinogenic properties. When foreign direct investment enters #PNG, practices that were illegal, unacceptable, or discouraged in their home countries suddenly become modus operandi. Legality does not equate to best practice.", "timestamp": "15:47 - 20. März 2019", "retweet_count": "2", "favorite_count": "13", "author": "Tavurvur", "is_retweet": true}, {"text": "Lots of gov and business execs patting themselves on the back at recent #PNG Petroleum & Energy Summit. Doesn't mean much to make the Top-10 energy producing list if the same country is bottom percentile in global education, health and social/welfare indicators.", "timestamp": "15:15 - 19. März 2019", "retweet_count": "15", "favorite_count": "46", "author": "Tavurvur", "is_retweet": true}, {"text": "George Brown High School student on potholes: \"We have grown up with the potholes. However, the potholes have outgrown us and have become craters and are now turning into little lakes or swamps\". Can't really beat that #PNG", "timestamp": "16:02 - 18. März 2019", "retweet_count": "2", "favorite_count": "7", "author": "Tavurvur", "is_retweet": true}, {"text": "Albert Hahl, Governor of German New Guinea from 1902-1914 initially served as the colony's judge based in Herbertshohe (Kokopo) from 1896-1899. During this period he took a Tolai wife and had a son. What happened to the boy we don't know, but he may have ended up in Lapland #PNG", "timestamp": "17:05 - 16. März 2019", "retweet_count": "16", "favorite_count": "47", "author": "Tavurvur", "is_retweet": true}]