[{"text": "Congressional Democrats are calling for the Mueller report to be fully released, demands that are setting up a tug of war with Trump’s administration that federal judges might eventually have to referee. Via @AP:", "timestamp": "09:49 - 23. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "timelywriter", "is_retweet": true}, {"text": "A jury has acquitted a white ex-East Pittsburgh cop in the fatal shooting of an unarmed black teenager as he was fleeing a high-stakes traffic stop, a confrontation that was captured on video and led to weeks of unrest. Via @AP:", "timestamp": "07:43 - 23. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "A jury has begun deliberating over whether a white ex-East Pittsburgh cop was \"judge, jury and executioner\" when he shot an unarmed black teenager in the back, as prosecutors say, or was justified in using lethal force to stop a fleeing suspect. Via @AP: https://bit.ly/2YgxOw7 ", "timestamp": "16:43 - 22. März 2019", "retweet_count": "3", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "Mueller concludes the Russia-Trump investigation, with no new indictments. Via @AP:", "timestamp": "16:32 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "timelywriter", "is_retweet": true}, {"text": "HARRISBURG, Pa. (@AP) — Former Pennsylvania Attorney General Kathleen Kane is losing her law license, a few months after she began a jail sentence for perjury, obstruction and other counts. The Disciplinary Board of the state Supreme Court issued a disbarment order on Friday.", "timestamp": "11:21 - 22. März 2019", "retweet_count": "3", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "Via @AP: A survey of households found Pennsylvania's civilian labor force grew by 8,000, as employment rose by 15,000 to a new record high above 6.2M. Unemployment shrank by 5,000 to 261,000, its lowest level since 2000. Non-farm payrolls were essentially flat, shrinking by 200.", "timestamp": "08:26 - 22. März 2019", "retweet_count": "1", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "Via @AP: The national rate was 3.8% in February. Among states, Pennsylvania is tied with Michigan and New Jersey for the 35th lowest unemployment rate.", "timestamp": "08:25 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "timelywriter", "is_retweet": true}, {"text": "HARRISBURG, Pa. (@AP) — Pennsylvania's unemployment rate dropped in February to the lowest rate since 1976, which is as far back as state records go. The state Department of Labor and Industry said Friday that Pennsylvania's rate dropped by 1/10th of a percentage point to 4.0%.", "timestamp": "08:24 - 22. März 2019", "retweet_count": "9", "favorite_count": "10", "author": "timelywriter", "is_retweet": true}, {"text": "Mother Russia: Every year, hundreds of pregnant Russian women travel to the US to give birth so their child can acquire the privileges of American citizenship, sometimes paying $50K to brokers who arrange their travel documents and hospital stays. Via @AP:", "timestamp": "06:48 - 22. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "timelywriter", "is_retweet": true}, {"text": "A white former police officer testified Thursday that he thought a weapon was pointed at him when he shot and killed an unarmed black teenager outside Pittsburgh last summer. Via AP:", "timestamp": "18:42 - 21. März 2019", "retweet_count": "4", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "Via @AP: Philadelphia health officials say they now believe 74 people have contracted mumps at Temple University. City Department of Health spokesman James Garrow said Wednesday there are 15 confirmed cases and 59 probable cases, all but three of them in Philadelphia.", "timestamp": "14:08 - 21. März 2019", "retweet_count": "3", "favorite_count": "2", "author": "timelywriter", "is_retweet": true}, {"text": "\"All of us have a better chance of replacing any of the Philadelphia 76ers starters than that happening.\" Pennsylvania lawmakers are urged to rescue a turnpike commission that is deep in debt from payments it must make to the state. Via @AP:", "timestamp": "13:59 - 21. März 2019", "retweet_count": "2", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "The New York-based Center for Reproductive Rights said it would sue  Mississippi to try to block the law from taking effect July 1. Bryant's action came despite a federal  judge's decision last year striking down a less-restrictive law limiting abortions in the state. #abortion", "timestamp": "11:36 - 21. März 2019", "retweet_count": "3", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "JACKSON, Miss. (@AP) — Mississippi Gov. Phil Bryant on Thursday signed one of  the strictest #abortion laws in the nation, a measure that bans most abortions  once a fetal heartbeat can be detected, about six weeks into pregnancy.", "timestamp": "11:31 - 21. März 2019", "retweet_count": "3", "favorite_count": "5", "author": "timelywriter", "is_retweet": true}, {"text": "PHILADELPHIA (@AP) — US customs officials say drug dogs sniffed out  Philadelphia's largest seizure of cocaine in more than 20 years. Officials said Thursday that 450 bricks of cocaine were found inside 13 duffel bags in a shipping container, or more than 1,185 pounds worth $38M.", "timestamp": "09:54 - 21. März 2019", "retweet_count": "6", "favorite_count": "12", "author": "timelywriter", "is_retweet": true}, {"text": "HOUSTON (@AP) — National Guard troops have been called in and residents were told to stay inside after elevated levels of benzene were detected early Thursday near a Houston-area petrochemicals storage facility that caught fire this week.", "timestamp": "06:28 - 21. März 2019", "retweet_count": "1", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "DETROIT (@AP) — Allegheny County Controller Chelsa Wagner and her husband have been charged following an altercation with police in a Detroit hotel. Wayne County prosecutors say the 41-year-old Wagner faces felony resisting police and misdemeanor disorderly conduct charges.", "timestamp": "13:46 - 20. März 2019", "retweet_count": "2", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "PHILADELPHIA (@AP) — Philadelphia health officials say they've now believe 67  people have contracted mumps at Temple University. The Centers for Disease Control and Prevention say the measles-mumps-rubella vaccine is the best way for people to protect themselves against it.", "timestamp": "06:19 - 20. März 2019", "retweet_count": "4", "favorite_count": "7", "author": "timelywriter", "is_retweet": true}, {"text": "O’Rourke’s appearance was the splashiest of any presidential hopeful who has ventured into Pennsylvania this year. He attracted a bank of TV cameras and waded through hundreds of fans in Penn State’s student union who shouted questions or sought autographs, selfies or handshakes.", "timestamp": "15:19 - 19. März 2019", "retweet_count": "0", "favorite_count": "4", "author": "timelywriter", "is_retweet": true}, {"text": "Beto O'Rourke makes early impression in presidential campaign visit to late-voting Pennsylvania. Via @AP:", "timestamp": "12:52 - 19. März 2019", "retweet_count": "2", "favorite_count": "7", "author": "timelywriter", "is_retweet": true}, {"text": "Beto O’Rourke spoke for 50 minutes and then gets mobbed on his way out in Penn State’s student union ...", "timestamp": "09:51 - 19. März 2019", "retweet_count": "2", "favorite_count": "12", "author": "timelywriter", "is_retweet": true}, {"text": "Beto O’Rourke rally starting here at Penn State. Several hundred in attendance. Pennsylvania primary is one year and 40 days away.", "timestamp": "07:42 - 19. März 2019", "retweet_count": "0", "favorite_count": "7", "author": "timelywriter", "is_retweet": true}, {"text": "Via @AP: Members of Congress say money for four projects in Pennsylvania are at risk of being diverted to help finance a US-Mexico border wall. That includes $71M for a submarine propeller manufacturing facility in Philly and $18M to expand Pittsburgh's Air Force Reserve station.", "timestamp": "19:21 - 18. März 2019", "retweet_count": "14", "favorite_count": "14", "author": "timelywriter", "is_retweet": true}, {"text": "Was hoping he’d launch a 30-footer at the buzzer over Kyrie’s head ...", "timestamp": "18:49 - 18. März 2019", "retweet_count": "1", "favorite_count": "3", "author": "timelywriter", "is_retweet": true}, {"text": "A western Pennsylvania state lawmaker has resigned two months after being stripped of a chairmanship following allegations that he had sex with an incapacitated woman against her will. Via @AP:", "timestamp": "15:16 - 18. März 2019", "retweet_count": "8", "favorite_count": "18", "author": "timelywriter", "is_retweet": true}, {"text": "A former Pennsylvania pediatrician is sentenced to at least 79 years in prison for the sexual assault of 31 children, most of them patients, as his now-adult victims blasted their abuser and the system that let him get away with it for so long. Via @AP:", "timestamp": "14:00 - 18. März 2019", "retweet_count": "1", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "They are talking about nuclear power in Pennsylvania’s Capitol, and across rural Pennsylvania. Via @AP:", "timestamp": "07:33 - 16. März 2019", "retweet_count": "1", "favorite_count": "2", "author": "timelywriter", "is_retweet": true}, {"text": "Mass shootings at New Zealand mosques kill 49; 1 man charged. Via @AP:", "timestamp": "04:11 - 15. März 2019", "retweet_count": "1", "favorite_count": "0", "author": "timelywriter", "is_retweet": true}, {"text": "I'm reading a political story in which Pennsylvania is referred to as a \"midwestern\" state. Thoughts anybody?", "timestamp": "14:13 - 14. März 2019", "retweet_count": "1", "favorite_count": "19", "author": "timelywriter", "is_retweet": true}, {"text": "JERUSALEM (@AP) — Palestinian militants in the Gaza Strip fired two rockets  toward Tel Aviv late Thursday, the Israeli military said. No damage or injuries were reported. But it marked the first time Tel Aviv has been targeted by rocket fire since a 2014 war with Gaza militants.", "timestamp": "14:11 - 14. März 2019", "retweet_count": "6", "favorite_count": "4", "author": "timelywriter", "is_retweet": true}, {"text": "The nuclear power industry is pushing the Nuclear Regulatory Commission to cut back inspections at nuclear plants and throttle back what it tells the public about plant problems. The agency is listening. Via @AP:", "timestamp": "12:40 - 14. März 2019", "retweet_count": "6", "favorite_count": "3", "author": "timelywriter", "is_retweet": true}, {"text": "WASHINGTON (@AP) — Senate votes to terminate Trump's emergency declaration  for border, forcing veto showdown over use of executive power.", "timestamp": "12:05 - 14. März 2019", "retweet_count": "3", "favorite_count": "2", "author": "timelywriter", "is_retweet": true}, {"text": "Eight high-level members of a drug gang blamed for as many as eight homicides in one Pennsylvania community have been indicted on federal drug-trafficking and weapons offenses. Via @AP:", "timestamp": "11:51 - 14. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "timelywriter", "is_retweet": true}, {"text": "GAZA CITY, Gaza Strip (@AP) — Hamas forces in the Gaza Strip have forcibly  dispersed hundreds of Palestinians protesting dire living conditions. Videos on social media Thursday showed police firing live rounds in the air, beating protesters and hauling them into police vehicles.", "timestamp": "11:45 - 14. März 2019", "retweet_count": "1", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "WASHINGTON (@AP) — GOP Sens. Lamar Alexander of Tennessee, Mitt Romney of Utah and Pat Toomey of Pennsylvania said they'd vote for a resolution to annul the border emergency President Trump declared last month. That raised GOP defections to 8 — above the 4 needed to pass it.", "timestamp": "11:38 - 14. März 2019", "retweet_count": "26", "favorite_count": "96", "author": "timelywriter", "is_retweet": true}, {"text": "Toomey, cont. \" ... if president, she would make an emergency declaration  about climate change and who knows what kinds of unauthorized spending she would choose to engage in with that justification if we let this stand.” 3/3", "timestamp": "10:28 - 14. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "Toomey, cont. \" ... And it also sets a very dangerous precedent with respect to future presidents, and that is not an entirely a speculative concern. We have Elizabeth Warren running for president of the United States. She has  already declared that she would ... \" 2/", "timestamp": "10:27 - 14. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "timelywriter", "is_retweet": true}, {"text": "What Toomey said: “My concern is it undermines a very, very important principle of our constitution, which is the separate of powers, and specifically the responsibility that Congress has to determine how government money is spent. ... \" 1/", "timestamp": "10:26 - 14. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "timelywriter", "is_retweet": true}, {"text": "US Sen. Pat Toomey of Pennsylvania says he will vote in favor of a resolution to disapprove of President Trump's emergency resolution.", "timestamp": "09:49 - 14. März 2019", "retweet_count": "12", "favorite_count": "20", "author": "timelywriter", "is_retweet": true}, {"text": "Gun maker Remington can be sued over how it marketed the Bushmaster rifle used to kill 20 children and six educators at Sandy Hook Elementary School in 2012, a divided Connecticut Supreme Court ruled Thursday. Via @AP:", "timestamp": "09:25 - 14. März 2019", "retweet_count": "3", "favorite_count": "0", "author": "timelywriter", "is_retweet": true}]