[{"text": "Whoa! Great news.", "timestamp": "11:14 - 22. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Not only did we talk about my @firstthingsmag essay— https://www.firstthings.com/article/2019/03/a-new-conservative-agenda … —we started and ended with Willmoore Kendall. Great chat.", "timestamp": "10:06 - 22. März 2019", "retweet_count": "3", "favorite_count": "25", "author": "ToryAnarchist", "is_retweet": true}, {"text": "“The limited release product will also include commemorative flavors such as Mission Accomplished Mango, Tropical Troop Surge, Quagmire Citrus, and Poorly Defined War Aims Berry Punch.”", "timestamp": "09:42 - 22. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "ToryAnarchist", "is_retweet": true}, {"text": "There are bigger world markets for goods than ever before, and there’s no reason American production can’t serve more of those markets, including our own, if we take industry as seriously as other countries do.", "timestamp": "18:36 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "ToryAnarchist", "is_retweet": true}, {"text": "CTC is weak sauce compared to industrial policy that would mean well-paying jobs. It’s hard to imagine a woman thinking a man is marriageable because they might be eligible for credits after they have kids.", "timestamp": "18:29 - 21. März 2019", "retweet_count": "0", "favorite_count": "9", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Hope that helps. My impression was you might have had the answers you wanted to your own questions, but I’m happy to tell what I know if you’re interested. I’m just not interested in arguing about definitions.", "timestamp": "18:18 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "ToryAnarchist", "is_retweet": true}, {"text": "If a Kirkian is a conservative who takes his cues from Kirk, then a secular Kirkian is unlikely, and I can’t think of any, but perhaps not impossible. Robert Nisbet was effectively secular and politically Kirk-like, however. Heather Mac Donald is paleo-adjacent rather than paleo.", "timestamp": "18:17 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "ToryAnarchist", "is_retweet": true}, {"text": "PG likes Calvinism but is Jewish & wouldn’t identify as secular. Kirk was a Stoic as a young man, became broadly Christian/theistic, finally Catholic. Francis’s family Presbyterianism was absent from his public thought; he’s said to have converted Catholic on his deathbed.", "timestamp": "18:13 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Unlike “conservative” @nytdavidbrooks, “socialist” @SenSanders is not quite there with “reparations.” And yes, we need scare quotes for politics in the age of centrist meltdown.", "timestamp": "18:03 - 21. März 2019", "retweet_count": "3", "favorite_count": "11", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Did they ever ask that about Trump?", "timestamp": "17:43 - 21. März 2019", "retweet_count": "1", "favorite_count": "12", "author": "ToryAnarchist", "is_retweet": true}, {"text": "I think Biden is a balloon easily punctured, as we’re already seeing with the VP talk. He won’t excite audiences the way Beto and Bernie will, and he can easily stumble in the debates. He’s beatable.", "timestamp": "17:42 - 21. März 2019", "retweet_count": "0", "favorite_count": "1", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Not even the nomination? I think that’s what the very early VP talk is about.", "timestamp": "17:06 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "ToryAnarchist", "is_retweet": true}, {"text": "If there’s no “free market” banking because all banking is political, nothing dependent on banking is completely free market either. An economy structured by financial elites + govt isn’t “natural,” whether labeled “socialism” or not. One must deal with the politics consciously.", "timestamp": "17:04 - 21. März 2019", "retweet_count": "4", "favorite_count": "24", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Something I haven’t seen mentioned in the “Old Man Biden preemptively picks a running mate” stories—@SenSanders is a year older, yet nobody thinks he has to do that.", "timestamp": "16:09 - 21. März 2019", "retweet_count": "1", "favorite_count": "8", "author": "ToryAnarchist", "is_retweet": true}, {"text": "No—as I say, it’s not what @DouthatNYT wants; he’d like a Rubio without the foreign-policy baggage. But the only way to get such a thing is to make it clear just how much of a burden that baggage is.", "timestamp": "14:42 - 21. März 2019", "retweet_count": "0", "favorite_count": "0", "author": "ToryAnarchist", "is_retweet": true}, {"text": "“For the Sake of a Child Tax Credit, We Must Have War With Venezuela, Syria, Iraq (Again), Afghanistan (Still): The Reform Conservative Case for Rubio”—not what @DouthatNYT wants, but what’s actually on the menu. I’ll never understand the maximal priority on tax-code manipulation", "timestamp": "14:23 - 21. März 2019", "retweet_count": "1", "favorite_count": "12", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Brownson illustrates the danger of spiritualizing foreign policy—“The manifest destiny of this country is...the realization, we should say, of the Christian ideal of society for both the Old World and the New.” The faithful buy the ideal, but the reality is inept liberal empire.", "timestamp": "12:42 - 21. März 2019", "retweet_count": "6", "favorite_count": "16", "author": "ToryAnarchist", "is_retweet": true}, {"text": "There actually are people who insist on an open-ended commitment in Afghanistan (“endless war”). I’m not aware of anyone in American politics who argues for adopting the foreign policy of North Korea or the Tokugawa shogunate (“radical isolationism”).", "timestamp": "12:31 - 21. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Brilliant Biden campaign pre-launch emphasizing that the guy is too old to serve two terms. Or maybe even one. Why vote for a fossil, I asked last week:", "timestamp": "07:07 - 21. März 2019", "retweet_count": "8", "favorite_count": "14", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Kirkian conservatives are rarely if ever secular. Paleos have a secular branch represented (until his deathbed perhaps) by Sam Francis. There are few self-ID’d paleos in general, but a wider circle of paleo-adjacent secular cons includes Heather Mac Donald.", "timestamp": "13:32 - 20. März 2019", "retweet_count": "0", "favorite_count": "2", "author": "ToryAnarchist", "is_retweet": true}, {"text": "Cookie Monster has an infinite supply of cookies, doesn’t he?", "timestamp": "17:46 - 18. März 2019", "retweet_count": "0", "favorite_count": "3", "author": "ToryAnarchist", "is_retweet": true}, {"text": "A movement that bans plastic bags and straws but shuns nuclear power is not clean or green, it’s just bossy and onanistic.", "timestamp": "18:27 - 15. März 2019", "retweet_count": "13", "favorite_count": "72", "author": "ToryAnarchist", "is_retweet": true}]