[{"text": "More than a million of us marched.We will be patronised by the Corbynistas and theTory Brexit high command  as the anti-democrats, daring  profoundly to dispute what is happening to our beloved country.Beware! When a million are so moved,they are never wrong. A day of pride.", "timestamp": "14:36 - 23. März 2019", "retweet_count": "818", "favorite_count": "3389", "author": "williamnhutton", "is_retweet": true}, {"text": "More subdued, younger, more thoughtful than the last march. Keen awareness that Corbyn and his junta hold us in contempt. Its a contempt that is reciprocated. Labour has lost liberal England - a key part if its coalition.", "timestamp": "09:24 - 23. März 2019", "retweet_count": "838", "favorite_count": "2823", "author": "williamnhutton", "is_retweet": true}, {"text": "It would have taken courage and judgement for Blair to heed the million who marched against the Iraq war. He didn’t have them - and his project and reputation collapsed. Corbyn ignores today’s million plus for the EU because of equal failings. He will pay the same price,", "timestamp": "04:50 - 23. März 2019", "retweet_count": "1531", "favorite_count": "5385", "author": "williamnhutton", "is_retweet": true}, {"text": "Good morning fellow friends, patriots and Europeans going to today’s rally. Look out for the InFacts stand at the bottom of Park Lane just before Hyde Park Corner. A bunch of us will be speaking between 12 and 2 as you inch your way past! Very best to everyone", "timestamp": "03:18 - 23. März 2019", "retweet_count": "155", "favorite_count": "638", "author": "williamnhutton", "is_retweet": true}, {"text": "We need every patriot in London on  March 23rd. CBI & TUC are right: this is a national emergency. May must go. A better deal agreed without her Faragist red lines. A referendum held on that or Remain. This right wing coup must be stopped; Tories split. Our numbers really count.", "timestamp": "18:27 - 21. März 2019", "retweet_count": "1087", "favorite_count": "2696", "author": "williamnhutton", "is_retweet": true}, {"text": "Mrs. May is playing a dark and dangerous game by pitching this as an impossible Parliament v. People’s will. So its to be a No Deal Brexit to hold her party together, blaming MPs? Contemptible. Corbyn- a 3rd rate partisan when we need a statesman - plays his games.Desperate times", "timestamp": "15:35 - 20. März 2019", "retweet_count": "811", "favorite_count": "2782", "author": "williamnhutton", "is_retweet": true}, {"text": "There are two global aviation safety regulators- the Federal Aviation Authority accountable to US Congress and the EU Aviation Safety Agency accountable to EU Parliament. As row grows why FAA let Boeing set own standards over 737 Max, only one counts. But UK now has zero control.", "timestamp": "19:44 - 19. März 2019", "retweet_count": "15", "favorite_count": "41", "author": "williamnhutton", "is_retweet": true}, {"text": "Decline and fall. Mrs May, relentlessly making Brexit a Tory only project, has steered the country to the cliff-edge. In the tea-rooms all Tory MPs can talk about is the succession. This is Caliguan decadence. There must be an extension + second referendum: remain or her deal.", "timestamp": "17:22 - 19. März 2019", "retweet_count": "931", "favorite_count": "2871", "author": "williamnhutton", "is_retweet": true}, {"text": "Important article. Britain’s private schools and the unjustified self-confidence and sense of entitlement they confer crucial part of the Brexit story.", "timestamp": "04:33 - 18. März 2019", "retweet_count": "108", "favorite_count": "248", "author": "williamnhutton", "is_retweet": true}, {"text": "Brexit is a civilisational choice - to opt for closure, intolerance and distrust of the other. Whatever the “deal”, millions of us will fight for a different idea of Britain", "timestamp": "02:23 - 17. März 2019", "retweet_count": "849", "favorite_count": "2062", "author": "williamnhutton", "is_retweet": true}]