[{"text": "Re-upping this from November on why Wisconsin will be at the epicenter of 2020 Prez race, a reality that drove Dem decision to hold its convention in Milwaukee (along with the cool summer breezes)", "timestamp": "11:54 - 11. März 2019", "retweet_count": "4", "favorite_count": "4", "author": "WisVoter", "is_retweet": true}, {"text": "Ditto", "timestamp": "11:43 - 11. März 2019", "retweet_count": "5", "favorite_count": "6", "author": "WisVoter", "is_retweet": true}, {"text": "My look at the Dem decision to come  to Wisconsin next summer", "timestamp": "10:52 - 11. März 2019", "retweet_count": "7", "favorite_count": "8", "author": "WisVoter", "is_retweet": true}, {"text": "Words of wisdom", "timestamp": "08:20 - 11. März 2019", "retweet_count": "2", "favorite_count": "14", "author": "WisVoter", "is_retweet": true}, {"text": "Two WI Republicans -- Jim Sensenbrenner and Mike Gallagher -- cited separation of powers and concerns about ceding too much power to the Executive Branch in voting against Pres. Trump's declaration of emergency at the Mexican border:", "timestamp": "17:15 - 26. Feb. 2019", "retweet_count": "3", "favorite_count": "4", "author": "WisVoter", "is_retweet": true}, {"text": "here is the statement by WI's Mike Gallagher, 1 of 13 House Republicans to vote against Pres. Trump's declaration of emergency at the border:", "timestamp": "16:52 - 26. Feb. 2019", "retweet_count": "9", "favorite_count": "12", "author": "WisVoter", "is_retweet": true}, {"text": "WI Rep Jim Sensenbrenner's statement on his vote to terminate President's emergency declaration (1 of 13 Republicans to vote that way):", "timestamp": "16:03 - 26. Feb. 2019", "retweet_count": "3", "favorite_count": "11", "author": "WisVoter", "is_retweet": true}, {"text": "WI's Sensenbrenner and Gallagher among the 13 House Republicans voting to terminate the president's emergency declaration. Both support wall funding, but both had voiced huge qualms about what they said was an effort to circumvent the legislative power of the purse.", "timestamp": "15:57 - 26. Feb. 2019", "retweet_count": "4", "favorite_count": "10", "author": "WisVoter", "is_retweet": true}, {"text": "WI's Jim Sensenbrenner, 1 of 13 House Republicans voting to terminate Trump's declaration of emergency, said in statement that while he backs wall funding, the emerg declaration \"sets a dangerous precedent which will undoubtedly be exploited by future administrations\"", "timestamp": "15:48 - 26. Feb. 2019", "retweet_count": "10", "favorite_count": "34", "author": "WisVoter", "is_retweet": true}, {"text": "Yes, lots of (not all) 2016 Trump voters were conflicted then, and conflicted now. But I don't think turnout explains by itself the massive swings in many smaller communities from Obama 2012 to Trump 2016. It was both turnout and vote-shifts in these places.", "timestamp": "14:24 - 26. Feb. 2019", "retweet_count": "0", "favorite_count": "0", "author": "WisVoter", "is_retweet": true}, {"text": "I agree that turnout is incredibly important. My point is that for Trump to win WI, the polling suggests he will at a minimum have to win the votes of a lot of people that have conflicting feelings about him. That doesn't mean Democrats can't win based on a turnout strategy", "timestamp": "13:43 - 26. Feb. 2019", "retweet_count": "0", "favorite_count": "1", "author": "WisVoter", "is_retweet": true}, {"text": "In last @MULawPoll in WI, 49% said they're certain to vote against Trump, 27% certain to vote for Trump. The other 24% \"uncommitted\" includes lots of conflicted center-to-right voters and soft Trump approvers. Trump needs to win vast majority of them.", "timestamp": "06:18 - 26. Feb. 2019", "retweet_count": "10", "favorite_count": "7", "author": "WisVoter", "is_retweet": true}, {"text": "At DC press conference this morning with other Dem governors, WI Gov Tony Evers reiterated that he will be asking for $1.4 billion increase in education in his new budget (as he has proposed)", "timestamp": "06:19 - 23. Feb. 2019", "retweet_count": "9", "favorite_count": "24", "author": "WisVoter", "is_retweet": true}, {"text": "WI GOP Rep Jim Sensenbrenner, 2nd in House seniority, told me that using an emergency declaration to circumvent will of Congress \"destroys the separation of powers.\" lots of unease on GOP side of aisle. Not saying how they'll vote", "timestamp": "06:10 - 20. Feb. 2019", "retweet_count": "7", "favorite_count": "8", "author": "WisVoter", "is_retweet": true}, {"text": "when I talked to DNC members from around the country about MKE's bid to host 2020 convention, the pros and cons were pretty clear: \nBiggest pluses: great summer weather; good political symbolism (blue-collar Midwest) \nBiggest ? -- is the city big enough?", "timestamp": "06:39 - 18. Feb. 2019", "retweet_count": "28", "favorite_count": "22", "author": "WisVoter", "is_retweet": true}, {"text": "In the end, Foxconn played a very marginal role in Scott Walker's defeat for governor in WI last fall.\nBut could it play a bigger role in next year's presidential contest in WI, with questions over the project's future and Pres. Trump's close ties to it?", "timestamp": "06:52 - 11. Feb. 2019", "retweet_count": "9", "favorite_count": "21", "author": "WisVoter", "is_retweet": true}, {"text": "WI is a good window into the tariff debate. Sean Duffy (R), Mike Gallagher (R) and Ron Kind (D) all represent WI cong districts carried by Trump. Duffy is pushing a bill to expand the president's tariff powers, the other 2 have a bill to curb them", "timestamp": "08:00 - 4. Feb. 2019", "retweet_count": "13", "favorite_count": "6", "author": "WisVoter", "is_retweet": true}, {"text": "thanks, Dan!", "timestamp": "10:11 - 31. Jan. 2019", "retweet_count": "0", "favorite_count": "0", "author": "WisVoter", "is_retweet": true}, {"text": "House Democrat @RepGwenMoore of Milwaukee announced at Ways and Means hearing on preexisiting conditions that she has cancer, saying it is manageable and her prognosis \"excellent.\"", "timestamp": "09:14 - 29. Jan. 2019", "retweet_count": "8", "favorite_count": "13", "author": "WisVoter", "is_retweet": true}, {"text": "latest @MULawPoll shows why winning WI again is such a climb for Trump. His hard base is 30% of reg'd voters (\"strongly\" approve). His soft support is 14% of RVs (\"somewhat\" approve). Certainty of voting for Trump drops from 76% in 1st group to 25% in 2nd", "timestamp": "05:29 - 28. Jan. 2019", "retweet_count": "31", "favorite_count": "60", "author": "WisVoter", "is_retweet": true}, {"text": "more on that confrontation over shutdown between Republicans Ron Johnson and Mitch McConnell in closed-door Senate GOP lunch Thursday:", "timestamp": "10:15 - 25. Jan. 2019", "retweet_count": "2", "favorite_count": "0", "author": "WisVoter", "is_retweet": true}, {"text": "I agree that \"nonpartisan\" polls very well", "timestamp": "14:05 - 24. Jan. 2019", "retweet_count": "0", "favorite_count": "1", "author": "WisVoter", "is_retweet": true}, {"text": "Trump's approval rating in WI in this poll (44%) is higher than it is nationally, but it has declined, and his disapproval is 52%. right now he is leaving himself a very narrow opening in WI in 2020", "timestamp": "12:38 - 24. Jan. 2019", "retweet_count": "0", "favorite_count": "2", "author": "WisVoter", "is_retweet": true}, {"text": "in what may be the last time for a while that this major WI pollster polls on ex-speaker @PRyan , Wisconsin voters are perfectly divided over Paul Ryan in new @MULawPoll \n42% view him favorably\n42% view him unfavorably", "timestamp": "12:17 - 24. Jan. 2019", "retweet_count": "1", "favorite_count": "0", "author": "WisVoter", "is_retweet": true}, {"text": "these are not good numbers in new WI poll", "timestamp": "11:01 - 24. Jan. 2019", "retweet_count": "8", "favorite_count": "18", "author": "WisVoter", "is_retweet": true}, {"text": "not a lot of national numbers on this question (phrased this way) but it provides an interesting base line in a battleground state going forward", "timestamp": "11:00 - 24. Jan. 2019", "retweet_count": "2", "favorite_count": "2", "author": "WisVoter", "is_retweet": true}, {"text": "in new @MULawPoll in Wisconsin, Trump approval down, though still higher than national ratings, from 47/50 app/disapp before election to 44/52 today", "timestamp": "10:56 - 24. Jan. 2019", "retweet_count": "3", "favorite_count": "0", "author": "WisVoter", "is_retweet": true}, {"text": "this result on unpopularity of shutdown from new WI poll by @mulawpoll seems in line with national polling", "timestamp": "10:51 - 24. Jan. 2019", "retweet_count": "5", "favorite_count": "3", "author": "WisVoter", "is_retweet": true}, {"text": "pretty one-sided polling result in WI  ...  for an issue that is so divisive among politicians in the 2 parties", "timestamp": "10:40 - 24. Jan. 2019", "retweet_count": "12", "favorite_count": "20", "author": "WisVoter", "is_retweet": true}, {"text": "on this House vote today, 3 WI Republicans broke with Trump to oppose lifting of sanctions: Gallagher, Duffy, Steil. \nGrothman voted the Trump Admin position, Sensenbrenner (just had hip surgery) did not vote. \nIn Senate Wed, R Johnson sided with Trump Admin on this issue.", "timestamp": "11:01 - 17. Jan. 2019", "retweet_count": "6", "favorite_count": "9", "author": "WisVoter", "is_retweet": true}, {"text": "also, overall opinion on Trump is more intense in both directions.  \"Strong\" approval (33%) and \"strong\" disapproval (50%) have both risen in @QuinnipiacPoll", "timestamp": "11:53 - 15. Jan. 2019", "retweet_count": "0", "favorite_count": "0", "author": "WisVoter", "is_retweet": true}, {"text": "GOP Cong. Glenn Grothman of WI, 1 of 7 in the House to vote against ensuring back pay for furloughed federal workers, said the bill could mean paying people for \"months\" of not working. “That’s why were $22 trillion in debt. These people around here can’t say no to anything.”", "timestamp": "11:00 - 11. Jan. 2019", "retweet_count": "92", "favorite_count": "58", "author": "WisVoter", "is_retweet": true}, {"text": "worth a close read ...", "timestamp": "13:11 - 9. Jan. 2019", "retweet_count": "1", "favorite_count": "3", "author": "WisVoter", "is_retweet": true}, {"text": "sizing up strengths and limits of Scott Walker's brand of base politics. in 50 polls in 7 yrs by @MULawPoll his highest approval was 52%; ave. was 47%. he parlayed modest margin of support into 8 yr pol. dominance but couldn't survive a down cycle for GOP", "timestamp": "05:55 - 7. Jan. 2019", "retweet_count": "42", "favorite_count": "106", "author": "WisVoter", "is_retweet": true}, {"text": "interesting contrast here: among GOP voters in WI, the correlation between support for Trump and support for Scott Walker grew over the past year or more, while the correlation between support for Trump and support for Paul Ryan diminished. read the whole thread ...", "timestamp": "14:32 - 6. Jan. 2019", "retweet_count": "23", "favorite_count": "49", "author": "WisVoter", "is_retweet": true}, {"text": "And the Dane County net increase in Dem votes would not have been enough to elect Evers if Gov. Walker hadn't experienced a 120,000 net vote decrease in the rest of WI.", "timestamp": "15:43 - 24. Dez. 2018", "retweet_count": "10", "favorite_count": "50", "author": "WisVoter", "is_retweet": true}, {"text": "Scott Walker won by 6 in '14, lost by 1 in '18  a 7 pt statewide swing -> Dems. \nBut WI communities above 10K pop. had ave. swing of 10 pts to Dems while places under 1K pop. had ave. swing of 2 pts toward GOP. \nHow that pattern cost Walker the election:", "timestamp": "08:04 - 23. Dez. 2018", "retweet_count": "44", "favorite_count": "91", "author": "WisVoter", "is_retweet": true}, {"text": "In his Nov defeat, Scott Walker’s “urban” problem was far broader than Milw and Madison. His support eroded in cities/suburbs of all kinds and regions, and in most communities of any size at all, while he gained ground in many small towns. Bad trade-off: \nhttps://bit.ly/2PWlyeJ ", "timestamp": "06:48 - 22. Dez. 2018", "retweet_count": "109", "favorite_count": "172", "author": "WisVoter", "is_retweet": true}, {"text": "My look at the gerrymandered WI assembly map, where 64% of the districts are more Republican in their makeup than the state as a whole — and the GOP won 64% of the assembly seats nov 6", "timestamp": "11:50 - 6. Dez. 2018", "retweet_count": "63", "favorite_count": "65", "author": "WisVoter", "is_retweet": true}, {"text": "This is a longtime Republican figure who is no longer a Walker supporter. I don't know how representative his reaction is, but I wonder if WI GOP has underestimated the negative perceptions outside its core supporters toward what they're doing in lame-duck session right now", "timestamp": "14:12 - 4. Dez. 2018", "retweet_count": "493", "favorite_count": "1134", "author": "WisVoter", "is_retweet": true}]