[{"text": "I’m about to appear on @1a to talk Trump’s Iran threats and Russia flip-flops, the return of the Islamic State in Syria, Israel’s reluctant entrance into the Syrian civil war, and the rest of the week’s cheerful summertime news. Tune in for the literal opposite of Fake News", "timestamp": "08:01 - 27. Juli 2018", "retweet_count": "1", "favorite_count": "13", "author": "yochidreazen", "is_retweet": true}, {"text": "Casually terrifying line of the day: “Few people close to the president believe he has changed much, and they expect the president to continue bashing long-time U.S. allies and cozying up to Russian President Vladimir Putin whenever he gets the chance.”", "timestamp": "06:19 - 26. Juli 2018", "retweet_count": "2", "favorite_count": "5", "author": "yochidreazen", "is_retweet": true}, {"text": "Clarification of the year: ‘On Twitter, Walsh has clarified that he does not actually support arming kindergartners and has taken the episode in stride. “It’s on me,” he tweeted. “Sacha fooled me good.”’", "timestamp": "06:41 - 18. Juli 2018", "retweet_count": "0", "favorite_count": "4", "author": "yochidreazen", "is_retweet": true}, {"text": "The WH defense of Trump is, something else: ‘A number of people who’ve discussed election meddling with Trump, including current senior administration officials, say his brain can’t process that collusion and cyberattacks are two different things’", "timestamp": "05:46 - 17. Juli 2018", "retweet_count": "12", "favorite_count": "14", "author": "yochidreazen", "is_retweet": true}, {"text": "Even by the low standards of the Trump era, it’s still jarring to see mainstream columnists like Tom Friedman credibly argue that a US president is ‘engaged in treasonous behavior,’ and have a pretty strong case for the charge.", "timestamp": "05:35 - 17. Juli 2018", "retweet_count": "4", "favorite_count": "11", "author": "yochidreazen", "is_retweet": true}, {"text": "The things you do when the mighty Nats offense manages a whopping three hits", "timestamp": "10:20 - 4. Juli 2018", "retweet_count": "0", "favorite_count": "10", "author": "yochidreazen", "is_retweet": true}, {"text": "Now that Israeli authorities have indicted Sara Netanyahu, the big question is whether they're going to indict the prime minister himself next. My latest:", "timestamp": "11:32 - 21. Juni 2018", "retweet_count": "5", "favorite_count": "8", "author": "yochidreazen", "is_retweet": true}, {"text": "The deservedly high political cost of Trump’s immigration cruelty, in one perfect opening graf:\n“Republicans want to talk about tax cuts. Instead, they’re talking about kids in cages”", "timestamp": "04:55 - 19. Juni 2018", "retweet_count": "0", "favorite_count": "9", "author": "yochidreazen", "is_retweet": true}, {"text": "People worry about the nuclear standoff between the US and North Korea, but don’t pay enough attention to the one between India & Pakistan. On the newest Worldly, we talk about that, and the strange case of the murdered journalist who wasn’t actually dead", "timestamp": "12:05 - 1. Juni 2018", "retweet_count": "1", "favorite_count": "9", "author": "yochidreazen", "is_retweet": true}, {"text": "I'm totally in awe of @timkmak's ability to keep calm and professional as Michael Cohen rants, raves and threatens. https://twitter.com/thedailybeast/status/1002275189974020097 …", "timestamp": "12:49 - 31. Mai 2018", "retweet_count": "0", "favorite_count": "4", "author": "yochidreazen", "is_retweet": true}, {"text": "Susan Glasser:  “Sixteen months into the Trump Presidency, it is finally time to say: we really do know. There are no deals with Trump, and there are increasingly unlikely to be. Not on NAFTA. Not on Middle East peace. Or Obamacare or infrastructure.”", "timestamp": "04:44 - 25. Mai 2018", "retweet_count": "4", "favorite_count": "10", "author": "yochidreazen", "is_retweet": true}, {"text": "We were very literally walking into the studio to record an episode of #WorldlyPodcast about the North Korea summit when Trump suddenly canceled it. Here's a new show with our near real-time analysis of why he canceled - and what comes next.", "timestamp": "11:05 - 24. Mai 2018", "retweet_count": "11", "favorite_count": "29", "author": "yochidreazen", "is_retweet": true}, {"text": "The Trump presidency, in 2 quotes.  Giuliani: the “truth is relative.”\n\n“They may have a different version of the truth than we do,” Giuliani said.", "timestamp": "04:47 - 24. Mai 2018", "retweet_count": "2", "favorite_count": "6", "author": "yochidreazen", "is_retweet": true}, {"text": "Your occasional reminder that the world isn’t entirely a terrible place\n\n\" https://mobile.twitter.com/GeorgeHWBush/status/996489197300142080 …", "timestamp": "05:14 - 16. Mai 2018", "retweet_count": "0", "favorite_count": "2", "author": "yochidreazen", "is_retweet": true}, {"text": "All reporters should keep this phrase copied and trays to post into their stories: “But Sunday, in a stunning reversal that officials said came without a formal policy process at the White House...”", "timestamp": "05:16 - 15. Mai 2018", "retweet_count": "0", "favorite_count": "1", "author": "yochidreazen", "is_retweet": true}, {"text": "One more amazing nugget:\n`“He doesn’t live with his wife,” one person who knows both men said of Trump, explaining that he lacks someone “to decompress” with...Hannity “actually likes him” even though “he knows how nuts he is. He’s decided that you’re all in or you’re not.”`", "timestamp": "09:25 - 14. Mai 2018", "retweet_count": "0", "favorite_count": "1", "author": "yochidreazen", "is_retweet": true}, {"text": "From this great @Olivianuzzi piece:", "timestamp": "09:21 - 14. Mai 2018", "retweet_count": "1", "favorite_count": "2", "author": "yochidreazen", "is_retweet": true}, {"text": "Talking to Hannity creates a \"`a fucked-up feedback loop\" that puts Trump \"in a weird headspace. What ends up happening is Judge Jeanine or Hannity fill him up with a bunch of crazy shit, and everyone on staff has to go and knock down all the fucking fires they started.\"`", "timestamp": "09:21 - 14. Mai 2018", "retweet_count": "1", "favorite_count": "9", "author": "yochidreazen", "is_retweet": true}, {"text": "Unless it's members of his own family, or his in-laws, or people like Carl Icahn, or...", "timestamp": "11:44 - 10. Mai 2018", "retweet_count": "0", "favorite_count": "1", "author": "yochidreazen", "is_retweet": true}, {"text": "A European diplomat is so furious over Trump's Iran decision that he has literally coined a new word: \"unisolationism.\" My article on why he said it, and what the hell it means:", "timestamp": "09:23 - 9. Mai 2018", "retweet_count": "1", "favorite_count": "1", "author": "yochidreazen", "is_retweet": true}]